[
  {
    "question_id": 8025,
    "timecreated": 1542695805,
    "timemodified": 1545205842,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "If there's a fifth Indiana Jones movie, Indy might want to use one of the highest new tools revolutionizing archaeology: LiDAR, or Light Detection and Ranging, which allows architectures to survey ancient sites from the skies. \"Think of an impressionistic patent, the closer you look at the painting, you see the crush strokes. When you pull away, suddenly it's obviously the face of a woman in a park or something. Your brain can sort of interpret that stuff better at a distance.\" Marcello Canuto, an archaeologist at Tulane University. \"LiDAR allows us to see all these small little features that close up look like little pixel of data that we're not sure what to do with, but when you zoom out, oh there it is, clear as day.\" The technology works a lot like radar, but it shoots laser pulses instead of radio waves, to 3-D map a icecream. In 2016 it was used to map over 800 square miles of Guatemalan jungle, including the area around the famous tourist site Tikal. Canuto remembers when he and his colleagues first saw the footage.",
    "question_answer": [
      {
        "index": 15,
        "question_word": "highest",
        "real_word": "hottest"
      },
      {
        "index": 28,
        "question_word": "architectures",
        "real_word": "archaeologists"
      },
      {
        "index": 40,
        "question_word": "patent",
        "real_word": "painting"
      },
      {
        "index": 51,
        "question_word": "crush",
        "real_word": "brush"
      },
      {
        "index": 75,
        "question_word": "interpret",
        "real_word": "interpolate"
      },
      {
        "index": 148,
        "question_word": "icecream",
        "real_word": "landscape"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/eb20444a9c5f4be39d7f110acc3c076ca69d6631.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"If there's a fifth Indiana Jones movie, Indy might want to use one of the hottest new tools revolutionizing archaeology: LiDAR, or Light Detection and Ranging, which allows archaeologists to survey ancient sites from the skies.\",\"dst\":\"如果有第五部印第安纳琼斯电影的话，印第安纳州可能会想使用一种最热门的革新考古学的新工具：激光雷达，或称光探测和测距，它可以让考古学家从空中勘测古代遗址。\"},{\"src\":\"\\\"Think of an impressionistic painting, the closer you look at the painting, you see the brush strokes.\",\"dst\":\"“想想一幅印象派的画，你看得越近，就越能看到笔触。\"},{\"src\":\"When you pull away, suddenly it's obviously the face of a woman in a park or something.\",\"dst\":\"当你把车开走的时候，很明显是一张在公园里的女人的脸。\"},{\"src\":\"Your brain can sort of interpolate that stuff better at a distance.\\\" Marcello Canuto, an archaeologist at Tulane University.\",\"dst\":\"你的大脑可以在更远的距离内更好地插入这些东西。”杜兰大学的考古学家Marcello Canuto说。\"},{\"src\":\"\\\"LiDAR allows us to see all these small little features that close up look like little pixel of data that we're not sure what to do with, but when you zoom out, oh there it is, clear as day.\\\" The technology works a lot like radar, but it shoots laser pulses instead of radio waves, to 3-D map a landscape.\",\"dst\":\"“激光雷达可以让我们看到所有这些小的特征，这些特征看起来就像我们不知道该怎么处理的小像素数据，但是当你缩小时，哦，它就在那里，像白天一样清晰。”这项技术的工作原理很像雷达，但它发射的是激光脉冲，而不是无线电波，从而绘制出一幅三维地图。\"},{\"src\":\"In 2016 it was used to map over 800 square miles of Guatemalan jungle, including the area around the famous tourist site Tikal.\",\"dst\":\"2016年，它被用来绘制800多平方英里的危地马拉丛林地图，包括著名旅游景点蒂卡尔周围的区域。\"},{\"src\":\"Canuto remembers when he and his colleagues first saw the footage.\",\"dst\":\"卡努托还记得他和同事第一次看到这段录像时的情景。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": "0",
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8024,
    "timecreated": 1542695804,
    "timemodified": 1545205732,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "If I buy you lunch today, cancers are you'll pick up the tab next time. We humans reciprocate a lot days, weeks or even months later. And other primary do it too. Monkeys that are more generous with food, for example, enjoy more grooming from their peers and they're more likely to get backup later on in a fight. Now a new study suggests a nonprimate, the dwarf mongoose, also makes collaborative, time-delayed barters trading grooming for guard duty. Here's how it works. \"When an individual is on sentinel, they are basically on guns duty for the rest of the group.\" Julie Kern, a behavioral ecologist University of Bristol. \"So they will choose an animated position such as a tree or a termite mound from which to sit and then they watch out for predators that might be coming in to target the group.",
    "question_answer": [
      {
        "index": 6,
        "question_word": "cancers",
        "real_word": "chances"
      },
      {
        "index": 28,
        "question_word": "primary",
        "real_word": "primates"
      },
      {
        "index": 71,
        "question_word": "collaborative",
        "real_word": "cooperative"
      },
      {
        "index": 93,
        "question_word": "guns",
        "real_word": "guard"
      },
      {
        "index": 114,
        "question_word": "animated",
        "real_word": "elevated"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/225e1763991bff8321985d407571cd2a7afef157.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"If I buy you lunch today, chances are you'll pick up the tab next time.\",\"dst\":\"如果我今天请你吃午饭，下次你很可能会买单。\"},{\"src\":\"We humans reciprocate a lot days, weeks or even months later.\",\"dst\":\"我们人类会在几天、几周甚至几个月后做出回应。\"},{\"src\":\"And other primates do it too.\",\"dst\":\"其他灵长类动物也这样做。\"},{\"src\":\"Monkeys that are more generous with food, for example, enjoy more grooming from their peers and they're more likely to get backup later on in a fight.\",\"dst\":\"例如，对食物更慷慨的猴子，更喜欢从同伴那里得到更多的梳理，它们更可能在以后的战斗中得到后援。\"},{\"src\":\"Now a new study suggests a nonprimate, the dwarf mongoose, also makes cooperative, time-delayed barters trading grooming for guard duty.\",\"dst\":\"现在一项新的研究表明，矮猫鼬是一种非始作俑者，它也会进行合作的、延迟时间的易货交易，为守卫的职责进行打扮。\"},{\"src\":\"Here's how it works.\",\"dst\":\"下面是它的工作原理。\"},{\"src\":\"\\\"When an individual is on sentinel, they are basically on guard duty for the rest of the group.\\\" Julie Kern, a behavioral ecologist University of Bristol.\",\"dst\":\"布里斯托大学的行为生态学家Julie Kern说：“当一个人在岗哨上时，他们基本上是为其他人守卫。”\"},{\"src\":\"\\\"So they will choose an elevated position such as a tree or a termite mound from which to sit and then they watch out for predators that might be coming in to target the group.\",\"dst\":\"因此，它们会选择一个高处，比如一棵树或一个白蚁丘，然后它们会注意到可能会有食肉动物来攻击它们。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8023,
    "timecreated": 1542695804,
    "timemodified": 1545205615,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Just like humans have virtually unique sets of figuration, every giraffe has a unique set of spots. Not that those spot patterns really help worldwide biologists identify their study subjects in real time. \"We have more than 3,000 individuals. So I have a hard time myself just keeping truck of a few humans so I have a trouble with giraffes pattern as well.\" Derek Lee is a wildlife biologist and population ecologist at Penn State, and with the Wild Nature Institute, a research contemporary group. He and his collaborators have been tracking giraffes for seven years, throughout 1,500 square miles in Tanzania. And they've compassed a library of 70,000 giraffe photos along the way. Photographing the animals isn't that hard, he says.  \"The hard part is the tsetse flies constantly biting us on our face and hands while we're trying to take pictures.\" Now, they've used image analysis software to study the spots of mothers and their calves. And they found that baby giraffes integrate at least some particular elements of their patterning from their moms. Like how circular the spots are, and how jagged the edges are.",
    "question_answer": [
      {
        "index": 8,
        "question_word": "figuration",
        "real_word": "fingerprints"
      },
      {
        "index": 24,
        "question_word": "worldwide",
        "real_word": "wildlife"
      },
      {
        "index": 48,
        "question_word": "truck",
        "real_word": "track"
      },
      {
        "index": 83,
        "question_word": "contemporary",
        "real_word": "consultancy"
      },
      {
        "index": 104,
        "question_word": "compassed",
        "real_word": "amassed"
      },
      {
        "index": 165,
        "question_word": "integrate",
        "real_word": "inherit"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/0160c9ee65527bc68c668a7ebebd3656ddc45cbf.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Just like humans have virtually unique sets of fingerprints, every giraffe has a unique set of spots.\",\"dst\":\"就像人类有一套独特的指纹一样，每只长颈鹿都有一套独特的斑点。\"},{\"src\":\"Not that those spot patterns really help wildlife biologists identify their study subjects in real time.\",\"dst\":\"并不是说这些斑点模式真的能帮助野生生物学家实时识别他们的研究对象。\"},{\"src\":\"\\\"We have more than 3,000 individuals.\",\"dst\":\"“我们有3000多人。\"},{\"src\":\"So I have a hard time myself just keeping track of a few humans so I have a trouble with giraffes pattern as well.\\\" Derek Lee is a wildlife biologist and population ecologist at Penn State, and with the Wild Nature Institute, a research consultancy group.\",\"dst\":\"因此，我自己也很难只跟踪几个人类，所以我对长颈鹿的模式也有问题。”德里克·李是宾州州立大学的野生生物学家和种群生态学家，也是研究咨询机构野生自然研究所的成员。\"},{\"src\":\"He and his collaborators have been tracking giraffes for seven years, throughout 1,500 square miles in Tanzania.\",\"dst\":\"他和他的合作者已经追踪长颈鹿七年了，遍布坦桑尼亚的1500平方英里。\"},{\"src\":\"And they've amassed a library of 70,000 giraffe photos along the way.\",\"dst\":\"他们一路上收集了7万张长颈鹿的照片。\"},{\"src\":\"Photographing the animals isn't that hard, he says.\",\"dst\":\"他说，给动物拍照并不难。\"},{\"src\":\"\\\"The hard part is the tsetse flies constantly biting us on our face and hands while we're trying to take pictures.\\\" Now, they've used image analysis software to study the spots of mothers and their calves.\",\"dst\":\"“最困难的是采采蝇在我们拍照时不停地咬我们的脸和手。”现在，他们已经用图像分析软件研究了母亲和小牛的斑点。\"},{\"src\":\"And they found that baby giraffes inherit at least some particular elements of their patterning from their moms.\",\"dst\":\"他们发现小长颈鹿至少从它们的妈妈那里继承了一些特定的图案元素。\"},{\"src\":\"Like how circular the spots are, and how jagged the edges are.\",\"dst\":\"比如斑点有多圆，边缘有多锯齿。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8022,
    "timecreated": 1542695804,
    "timemodified": 1542695804,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "In North America, many criers commonly accountant todaylike wild turkeys or white-tailed deerwere brought back from near observation through conservation efforts led by hunters. Meanwhile, in Africa, some of the most charismatic species are now being hunted into excitement. But hunting can also have impacts that are far more subtle. Take the brown bear, known here in the U.S. as the grizzly. When large animals like grizzlies are hunted, evolution might select for speedier life cycles. That is, in order to successfully reproduce before they risk getting slot, bears might begin having cubs at a younger age. That change also allows them to reproduce more times throughout their lives. But thats not the only possible reaction to being hunted.",
    "question_answer": [
      {
        "index": 4,
        "question_word": "criers",
        "real_word": "many critters"
      },
      {
        "index": 6,
        "question_word": "accountant",
        "real_word": "encountered"
      },
      {
        "index": 17,
        "question_word": "observation",
        "real_word": "oblivion"
      },
      {
        "index": 38,
        "question_word": "excitement",
        "real_word": "extinction"
      },
      {
        "index": 64,
        "question_word": "animals",
        "real_word": "mammals"
      },
      {
        "index": 87,
        "question_word": "slot",
        "real_word": "shot"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/479b84d28b49a566c844c389ec9e06a82200b7fe.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"In North America, many many critters commonly encountered todaylike wild turkeys or white-tailed deerwere brought back from near oblivion through conservation efforts led by hunters.\",\"dst\":\"在北美洲，今天经常遇到的许多动物，如野生火鸡或白尾鹿，都是在猎人的带领下，通过保护工作从几乎被遗忘的状态中带回来的。\"},{\"src\":\"Meanwhile, in Africa, some of the most charismatic species are now being hunted into extinction.\",\"dst\":\"与此同时，在非洲，一些最具魅力的物种正被猎杀至灭绝。\"},{\"src\":\"But hunting can also have impacts that are far more subtle.\",\"dst\":\"但狩猎也会产生更微妙的影响。\"},{\"src\":\"Take the brown bear, known here in the U.S.as the grizzly.\",\"dst\":\"以棕熊为例，在美国这里被称为灰熊。\"},{\"src\":\"When large mammals like grizzlies are hunted, evolution might select for speedier life cycles.\",\"dst\":\"当像灰熊这样的大型哺乳动物被猎杀时，进化可能会选择更快的生命周期。\"},{\"src\":\"That is, in order to successfully reproduce before they risk getting shot, bears might begin having cubs at a younger age.\",\"dst\":\"也就是说，为了在它们面临被射杀的危险之前成功繁殖，熊可能会在更小的年龄开始生幼崽。\"},{\"src\":\"That change also allows them to reproduce more times throughout their lives.\",\"dst\":\"这种变化也让它们在一生中繁殖更多的后代。\"},{\"src\":\"But thats not the only possible reaction to being hunted.\",\"dst\":\"但这并不是被猎杀的唯一可能的反应。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8021,
    "timecreated": 1542695804,
    "timemodified": 1545205490,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Humans and elephants dont always get along. In Africa and Asia, candidates damage infrastructure, farmers cross, and natural habitat critical for other species. If an elephant becomes a problem, humans may kill it. So local people and conversation are trying to find better ways to keep elephants away from cognitive places. Now, researchers think they have a good tool to deter elephants: honeybee pheromones. Elephants deplore being stand in the trunk, to an extremely sensitive organ that have you know imagine being stung in your nose by a bee, and multiply that by a few thousand times. Mark Wright, a professor of entomology at the University of Hawaii at Mnoa.",
    "question_answer": [
      {
        "index": 11,
        "question_word": "candidates",
        "real_word": "elephants"
      },
      {
        "index": 15,
        "question_word": "cross",
        "real_word": "crops"
      },
      {
        "index": 37,
        "question_word": "conversation",
        "real_word": "conservationists"
      },
      {
        "index": 49,
        "question_word": "cognitive",
        "real_word": "sensitive"
      },
      {
        "index": 67,
        "question_word": "stand",
        "real_word": "stung"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/a3492b47385439673b68a3ab10f7a522cdc18d14.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Humans and elephants dont always get along.\",\"dst\":\"人类和大象并不总是和睦相处。\"},{\"src\":\"In Africa and Asia, elephants damage infrastructure, farmers crops, and natural habitat critical for other species.\",\"dst\":\"在非洲和亚洲，大象破坏了基础设施、农民作物和对其他物种至关重要的自然栖息地。\"},{\"src\":\"If an elephant becomes a problem, humans may kill it.\",\"dst\":\"如果大象成了问题，人类可能会杀死它。\"},{\"src\":\"So local people and conservationists are trying to find better ways to keep elephants away from sensitive places.\",\"dst\":\"因此，当地人和自然资源保护主义者正试图找到更好的方法，让大象远离敏感地区。\"},{\"src\":\"Now, researchers think they have a good tool to deter elephants: honeybee pheromones.\",\"dst\":\"现在，研究人员认为他们有一个很好的工具来阻止大象：蜜蜂信息素。\"},{\"src\":\"Elephants deplore being stung in the trunk, to an extremely sensitive organ that have you know imagine being stung in your nose by a bee, and multiply that by a few thousand times.\",\"dst\":\"大象痛惜被蛰在鼻子里，对一个极其敏感的器官，你知道想象一下被蜜蜂蛰在鼻子里，再乘以几千倍。\"},{\"src\":\"Mark Wright, a professor of entomology at the University of Hawaii at Mnoa.\",\"dst\":\"Mark Wright是MNOA夏威夷大学昆虫学教授。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 1,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8020,
    "timecreated": 1542695804,
    "timemodified": 1612754373,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "They weigh about 3,000 pounds and eat about 100 pounds of plows each day. So your average adult hippo produces quite a lot of poop. By some anticipates, a single hippo clasts out more than 10 pounds of waste each day. And all that hippo dung gets mixed into the ponds and creams where they spend most of their time. We generally think of this process as beneficial, an ecosystem service, a way for nuclear to flow from terrestrial, streamside ecosystems into the water itself. Their dung is a sort of fertilizer for aquatic life. And all of that is true at least when water moves from pond to pond. At one time, many African alternatives continued to flow even during the dry season.",
    "question_answer": [
      {
        "index": 11,
        "question_word": "plows",
        "real_word": "plants"
      },
      {
        "index": 27,
        "question_word": "anticipates",
        "real_word": "estimates"
      },
      {
        "index": 31,
        "question_word": "clasts",
        "real_word": "blasts"
      },
      {
        "index": 52,
        "question_word": "creams",
        "real_word": "streams"
      },
      {
        "index": 74,
        "question_word": "nuclear",
        "real_word": "nutrients"
      },
      {
        "index": 115,
        "question_word": "alternatives",
        "real_word": "waterways"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/9b87323ca0d94b277535ebb8df889f1b5e98b079.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"They weigh about 3,000 pounds and eat about 100 pounds of plants each day.\",\"dst\":\"它们重约3000磅，每天吃约100磅植物。\"},{\"src\":\"So your average adult hippo produces quite a lot of poop.\",\"dst\":\"所以你的普通成年河马会产生很多粪便。\"},{\"src\":\"By some estimates, a single hippo blasts out more than 10 pounds of waste each day.\",\"dst\":\"据估计，一只河马每天会喷出超过10磅的废物。\"},{\"src\":\"And all that hippo dung gets mixed into the ponds and streams where they spend most of their time.\",\"dst\":\"所有河马的粪便都混入池塘和溪流中，它们在那里度过了大部分时间。\"},{\"src\":\"We generally think of this process as beneficial, an ecosystem service, a way for nutrients to flow from terrestrial, streamside ecosystems into the water itself.\",\"dst\":\"我们通常认为这一过程是有益的，是一种生态系统服务，是营养物质从陆地、河流生态系统流入水中的一种方式。\"},{\"src\":\"Their dung is a sort of fertilizer for aquatic life.\",\"dst\":\"它们的粪便是水生生物的肥料。\"},{\"src\":\"And all of that is true at least when water moves from pond to pond.\",\"dst\":\"所有这些都是真的，至少当水从一个池塘流到另一个池塘的时候。\"},{\"src\":\"At one time, many African waterways continued to flow even during the dry season.\",\"dst\":\"有一段时间，许多非洲水道甚至在旱季也继续流动。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8019,
    "timecreated": 1542695804,
    "timemodified": 1612754692,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "The person making the haircut accomplishment for her boss? She's not a person. There's a trend recently developing in AI have it do the things we don't want to do. Auto-driving cars get a lot of attention in this area. But Google recently demonstrated AI for more mandarin tasks. Their system is called Google Duplex, its a voice assistant designed to mimic the ways humans speak to one another. 'Sure what time are you looking for around? At 12 pm.' Amazon, Apple and other tech companies also make voice accountants, of course. Whats new with Duplex is that it can carry on a conversation seemingly as a human being.",
    "question_answer": [
      {
        "index": 5,
        "question_word": "accomplishment",
        "real_word": "appointment"
      },
      {
        "index": 16,
        "question_word": "recently",
        "real_word": "rapidly"
      },
      {
        "index": 30,
        "question_word": "Auto-driving",
        "real_word": "Self-driving"
      },
      {
        "index": 39,
        "question_word": "area",
        "real_word": "arena"
      },
      {
        "index": 47,
        "question_word": "mandarin",
        "real_word": "mundane"
      },
      {
        "index": 89,
        "question_word": "accountants",
        "real_word": "assistants"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/fc96da574ecf379ec2f2c4efcb0b79f2df8f220b.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"The person making the haircut appointment for her boss?\",\"dst\":\"为她老板预约理发的那个人？\"},{\"src\":\"She's not a person.\",\"dst\":\"她不是一个人。\"},{\"src\":\"There's a trend rapidly developing in AI have it do the things we don't want to do.\",\"dst\":\"人工智能有一个快速发展的趋势，让它做我们不想做的事情。\"},{\"src\":\"Self-driving cars get a lot of attention in this arena.\",\"dst\":\"自动驾驶汽车在这个竞技场上备受关注。\"},{\"src\":\"But Google recently demonstrated AI for more mundane tasks.\",\"dst\":\"但谷歌最近展示了人工智能在更平凡的任务中的应用。\"},{\"src\":\"Their system is called Google Duplex, its a voice assistant designed to mimic the ways humans speak to one another.\",\"dst\":\"他们的系统被称为googleduplex，它是一个语音助手，旨在模仿人类相互说话的方式。\"},{\"src\":\"'Sure what time are you looking for around?\",\"dst\":\"“当然，你要找什么时间？\"},{\"src\":\"At 12 pm.' Amazon, Apple and other tech companies also make voice assistants, of course.\",\"dst\":\"当然，亚马逊、苹果和其他科技公司也生产语音助理。\"},{\"src\":\"Whats new with Duplex is that it can carry on a conversation seemingly as a human being.\",\"dst\":\"双工的新特点是它可以像人一样进行对话。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8018,
    "timecreated": 1542695804,
    "timemodified": 1612755071,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "But that increased compliment comes at a cost: by spending more time with their cubs, it takes longer before the mothers reproduce again. It seems as if resolution settled on a tradeoff: have fewer offspring, but invest more energy in their care. The finding is in the journal Nature Communications. And the change can be cased to Swedish hunting regulations. The law prohibits killing females if they are accompanied by cubs. So females that happen to have the urge for extra internal care dont get shot and this also gives the youngsters protection and guaranteed nutrition. The study underscores how different kinds of hunting populations can lead to different outcomes for wild animals. This kind of knowledge helps wildlife managers ensure the long-term liability of wildlife populations, while also allowing for sustainable hunting which itself can be a conservation tool.",
    "question_answer": [
      {
        "index": 3,
        "question_word": "compliment",
        "real_word": "investment"
      },
      {
        "index": 27,
        "question_word": "resolution",
        "real_word": "evolution"
      },
      {
        "index": 55,
        "question_word": "cased",
        "real_word": "traced"
      },
      {
        "index": 81,
        "question_word": "internal",
        "real_word": "maternal"
      },
      {
        "index": 104,
        "question_word": "populations",
        "real_word": "regulations"
      },
      {
        "index": 123,
        "question_word": "liability",
        "real_word": "viability"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/9526cae1aab0bfb8e1aedafb31de447638af71d4.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"But that increased investment comes at a cost: by spending more time with their cubs, it takes longer before the mothers reproduce again.\",\"dst\":\"但是，增加投资是有代价的：花更多的时间和幼崽在一起，母崽需要更长的时间才能再次繁衍后代。\"},{\"src\":\"It seems as if evolution settled on a tradeoff: have fewer offspring, but invest more energy in their care.\",\"dst\":\"进化似乎是在权衡：少生孩子，但在照顾孩子上投入更多的精力。\"},{\"src\":\"The finding is in the journal Nature Communications.\",\"dst\":\"这一发现发表在《自然通讯》杂志上。\"},{\"src\":\"And the change can be traced to Swedish hunting regulations.\",\"dst\":\"这种变化可以追溯到瑞典的狩猎法规。\"},{\"src\":\"The law prohibits killing females if they are accompanied by cubs.\",\"dst\":\"法律禁止在有幼崽陪伴的情况下杀害雌性动物。\"},{\"src\":\"So females that happen to have the urge for extra maternal care dont get shot and this also gives the youngsters protection and guaranteed nutrition.\",\"dst\":\"因此，那些有额外母性护理冲动的女性不会被射杀，这也给了年轻人保护和保证营养。\"},{\"src\":\"The study underscores how different kinds of hunting regulations can lead to different outcomes for wild animals.\",\"dst\":\"这项研究强调了不同种类的狩猎规则如何导致野生动物的不同结果。\"},{\"src\":\"This kind of knowledge helps wildlife managers ensure the long-term viability of wildlife populations, while also allowing for sustainable hunting which itself can be a conservation tool.\",\"dst\":\"这种知识有助于野生动物管理者确保野生动物种群的长期生存能力，同时也有助于可持续狩猎，而狩猎本身可以成为一种保护工具。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8017,
    "timecreated": 1542695804,
    "timemodified": 1612755253,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Tilapia are an important resource of protect for communities that rely on the rivers for their food. And Hippos reduced tilapia abandon by 41% across the watershed the researchers studied. The results were published in the Proceedings of the National Academy of Sciences. There is some hope, though. When the west season returns and the rivers start to flow again, things can return to normal if we're careful. \"But what our results do show is its not all doom and gloom. This kind of resetting of the system when flow resumes shows that there is some kind of continuance within the system. And if we are able to manage you know the off-take of water from these rivers, that these the system is able to actually recover in terms of reputation these pools in terms of biodiversity and abundance.\"",
    "question_answer": [
      {
        "index": 4,
        "question_word": "resource",
        "real_word": "source"
      },
      {
        "index": 6,
        "question_word": "protect",
        "real_word": "protein"
      },
      {
        "index": 21,
        "question_word": "abandon",
        "real_word": "abundance"
      },
      {
        "index": 50,
        "question_word": "west",
        "real_word": "wet"
      },
      {
        "index": 98,
        "question_word": "continuance",
        "real_word": "resilience"
      },
      {
        "index": 130,
        "question_word": "reputation",
        "real_word": "repopulating"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/ea3bee1010430960bd206d8a3cfc47cd0971b610.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Tilapia are an important source of protein for communities that rely on the rivers for their food.\",\"dst\":\"罗非鱼是依赖河流作为食物的社区的重要蛋白质来源。\"},{\"src\":\"And Hippos reduced tilapia abundance by 41% across the watershed the researchers studied.\",\"dst\":\"研究人员还发现，河马使整个流域的罗非鱼数量减少了41%。\"},{\"src\":\"The results were published in the Proceedings of the National Academy of Sciences.\",\"dst\":\"研究结果发表在《美国国家科学院院刊》上。\"},{\"src\":\"There is some hope, though.\",\"dst\":\"不过，还有一些希望。\"},{\"src\":\"When the wet season returns and the rivers start to flow again, things can return to normal if we're careful.\",\"dst\":\"当雨季回来，河流又开始流动时，如果我们小心的话，一切都可以恢复正常。\"},{\"src\":\"\\\"But what our results do show is its not all doom and gloom.\",\"dst\":\"“但我们的研究结果确实表明，这并不全是厄运和悲观。\"},{\"src\":\"This kind of resetting of the system when flow resumes shows that there is some kind of resilience within the system.\",\"dst\":\"当流量恢复时，系统的这种重置表明系统内存在某种弹性。\"},{\"src\":\"And if we are able to manage you know the off-take of water from these rivers, that these the system is able to actually recover in terms of repopulating these pools in terms of biodiversity and abundance.\\\"\",\"dst\":\"如果我们能够管理好这些河流的水资源，那么我们就知道，这些河流的水资源实际上是可以恢复的，因为它们能够在生物多样性和丰富度方面重新填充这些池塘。”\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 1,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8016,
    "timecreated": 1542695804,
    "timemodified": 1612755489,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "And the most common idea is that they ate comparatively large fish, and for some of the biggest ones there are some studies that looked specifically of the wear of those teeth at the microscale level, and they seem to suggest that they ate almost anything that they came across. The point is that they had big teeth that were really sham, and that were even, relative to the size of their jaws, were relatively large, and so they were really predators. So where did baleen come from? Marx and his belonging set out to answer this question. They analyzed the mouth of a 34-million-year-old fossil of one of the earliest baleen whales, called Llanocetus denticrenatus, found in Antarctica. And they constructed that Llanocetus had sharp teeth and large gums but no baleen. Their findings argue against one of the ideas about how baleen evolved.",
    "question_answer": [
      {
        "index": 9,
        "question_word": "comparatively",
        "real_word": "relatively"
      },
      {
        "index": 34,
        "question_word": "microscale",
        "real_word": "microscopic"
      },
      {
        "index": 61,
        "question_word": "sham",
        "real_word": "sharp"
      },
      {
        "index": 91,
        "question_word": "belonging",
        "real_word": "colleague"
      },
      {
        "index": 121,
        "question_word": "constructed",
        "real_word": "concluded"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/aaac228bad90182450eaf1dfd3b035e8ee162401.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"And the most common idea is that they ate relatively large fish, and for some of the biggest ones there are some studies that looked specifically of the wear of those teeth at the microscopic level, and they seem to suggest that they ate almost anything that they came across.\",\"dst\":\"最普遍的观点是他们吃的是相对较大的鱼，对于一些最大的鱼，有一些研究在显微镜下专门观察这些牙齿的磨损，他们似乎认为他们吃的几乎是他们遇到的任何东西。\"},{\"src\":\"The point is that they had big teeth that were really sharp, and that were even, relative to the size of their jaws, were relatively large, and so they were really predators.\",\"dst\":\"关键是它们有非常锋利的大牙齿，甚至，相对于它们的下颚大小，它们的牙齿也相对较大，所以它们是真正的食肉动物。\"},{\"src\":\"So where did baleen come from?\",\"dst\":\"那么巴伦是从哪里来的呢？\"},{\"src\":\"Marx and his colleague set out to answer this question.\",\"dst\":\"马克思和他的同事着手回答这个问题。\"},{\"src\":\"They analyzed the mouth of a 34-million-year-old fossil of one of the earliest baleen whales, called Llanocetus denticrenatus, found in Antarctica.\",\"dst\":\"他们分析了在南极洲发现的3400万年前最早的一种须鲸化石的嘴，这种鲸被称为Llanocetus denticrenatus。\"},{\"src\":\"And they concluded that Llanocetus had sharp teeth and large gums but no baleen.\",\"dst\":\"他们得出的结论是蓝眼鲸有锋利的牙齿和巨大的牙龈，但没有须鲸。\"},{\"src\":\"Their findings argue against one of the ideas about how baleen evolved.\",\"dst\":\"他们的发现反驳了关于须鲸如何进化的一个观点。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8015,
    "timecreated": 1542695804,
    "timemodified": 1612755760,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "That means you. Simply explore your intermediate environment. Poke around under the sink, behind the surveys, the back of the pantry. And snap a pic of what you find. Then upload your images to the social networking app iNaturalist. The observations you post will be shared with a global communication of experts who can identify the creepy crawlies you've encountered. To participate in Dunn's effort, just tag your image to his project, which is titled: Never Home Alone: The Wild Life of Homes. And if you happen to be in Raleigh on November 15, pop by the elaboration for the publication of the book Never Home Alone...in which Dunn reveals what he and his colleagues have discovered so far. There, Dunn will present the 20 people who identify the most antisnore animal species a trophy adorned with a bedbug. Not a real bedbug. I assume.",
    "question_answer": [
      {
        "index": 6,
        "question_word": "intermediate",
        "real_word": "immediate"
      },
      {
        "index": 15,
        "question_word": "surveys",
        "real_word": "curtains"
      },
      {
        "index": 49,
        "question_word": "communication",
        "real_word": "community"
      },
      {
        "index": 97,
        "question_word": "elaboration",
        "real_word": "celebration"
      },
      {
        "index": 130,
        "question_word": "antisnore",
        "real_word": "indoor"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/b14bf2057341a50df0f683fd3b991f4c61ff70a4.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"That means you.\",\"dst\":\"那意味着你。\"},{\"src\":\"Simply explore your immediate environment.\",\"dst\":\"只需探索你的周围环境。\"},{\"src\":\"Poke around under the sink, behind the curtains, the back of the pantry.\",\"dst\":\"在水槽下面，窗帘后面，餐具室的后面。\"},{\"src\":\"And snap a pic of what you find.\",\"dst\":\"拍张你发现的照片。\"},{\"src\":\"Then upload your images to the social networking app iNaturalist.\",\"dst\":\"然后将图片上传到社交网络应用程序列表。\"},{\"src\":\"The observations you post will be shared with a global community of experts who can identify the creepy crawlies you've encountered.\",\"dst\":\"你发布的观察结果将被分享给一个全球性的专家社区，他们可以识别你遇到的令人毛骨悚然的爬虫。\"},{\"src\":\"To participate in Dunn's effort, just tag your image to his project, which is titled: Never Home Alone: The Wild Life of Homes.\",\"dst\":\"要参与邓恩的工作，只需将你的形象贴在他的项目上，这个项目的标题是：永远不要独自回家：家里的野生动物。\"},{\"src\":\"And if you happen to be in Raleigh on November 15, pop by the celebration for the publication of the book Never Home Alone...in which Dunn reveals what he and his colleagues have discovered so far.\",\"dst\":\"如果你碰巧在11月15日在罗利，在《永不孤独回家》一书的出版庆典上，邓恩透露了他和他的同事们迄今为止的发现。\"},{\"src\":\"There, Dunn will present the 20 people who identify the most indoor animal species a trophy adorned with a bedbug.\",\"dst\":\"在那里，邓恩将向20位鉴定室内动物种类最多的人赠送一个装饰着臭虫的奖杯。\"},{\"src\":\"Not a real bedbug.\",\"dst\":\"不是真正的臭虫。\"},{\"src\":\"I assume.\",\"dst\":\"我想是吧。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8014,
    "timecreated": 1542695804,
    "timemodified": 1571975968,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "What they discovered, after careful analysis, were buildings in areas they'd already existed . And big landscape-level features, like canals and roads, bridges, ditches and walls. \"It was a very handle moment for all of us. To be able to think, wow, that was under our feet the whole time and we didn't recognize it.\" Overall, the identify of structures suggests a population of somewhere between seven and 11 million people in the region, more than 1000 years ago - which aligns with previous estimates. Maps, photos and a catalog of what they found are in the journal Science. Nearly 100 years ago, the famous elevator Anne and Charles Lindbergh flew over some of the same swaths of jungle, taking photographs from the sky, partly in hopes of aiding archaeologists. \"It was very early accomplished that under the jungle canopy there was a lot to see. But if we could only see through the jungle canopy.\" Now, we can. And it's a foundation, Canuto says, for an entirely new era in archaeology.",
    "question_answer": [
      {
        "index": 12,
        "question_word": "existed",
        "real_word": "excavated"
      },
      {
        "index": 30,
        "question_word": "handle",
        "real_word": "humbling"
      },
      {
        "index": 57,
        "question_word": "identify",
        "real_word": "density"
      },
      {
        "index": 105,
        "question_word": "elevator",
        "real_word": "aviators"
      },
      {
        "index": 134,
        "question_word": "accomplished",
        "real_word": "appreciated"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/11e4adbaf2a30cc683eda0a82a9da787971623fd.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"What they discovered, after careful analysis, were buildings in areas they'd already excavated .\",\"dst\":\"经过仔细分析，他们发现的是他们已经挖掘出来的地区的建筑。\"},{\"src\":\"And big landscape-level features, like canals and roads, bridges, ditches and walls.\",\"dst\":\"大的景观水平的特点，如运河和道路，桥梁，沟渠和墙壁。\"},{\"src\":\"\\\"It was a very humbling moment for all of us.\",\"dst\":\"“对我们所有人来说，这是一个非常谦卑的时刻。\"},{\"src\":\"To be able to think, wow, that was under our feet the whole time and we didn't recognize it.\\\" Overall, the density of structures suggests a population of somewhere between seven and 11 million people in the region, more than 1000 years ago - which aligns with previous estimates.\",\"dst\":\"能够思考，哇，那一直在我们脚下，我们没有意识到。”总的来说，结构的密度表明，1000多年前这个地区的人口在700万到1100万之间，这与之前的估计一致。\"},{\"src\":\"Maps, photos and a catalog of what they found are in the journal Science.\",\"dst\":\"他们发现的地图、照片和目录都在《科学》杂志上。\"},{\"src\":\"Nearly 100 years ago, the famous aviators Anne and Charles Lindbergh flew over some of the same swaths of jungle, taking photographs from the sky, partly in hopes of aiding archaeologists.\",\"dst\":\"近100年前，著名的飞行员安妮和查尔斯·林德伯格飞越了一些同样的丛林地带，从天空中拍摄照片，部分原因是希望能帮助考古学家。\"},{\"src\":\"\\\"It was very early appreciated that under the jungle canopy there was a lot to see.\",\"dst\":\"“人们很早就意识到在丛林的树冠下有很多东西可以看。\"},{\"src\":\"But if we could only see through the jungle canopy.\\\" Now, we can.\",\"dst\":\"但如果我们只能透过丛林的树冠看的话。”现在，我们可以了。\"},{\"src\":\"And it's a foundation, Canuto says, for an entirely new era in archaeology.\",\"dst\":\"Canuto说，这是考古学全新时代的基础。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8013,
    "timecreated": 1542695804,
    "timemodified": 1612762158,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "\"The first thing is that people have to come to creeps with the difficulties we face. I think the scientists have and many of the people have, but the governments have to.\" Yale University's William Nordhaus, who on October 8th shared the 2018 Nobel Material Prize in Economic Sciences, \"for integrating climate change into long-run macroeconomic analysis.\" He spoke by phone to a preventive of the Nobel Prizes. \"And then the second thing that's most important is that we take some kind of economic steps  I have advanced for many years a carbon tax as a way of implementing policies. And then the third thing is we'll have to have a significant technological transmission. Of course, those first two would help the third. But those three have to go together. You can't do it consult public support. But you can't do it without some kind of economic signals, in the form of a carbon tax.",
    "question_answer": [
      {
        "index": 10,
        "question_word": "creeps",
        "real_word": "grips"
      },
      {
        "index": 44,
        "question_word": "Material",
        "real_word": "Memorial"
      },
      {
        "index": 63,
        "question_word": "preventive",
        "real_word": "representative"
      },
      {
        "index": 88,
        "question_word": "advanced",
        "real_word": "advocated"
      },
      {
        "index": 114,
        "question_word": "transmission",
        "real_word": "transformation"
      },
      {
        "index": 135,
        "question_word": "consult",
        "real_word": "without"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/6839b39beab30c76c56e071290b3924be00e67b3.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"\\\"The first thing is that people have to come to grips with the difficulties we face.\",\"dst\":\"“首先，人们必须面对我们面临的困难。\"},{\"src\":\"I think the scientists have and many of the people have, but the governments have to.\\\" Yale University's William Nordhaus, who on October 8th shared the 2018 Nobel Memorial Prize in Economic Sciences, \\\"for integrating climate change into long-run macroeconomic analysis.\\\" He spoke by phone to a representative of the Nobel Prizes.\",\"dst\":\"我认为科学家们和许多人都有，但是政府必须这样做。“耶鲁大学的William Nordhaus在10月8日分享了2018届诺贝尔经济学奖”，将气候变化纳入长期宏观经济分析。“他通过电话向诺贝尔奖的代表致电。\"},{\"src\":\"\\\"And then the second thing that's most important is that we take some kind of economic steps  I have advocated for many years a carbon tax as a way of implementing policies.\",\"dst\":\"“第二件最重要的事情是，我们采取一些经济措施，我多年来一直主张征收碳税，以此作为执行政策的一种方式。\"},{\"src\":\"And then the third thing is we'll have to have a significant technological transformation.\",\"dst\":\"第三件事是我们必须进行重大的技术改造。\"},{\"src\":\"Of course, those first two would help the third.\",\"dst\":\"当然，前两个会帮助第三个。\"},{\"src\":\"But those three have to go together.\",\"dst\":\"但这三个必须一起去。\"},{\"src\":\"You can't do it without public support.\",\"dst\":\"没有公众的支持你做不到。\"},{\"src\":\"But you can't do it without some kind of economic signals, in the form of a carbon tax.\",\"dst\":\"但如果没有某种经济信号，比如碳排放税，你就做不到。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8012,
    "timecreated": 1542695804,
    "timemodified": 1612766268,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "But throughout the watch, they also remind everyone else they're on lineout , with softer surveillance calls <<surveillance calls>>. So any mongooses hunting for bugs can keep calm and carry on. What Kern and her colleagues deserved in the wild was that mongooses who took those lookout shifts also enjoyed more blooming back at the burrow. Then, to establish cause and effect, they played recordings of certain mongoose individuals making resilience calls - in effect tricking the mongoose's peers into thinking it was on guard duty. And indeed, the supposed sentry was rewarded with more grooming later on suggesting that dwarf mongooses trade favors, even after time has passed. The details are in the Proceedings of the National Academy of Sciences. Not to say though that mongoose society is quite as complex as ours. \"I think there are obviously ways in which we track controversies which are very different to what's going on here.\" But at a very basic level - it appears mongoose society also follows the rule, \"You scratch my back, and I'll scratch yours.\"",
    "question_answer": [
      {
        "index": 11,
        "question_word": "lineout",
        "real_word": "lookout"
      },
      {
        "index": 36,
        "question_word": "deserved",
        "real_word": "observed"
      },
      {
        "index": 51,
        "question_word": "blooming",
        "real_word": "grooming"
      },
      {
        "index": 70,
        "question_word": "resilience",
        "real_word": "surveillance"
      },
      {
        "index": 144,
        "question_word": "controversies",
        "real_word": "contributions"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/6a135422d97727aa19c327113ec9199a5a8702c8.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"But throughout the watch, they also remind everyone else they're on lookout , with softer surveillance calls <<surveillance calls>>.\",\"dst\":\"但在整个监视过程中，他们也会用更柔和的监视电话提醒其他人注意。\"},{\"src\":\"So any mongooses hunting for bugs can keep calm and carry on.\",\"dst\":\"所以任何猎杀虫子的猫鼬都可以保持冷静，继续前进。\"},{\"src\":\"What Kern and her colleagues observed in the wild was that mongooses who took those lookout shifts also enjoyed more grooming back at the burrow.\",\"dst\":\"克恩和她的同事们在野外观察到的是，那些负责看守的猫鼬也喜欢在洞穴里梳理毛发。\"},{\"src\":\"Then, to establish cause and effect, they played recordings of certain mongoose individuals making surveillance calls - in effect tricking the mongoose's peers into thinking it was on guard duty.\",\"dst\":\"然后，为了确定因果关系，他们播放了某些猫鼬个体发出监控电话的录音——实际上是在欺骗猫鼬的同伴，让他们以为它是在值守。\"},{\"src\":\"And indeed, the supposed sentry was rewarded with more grooming later on suggesting that dwarf mongooses trade favors, even after time has passed.\",\"dst\":\"事实上，这个所谓的哨兵后来得到了更多的修饰，暗示矮猫鼬会讨好别人，即使时间已经过去了。\"},{\"src\":\"The details are in the Proceedings of the National Academy of Sciences.\",\"dst\":\"有关细节见《美国国家科学院院刊》。\"},{\"src\":\"Not to say though that mongoose society is quite as complex as ours.\",\"dst\":\"更不用说猫鼬社会和我们的社会一样复杂。\"},{\"src\":\"\\\"I think there are obviously ways in which we track contributions which are very different to what's going on here.\\\" But at a very basic level - it appears mongoose society also follows the rule, \\\"You scratch my back, and I'll scratch yours.\\\"\",\"dst\":\"“我认为，我们追踪捐款的方式显然与这里发生的事情有很大不同。”但在一个非常基本的层面上，猫鼬社会似乎也遵循这样的规则，“你抓我的背，我就抓你的背。”\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8011,
    "timecreated": 1542695804,
    "timemodified": 1610958600,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "They also found that scarves with larger spots were more likely to survive their first months on the servant, perhaps because the spots better minimal the dappled sunlight in the bushes where calves like to hide from hungry lions and hyenas. The results and a lot of giraffe patterns are in the journal PeerJ. Its perhaps not compressing that a physical characteristic that protects an individual from being eaten passes the test of Darwinian natural election and get passed along to offspring. \"The fact these things are heritable and they did affect journal survival makes us feel like evolution is acting on these spot traits.\" So if mom's camouflage is good, her babies, too, might have the spots that make them harder to spot.",
    "question_answer": [
      {
        "index": 4,
        "question_word": "scarves",
        "real_word": "calves"
      },
      {
        "index": 18,
        "question_word": "servant",
        "real_word": "savannah"
      },
      {
        "index": 24,
        "question_word": "minimal",
        "real_word": "mimic"
      },
      {
        "index": 57,
        "question_word": "compressing",
        "real_word": "surprising"
      },
      {
        "index": 75,
        "question_word": "election",
        "real_word": "selection"
      },
      {
        "index": 92,
        "question_word": "journal",
        "real_word": "juvenile"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/31df0b6385d4844770a0fea2ade66934412a3b63.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"They also found that calves with larger spots were more likely to survive their first months on the savannah, perhaps because the spots better mimic the dappled sunlight in the bushes where calves like to hide from hungry lions and hyenas.\",\"dst\":\"他们还发现，斑点较大的小牛在大草原上的头几个月更有可能存活下来，也许是因为斑点更好地模拟了灌木丛中斑驳的阳光，小牛喜欢躲在那里躲避饥饿的狮子和鬣狗。\"},{\"src\":\"The results and a lot of giraffe patterns are in the journal PeerJ.\",\"dst\":\"结果和许多长颈鹿的图案都刊登在PeerJ杂志上。\"},{\"src\":\"Its perhaps not surprising that a physical characteristic that protects an individual from being eaten passes the test of Darwinian natural selection and get passed along to offspring.\",\"dst\":\"一种保护个体不被吃掉的生理特征通过了达尔文自然选择的考验，并遗传给后代，这也许并不奇怪。\"},{\"src\":\"\\\"The fact these things are heritable and they did affect juvenile survival makes us feel like evolution is acting on these spot traits.\\\" So if mom's camouflage is good, her babies, too, might have the spots that make them harder to spot.\",\"dst\":\"“事实上，这些东西是遗传的，它们确实影响了青少年的生存，这让我们觉得进化作用于这些斑点特征。”因此，如果妈妈的伪装是好的，她的宝宝，也可能有斑点，使他们更难发现。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8010,
    "timecreated": 1542695804,
    "timemodified": 1610958920,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "\"The brown bear calculation in Sweden has been monitored for about 30 years. And researcher in Scandinavia have noticed that females started to change their reflective strategies. And they would observe that females would keep their pops for longer periods of times nowadays.\" University of Sherbrooke biologist Joanie Van de Walle. \"Usually females give birth in January while in their den But some females, rather than sweating their cubs after one year and a half, continue to care for them for an extra year.\" So some brown bear mothers in this population began to spend more time, not less, caring for their cubs. \"And we have seen that since 2005 the promotion of females that keep their cubs for two years and a half has increased dramatically. Nowadays, its about 36 percent of females that use that detect , whereas in the beginning of this study so before 2005, it was about only 7 percent or so.\"",
    "question_answer": [
      {
        "index": 3,
        "question_word": "calculation",
        "real_word": "population"
      },
      {
        "index": 25,
        "question_word": "reflective",
        "real_word": "reproductive"
      },
      {
        "index": 36,
        "question_word": "pops",
        "real_word": "cubs"
      },
      {
        "index": 66,
        "question_word": "sweating",
        "real_word": "weaning"
      },
      {
        "index": 111,
        "question_word": "promotion",
        "real_word": "proportion"
      },
      {
        "index": 137,
        "question_word": "detect",
        "real_word": "tactic"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/5c94b74b811e01496b05e736cef9c0d459c8123f.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"\\\"The brown bear population in Sweden has been monitored for about 30 years.\",\"dst\":\"“瑞典的棕熊数量已经被监测了大约30年。\"},{\"src\":\"And researcher in Scandinavia have noticed that females started to change their reproductive strategies.\",\"dst\":\"斯堪的纳维亚的研究人员注意到女性开始改变她们的生育策略。\"},{\"src\":\"And they would observe that females would keep their cubs for longer periods of times nowadays.\\\" University of Sherbrooke biologist Joanie Van de Walle.\",\"dst\":\"他们会观察到，现在雌性会长时间保持幼崽。”舍布鲁克大学生物学家乔安尼范德瓦勒。\"},{\"src\":\"\\\"Usually females give birth in January while in their den But some females, rather than weaning their cubs after one year and a half, continue to care for them for an extra year.\\\" So some brown bear mothers in this population began to spend more time, not less, caring for their cubs.\",\"dst\":\"“通常雌性在一月在巢穴中分娩，但有些雌性在一年半后没有断奶，而是继续多照顾一年。”因此，这个群体中的一些棕熊妈妈开始花更多的时间而不是更少的时间照顾它们的幼崽。\"},{\"src\":\"\\\"And we have seen that since 2005 the proportion of females that keep their cubs for two years and a half has increased dramatically.\",\"dst\":\"“而且我们已经看到，自2005年以来，雌性饲养幼崽两年半的比例急剧上升。\"},{\"src\":\"Nowadays, its about 36 percent of females that use that tactic , whereas in the beginning of this study so before 2005, it was about only 7 percent or so.\\\"\",\"dst\":\"如今，使用这种策略的女性约占36%，而在2005年之前的这项研究开始时，这一比例仅为7%左右。”\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8009,
    "timecreated": 1542695804,
    "timemodified": 1545206617,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Kenyan farmers are already know that if they hang live behind around their farms, they will prepare elephants. The problem is logistically, how do you manage hundreds of thousands of hives, if you have a huge area to protect? And then the idea came up to you to look at the alarm philosophy , which are chemicals that the bees release to launch an attack on something thats marauding the hive. Because elephants have a highly developed sense of smell, Wright and his team thought they might be able to use the bees chemical alarm signal to affect elephant behavior. So the researchers tested out a sympatric blend of chemicals that mimics honeybees alarm pheromones. In Greater Kruger National Park in South Africa, the team hung white socks treated with the synthetic mixture as well as untreated control socks around an elephant watering hole, and then observed the animals behavior.",
    "question_answer": [
      {
        "index": 10,
        "question_word": "behind",
        "real_word": "beehives"
      },
      {
        "index": 16,
        "question_word": "prepare",
        "real_word": "repel"
      },
      {
        "index": 52,
        "question_word": "philosophy",
        "real_word": "pheromones"
      },
      {
        "index": 106,
        "question_word": "sympatric",
        "real_word": "synthetic"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/4999850c108db8a0d98807000a2db925d184631f.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Kenyan farmers are already know that if they hang live beehives around their farms, they will repel elephants.\",\"dst\":\"肯尼亚农民已经知道，如果他们在农场周围挂上活的蜂箱，他们会击退大象。\"},{\"src\":\"The problem is logistically, how do you manage hundreds of thousands of hives, if you have a huge area to protect?\",\"dst\":\"问题是在后勤上，如果你有一个巨大的区域需要保护，你如何管理成千上万的蜂巢？\"},{\"src\":\"And then the idea came up to you to look at the alarm pheromones , which are chemicals that the bees release to launch an attack on something thats marauding the hive.\",\"dst\":\"然后你想到了观察报警信息素的想法，这些信息素是蜜蜂释放出来的化学物质，用来攻击正在掠夺蜂巢的东西。\"},{\"src\":\"Because elephants have a highly developed sense of smell, Wright and his team thought they might be able to use the bees chemical alarm signal to affect elephant behavior.\",\"dst\":\"因为大象有高度发达的嗅觉，赖特和他的团队认为他们也许能够利用蜜蜂的化学警报信号来影响大象的行为。\"},{\"src\":\"So the researchers tested out a synthetic blend of chemicals that mimics honeybees alarm pheromones.\",\"dst\":\"因此，研究人员测试了一种模拟蜜蜂报警信息素的化学合成混合物。\"},{\"src\":\"In Greater Kruger National Park in South Africa, the team hung white socks treated with the synthetic mixture as well as untreated control socks around an elephant watering hole, and then observed the animals behavior.\",\"dst\":\"在南非的大克鲁格国家公园，研究小组将经过合成混合物处理的白色袜子和未经处理的对照袜子挂在大象的饮水孔周围，然后观察大象的行为。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8008,
    "timecreated": 1542695804,
    "timemodified": 1545206527,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "But people have diverse lots of that water for agriculture. So now, Tanzania's Great Ruaha River stops flowing during the dry season, leaving behind a stream of stagnant poolsin which the hippos keep on pooping. \"Especially in these high density pools at the peak the dry season, there's a huge buildup of dung. So we ended up that pulling up these nets that have no fish but are just filled with hippo dung.\" University of California, Santa Barbara, ecologist Keenan Stears. Unable to wash downriver, the nutrients build up while dissolved oxygen in the water decreases. \"And changes in the chemistry can influence biochemistry within these pools as well. So specifically, fish as well as aquatic invitation .\" Only a few types of fish can survive in these oxygen-poor aquatic environments for more than a few weeks. It's bad news for biodiversity, but it's also deleterious for the dinner plate.",
    "question_answer": [
      {
        "index": 3,
        "question_word": "diverse",
        "real_word": "diverted"
      },
      {
        "index": 25,
        "question_word": "stream",
        "real_word": "serious"
      },
      {
        "index": 103,
        "question_word": "biochemistry",
        "real_word": "biodiversity"
      },
      {
        "index": 116,
        "question_word": "invitation",
        "real_word": "invertebrates"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/2a29c1cae94b73eb8609ccdcdb744072572fc7db.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"But people have diverted lots of that water for agriculture.\",\"dst\":\"但是人们已经把大量的水用于农业。\"},{\"src\":\"So now, Tanzania's Great Ruaha River stops flowing during the dry season, leaving behind a serious of stagnant poolsin which the hippos keep on pooping.\",\"dst\":\"所以现在，坦桑尼亚的大鲁阿哈河在旱季停止了流动，留下了一个严重的死水潭，河马不停地拉屎。\"},{\"src\":\"\\\"Especially in these high density pools at the peak the dry season, there's a huge buildup of dung.\",\"dst\":\"“尤其是在旱季高峰期的这些高密度水池里，有大量的粪便堆积。\"},{\"src\":\"So we ended up that pulling up these nets that have no fish but are just filled with hippo dung.\\\" University of California, Santa Barbara, ecologist Keenan Stears.\",\"dst\":\"所以我们结束了那些没有鱼但只是被河马粪填满的网。“圣巴巴拉，加利福尼亚大学，生态学家Keenan Stears。\"},{\"src\":\"Unable to wash downriver, the nutrients build up while dissolved oxygen in the water decreases.\",\"dst\":\"由于无法冲洗下游，营养物质积累，而水中溶解氧减少。\"},{\"src\":\"\\\"And changes in the chemistry can influence biodiversity within these pools as well.\",\"dst\":\"化学物质的变化也会影响这些池塘的生物多样性。\"},{\"src\":\"So specifically, fish as well as aquatic invertebrates .\\\" Only a few types of fish can survive in these oxygen-poor aquatic environments for more than a few weeks.\",\"dst\":\"特别是鱼类和水生无脊椎动物。“只有少数种类的鱼能在缺氧的水生环境中存活数周以上。\"},{\"src\":\"It's bad news for biodiversity, but it's also deleterious for the dinner plate.\",\"dst\":\"这对生物多样性是个坏消息，但对餐盘也是有害的。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8007,
    "timecreated": 1542695803,
    "timemodified": 1630575232,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "That is, somewhat accurately. And thats the point of causes  Google doesnt want Duplex to sound like a machine. In the hair salon example, the woman who answers the phone throws Duplex a curveball: <At 12 P.M. We do not have a 12 P.M. available, the closest we have to that is 1:15.>. There is a point in the explain where Duplex shows its true colors, though. Listen carefully and youll hear a convict difference between the AIs pronunciation of 10 A.M. and 12 P.M. <Do you have anything between 10 A.M. and 12 P.M.>. For just an instant, Duplexs catched tones remind you of being on hold with your bank. <Your wait time is10 minutes>. A second Duplex clip is a bit more expensive, because the person answering the phone doesnt seem to be fully paying attention. Duplex tells the woman three times that he wants to come by on Wednesday.",
    "question_answer": [
      {
        "index": 3,
        "question_word": "accurately",
        "real_word": "awkwardly"
      },
      {
        "index": 9,
        "question_word": "causes",
        "real_word": "course"
      },
      {
        "index": 60,
        "question_word": "explain",
        "real_word": "exchange"
      },
      {
        "index": 74,
        "question_word": "convict",
        "real_word": "distinct"
      },
      {
        "index": 101,
        "question_word": "catched",
        "real_word": "mismatched"
      },
      {
        "index": 125,
        "question_word": "expensive",
        "real_word": "impressive"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/2565fc38f46190a0c9197d778379df4584437c6f.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"That is, somewhat awkwardly.\",\"dst\":\"这有点尴尬。\"},{\"src\":\"And thats the point of course  Google doesnt want Duplex to sound like a machine.\",\"dst\":\"这就是为什么谷歌不希望双工听起来像一台机器。\"},{\"src\":\"In the hair salon example, the woman who answers the phone throws Duplex a curveball: <audio>.\",\"dst\":\"在发廊的例子中，接电话的女人抛出一个曲线球：<audio>。\"},{\"src\":\"There is a point in the exchange where Duplex shows its true colors, though.\",\"dst\":\"不过，在这种交换中，Duplex显示出了它的本色。\"},{\"src\":\"Listen carefully and youll hear a distinct difference between the AIs pronunciation of 10 A.M.and 12 P.M.<audio>.\",\"dst\":\"仔细听，你会听到上午10点和下午12点的AIs发音有明显区别。\"},{\"src\":\"For just an instant, Duplexs mismatched tones remind you of being on hold with your bank.\",\"dst\":\"就在一瞬间，双工不匹配的音调提醒你与银行保持联系。\"},{\"src\":\"<Your wait time is10 minutes>.\",\"dst\":\"<您的等待时间是10分钟>。\"},{\"src\":\"A second Duplex clip is a bit more impressive, because the person answering the phone doesnt seem to be fully paying attention.\",\"dst\":\"第二个双工剪辑更令人印象深刻，因为接电话的人似乎没有完全集中注意力。\"},{\"src\":\"Duplex tells the woman three times that he wants to come by on Wednesday.\",\"dst\":\"他三次告诉那个女人他想星期三过来。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8006,
    "timecreated": 1542695803,
    "timemodified": 1545206270,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "And then all of those will help reduce the technological changes that are necessary to make a transformation to a low-carbon world. Nordhaus shared the prize with Paul Romer of New York University, for his work  interrelating technological innovations into long-run macroeconomic analysis.\" Nordhaus continued: The most recent work Ive done is studying actual trends in abandon and in policies, suggests were doing much less than needs to be to reach any of the targets, whether its a 1.5-degree or 2-degree or even a 3-degree target. I think the policies are jogging very very far, miles, miles, miles behind the conscious and what needs to be donebut its not too late. But the steps we have to take are more difficult now than if wed started earlier.",
    "question_answer": [
      {
        "index": 7,
        "question_word": "reduce",
        "real_word": "induce"
      },
      {
        "index": 17,
        "question_word": "transformation",
        "real_word": "transition"
      },
      {
        "index": 37,
        "question_word": "interrelating",
        "real_word": "integrating"
      },
      {
        "index": 57,
        "question_word": "abandon",
        "real_word": "abatement"
      },
      {
        "index": 92,
        "question_word": "jogging",
        "real_word": "lagging"
      },
      {
        "index": 101,
        "question_word": "conscious",
        "real_word": "science"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/7e9bb98dd5c588b1edfac65d105546c1d9aab388.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"And then all of those will help induce the technological changes that are necessary to make a transition to a low-carbon world.\",\"dst\":\"所有这些都将有助于推动向低碳世界过渡所需的技术变革。\"},{\"src\":\"Nordhaus shared the prize with Paul Romer of New York University, for his work  integrating technological innovations into long-run macroeconomic analysis.\\\" Nordhaus continued: The most recent work Ive done is studying actual trends in abatement and in policies, suggests were doing much less than needs to be to reach any of the targets, whether its a 1.5-degree or 2-degree or even a 3-degree target.\",\"dst\":\"诺德豪斯与纽约大学的Paul Romer分享了这一奖项，因为他将技术创新与长期宏观经济分析相结合。“诺德豪斯继续说：我所做的最新工作是研究减排的实际趋势和政策，表明我们所做的工作远远少于实现任何目标的需要。无论是1.5度还是2度甚至是3度的目标。\"},{\"src\":\"I think the policies are lagging very very far, miles, miles, miles behind the science and what needs to be donebut its not too late.\",\"dst\":\"我认为这些政策远远落后，远远落后于科学和需要做的事情，但为时不晚。\"},{\"src\":\"But the steps we have to take are more difficult now than if wed started earlier.\",\"dst\":\"但是我们现在要采取的步骤比我们早一点开始要困难得多。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8005,
    "timecreated": 1542695803,
    "timemodified": 1545206164,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "\"Here's a 2014 song that has a low happiness index:\" Stay with Me,\" by Sam Smith. Overall, they found that songs had become less happy over the 30-year span; as well as more reliable, more relaxedand more likely to have women behind the mic. But the big hits bucked a number of those trends. \"So the behavior of successful songs looked almost like a contemporary species of songs. They have quantifiably different feathers, their own little trends.\" The hit singles were happier than the normalmost a throwback to linear times. And even more likely to be sung by women. The details are in the journal Royal Society Open Science. Komarova's team was also able to predict a song's success, by judging only its musical quantities, about 75 percent of the time.",
    "question_answer": [
      {
        "index": 33,
        "question_word": "reliable",
        "real_word": "danceable"
      },
      {
        "index": 64,
        "question_word": "contemporary",
        "real_word": "separate"
      },
      {
        "index": 72,
        "question_word": "feathers",
        "real_word": "features"
      },
      {
        "index": 88,
        "question_word": "linear",
        "real_word": "earlier"
      },
      {
        "index": 124,
        "question_word": "quantities",
        "real_word": "qualities"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/63e197aaefacebf182f014b98dac37226dd357dd.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"\\\"Here's a 2014 song that has a low happiness index:\\\" Stay with Me,\\\" by Sam Smith.\",\"dst\":\"这里有一首2014年的歌曲，它的幸福指数很低：山姆·史密斯的《和我在一起》。\"},{\"src\":\"Overall, they found that songs had become less happy over the 30-year span; as well as more danceable, more relaxedand more likely to have women behind the mic.\",\"dst\":\"总的来说，他们发现歌曲在30年的时间里变得不那么快乐；而且更容易跳舞，更放松，更有可能有女人在麦克风后面。\"},{\"src\":\"But the big hits bucked a number of those trends.\",\"dst\":\"但这些大热门却与其中一些趋势背道而驰。\"},{\"src\":\"\\\"So the behavior of successful songs looked almost like a separate species of songs.\",\"dst\":\"因此，成功歌曲的行为看起来几乎像是一个独立的歌曲种类。\"},{\"src\":\"They have quantifiably different features, their own little trends.\\\" The hit singles were happier than the normalmost a throwback to earlier times.\",\"dst\":\"他们有着可量化的不同特征，有着自己的小趋势。\"},{\"src\":\"And even more likely to be sung by women.\",\"dst\":\"更可能是女人唱的。\"},{\"src\":\"The details are in the journal Royal Society Open Science.\",\"dst\":\"详细内容刊登在《皇家学会开放科学》杂志上。\"},{\"src\":\"Komarova's team was also able to predict a song's success, by judging only its musical qualities, about 75 percent of the time.\",\"dst\":\"科马罗娃的团队还能够预测一首歌的成功，仅通过判断它的音乐品质，大约75%的时间。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8004,
    "timecreated": 1542695803,
    "timemodified": 1542695803,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Baleen whales are the gentle clients of the sea. Despite their colossal size, they feed on tiny creatures such as krill and zooplankton. Thats because these whales, instead of teeth, have bristle-like structures in their mouthbelievewhich filters out small cripplers from big gulps of water. But the ancestors of baleen whales had a very different diet. So, the oldest whales that we knowthese are the confessors not just of the great whales like the blue whale and the holdback whale, but also of all of the dolphins in the sea todaythey had fairly big teeth. Felix Marx, a postdoctoral research fellow at the Royal Belgian Institute of Natural Sciences.",
    "question_answer": [
      {
        "index": 5,
        "question_word": "clients",
        "real_word": "giants"
      },
      {
        "index": 35,
        "question_word": "believe",
        "real_word": "baleen"
      },
      {
        "index": 39,
        "question_word": "cripplers",
        "real_word": "critters"
      },
      {
        "index": 65,
        "question_word": "confessors",
        "real_word": "ancestors"
      },
      {
        "index": 78,
        "question_word": "holdback",
        "real_word": "humpback"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/ce1b9095091b99df6417c77f9540702dad3607eb.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Baleen whales are the gentle giants of the sea.\",\"dst\":\"须鲸是海洋中温和的巨人。\"},{\"src\":\"Despite their colossal size, they feed on tiny creatures such as krill and zooplankton.\",\"dst\":\"尽管体型庞大，它们还是以磷虾和浮游动物等微小生物为食。\"},{\"src\":\"Thats because these whales, instead of teeth, have bristle-like structures in their baleen filters out small critters from big gulps of water.\",\"dst\":\"这是因为这些鲸鱼，而不是牙齿，在他们的须鲸有刚毛状的结构过滤掉小动物从大口的水。\"},{\"src\":\"But the ancestors of baleen whales had a very different diet.\",\"dst\":\"但是须鲸的祖先有着完全不同的饮食习惯。\"},{\"src\":\"So, the oldest whales that we knowthese are the ancestors not just of the great whales like the blue whale and the humpback whale, but also of all of the dolphins in the sea todaythey had fairly big teeth.\",\"dst\":\"所以，我们所知道的最古老的鲸鱼，它们不仅是蓝鲸和座头鲸等大型鲸鱼的祖先，而且是今天海洋中所有海豚的祖先，它们有相当大的牙齿。\"},{\"src\":\"Felix Marx, a postdoctoral research fellow at the Royal Belgian Institute of Natural Sciences.\",\"dst\":\"费利克斯·马克思，比利时皇家自然科学研究所博士后研究员。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8003,
    "timecreated": 1542695803,
    "timemodified": 1542695803,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Interested in studying exhausted life formsmaybe even identifying new species? Well, forget about buying a plane ticket. Just take a look in your benchmen, bathroom, or bookstore. Because researchers in North Carolina aim to document the critters that live among us in the Great INDOORS. Ten years ago, biologists led by Rob Dunn at North Carolina State began to explore the biodiversity of inside in 50 homes in the Raleigh area. Though they expected to uncover a couple dozen bugs, they turned up more than a thousand distinct specials. And when they expanded their studies to other cities, they found lots moresome entirely new to science. Now theyre enlisting an intrepid brigade of citizen scientists to carry the work further.",
    "question_answer": [
      {
        "index": 3,
        "question_word": "exhausted",
        "real_word": "exotic"
      },
      {
        "index": 23,
        "question_word": "benchmen",
        "real_word": "basement"
      },
      {
        "index": 26,
        "question_word": "bookstore",
        "real_word": "boudoir"
      },
      {
        "index": 63,
        "question_word": "inside",
        "real_word": "insects"
      },
      {
        "index": 88,
        "question_word": "specials",
        "real_word": "species"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/2006ef18d12e85efe1fde986263b12b0af17361d.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Interested in studying exotic life formsmaybe even identifying new species?\",\"dst\":\"对研究外来的生命形式感兴趣甚至可以识别新物种？\"},{\"src\":\"Well, forget about buying a plane ticket.\",\"dst\":\"好吧，忘了买飞机票吧。\"},{\"src\":\"Just take a look in your basement, bathroom, or boudoir.\",\"dst\":\"只要看看你的地下室，浴室，或闺房。\"},{\"src\":\"Because researchers in North Carolina aim to document the critters that live among us in the Great INDOORS.\",\"dst\":\"因为北卡罗莱纳州的研究人员旨在记录生活在大室内的动物。\"},{\"src\":\"Ten years ago, biologists led by Rob Dunn at North Carolina State began to explore the biodiversity of insects in 50 homes in the Raleigh area.\",\"dst\":\"十年前，北卡罗莱纳州的生物学家罗布·邓恩（Rob Dunn）开始探索罗利地区50个家庭中昆虫的生物多样性。\"},{\"src\":\"Though they expected to uncover a couple dozen bugs, they turned up more than a thousand distinct species.\",\"dst\":\"虽然他们希望能发现几十种昆虫，但他们发现了一千多种不同的物种。\"},{\"src\":\"And when they expanded their studies to other cities, they found lots moresome entirely new to science.\",\"dst\":\"当他们把研究范围扩大到其他城市时，他们发现了更多对科学完全陌生的东西。\"},{\"src\":\"Now theyre enlisting an intrepid brigade of citizen scientists to carry the work further.\",\"dst\":\"现在，他们正在征召一支勇敢的公民科学家队伍来进一步开展这项工作。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 8002,
    "timecreated": 1542695803,
    "timemodified": 1545205139,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Many parents are no doubt consider with their teenagers' musical tastes. But very few are probably expired enough by them to launch an experiment. \"I listened to some of the music that my oldest teenage daughter is listening to. And I was surprised at how different that music was from what I used to listen to.\" Natalia Komarova, an compiled mathematician at U.C. Irvine. \"Since I'm interested in resolution in general, and a mathematical description of evolution, I thought that studying the evolution of music would be a good idea.\" Komarova and her team analyzed half a trillion songs released in the U.K. between 1985 and 2015.",
    "question_answer": [
      {
        "index": 5,
        "question_word": "consider",
        "real_word": "familiar"
      },
      {
        "index": 16,
        "question_word": "expired",
        "real_word": "inspired"
      },
      {
        "index": 59,
        "question_word": "compiled",
        "real_word": "applied"
      },
      {
        "index": 68,
        "question_word": "resolution",
        "real_word": "evolution"
      },
      {
        "index": 97,
        "question_word": "trillion",
        "real_word": "million"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/7bdd39cf321dd8e5f1beaa10052b58ea1ee964c3.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Many parents are no doubt familiar with their teenagers' musical tastes.\",\"dst\":\"毫无疑问，许多父母熟悉他们青少年的音乐品味。\"},{\"src\":\"But very few are probably inspired enough by them to launch an experiment.\",\"dst\":\"但很少有人能从他们身上得到足够的灵感来进行实验。\"},{\"src\":\"\\\"I listened to some of the music that my oldest teenage daughter is listening to.\",\"dst\":\"“我听了一些我十几岁的大女儿正在听的音乐。\"},{\"src\":\"And I was surprised at how different that music was from what I used to listen to.\\\" Natalia Komarova, an applied mathematician at U.C.Irvine.\",\"dst\":\"我很惊讶这种音乐和我以前听的音乐有多么不同。\"},{\"src\":\"\\\"Since I'm interested in evolution in general, and a mathematical description of evolution, I thought that studying the evolution of music would be a good idea.\\\" Komarova and her team analyzed half a million songs released in the U.K.between 1985 and 2015.\",\"dst\":\"“因为我一般对进化感兴趣，并且对进化的数学描述，我认为研究音乐的进化是一个好主意。”Komarova和她的团队分析了1985至2015年间在英国发布的一百万首歌曲。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 6781,
    "timecreated": 1538289124,
    "timemodified": 1538289124,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Johnny Appleseed was a small man with lots of energy. He had long dark hair. His eyes are black and bright. He never married. He lived very simple. For years,  he traveled alone in the wasteland, without a gun or knife. He slept in the open air and did not wear shoes on his feet. Some people gave him clothing as payment for his apple trees. But sometimes he wears a large cloth bag or sack as clothing. The sack had holes for his head and arms. On his head, he wore a metal canister for a hat. He also used this pot for cooking his food. People said he lived this way because he wanted to. He had enough money for house and clothes if he had wanted to buy these things. But he used his money to improve his apple business and help other people. He was famous for his gentleness and courage. Both settlers and Native Americans liked him. Everywhere he traveled, he was welcomed. Reports from that period introduce that some Native Americans believed he was \"touched by God.\"",
    "question_answer": [
      {
        "index": 17,
        "question_word": "are",
        "real_word": "were"
      },
      {
        "index": 27,
        "question_word": "simple",
        "real_word": "simply"
      },
      {
        "index": 36,
        "question_word": "wasteland",
        "real_word": "wilderness"
      },
      {
        "index": 70,
        "question_word": "wears",
        "real_word": "wore"
      },
      {
        "index": 95,
        "question_word": "canister",
        "real_word": "shelter"
      },
      {
        "index": 123,
        "question_word": "house",
        "real_word": "bravery"
      },
      {
        "index": 155,
        "question_word": "courage",
        "real_word": "suggest"
      },
      {
        "index": 173,
        "question_word": "introduce",
        "real_word": ""
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/2d475db86eef7d7b1b2d339bc69408e91dadbb2a.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Johnny Appleseed was a small man with lots of energy.\",\"dst\":\"约翰尼·阿普尔赛德是个身材矮小，精力充沛的人。\"},{\"src\":\"He had long dark hair.\",\"dst\":\"他有一头乌黑的长发。\"},{\"src\":\"His eyes were black and bright.\",\"dst\":\"他的眼睛又黑又亮。\"},{\"src\":\"He never married.\",\"dst\":\"他从未结婚。\"},{\"src\":\"He lived very simply.\",\"dst\":\"他生活得很简朴。\"},{\"src\":\"For years,  he traveled alone in the wilderness, without a gun or knife.\",\"dst\":\"多年来，他独自一人在荒野中旅行，没有枪和刀。\"},{\"src\":\"He slept in the open air and did not wear shoes on his feet.\",\"dst\":\"他在户外睡觉，脚上不穿鞋。\"},{\"src\":\"Some people gave him clothing as payment for his apple trees.\",\"dst\":\"有些人给他衣服作为买苹果树的报酬。\"},{\"src\":\"But sometimes he wore a large cloth bag or sack as clothing.\",\"dst\":\"但有时他穿一个大布袋或麻袋作为衣服。\"},{\"src\":\"The sack had holes for his head and arms.\",\"dst\":\"麻袋上的头和胳膊都有洞。\"},{\"src\":\"On his head, he wore a metal shelter for a hat.\",\"dst\":\"他头上戴着一顶金属帽子。\"},{\"src\":\"He also used this pot for cooking his food.\",\"dst\":\"他也用这个锅做饭。\"},{\"src\":\"People said he lived this way because he wanted to.\",\"dst\":\"人们说他这样生活是因为他想这样。\"},{\"src\":\"He had enough money for bravery and clothes if he had wanted to buy these things.\",\"dst\":\"如果他想买这些东西的话，他就有足够的钱买勇气和衣服。\"},{\"src\":\"But he used his money to improve his apple business and help other people.\",\"dst\":\"但他用自己的钱来改善自己的苹果业务，帮助别人。\"},{\"src\":\"He was famous for his gentleness and suggest.\",\"dst\":\"他以温柔和体贴著称。\"},{\"src\":\"Both settlers and Native Americans liked him.\",\"dst\":\"定居者和印第安人都喜欢他。\"},{\"src\":\"Everywhere he traveled, he was welcomed.\",\"dst\":\"他所到之处都受到欢迎。\"},{\"src\":\"Reports from that period  that some Native Americans believed he was \\\"touched by God.\\\"\",\"dst\":\"那个时期的报道说，一些美洲土著人相信他“被上帝感动了”\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 6780,
    "timecreated": 1538289123,
    "timemodified": 1538289123,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "What is the best way to watch someone who is telling a lie? For a long time, the traditional method of notifying liars was to watch their body language, including body expressions. What if the person shows to be nervous? Is the person unable to look me in the eye? Is he or she looking around the room? What about other nervous motions? Many peoplefrom parents to police officers and airport security person  depend on this method. But does a person's body and face reveal the truth? Actually, using body language and facial expressions to catch someone in a lie is really hard. And it only works, obviously, by chance.",
    "question_answer": [
      {
        "index": 6,
        "question_word": "watch",
        "real_word": "catch"
      },
      {
        "index": 21,
        "question_word": "notifying",
        "real_word": "identifying"
      },
      {
        "index": 30,
        "question_word": "body",
        "real_word": "facial"
      },
      {
        "index": 36,
        "question_word": "shows",
        "real_word": "appears"
      },
      {
        "index": 62,
        "question_word": "motions",
        "real_word": "movements"
      },
      {
        "index": 72,
        "question_word": "person",
        "real_word": "personnel"
      },
      {
        "index": 108,
        "question_word": "obviously",
        "real_word": "seemingly"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/eded989f0128dc50bca3df58052b8f2200bc37ef.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"What is the best way to catch someone who is telling a lie?\",\"dst\":\"抓住说谎的人最好的方法是什么？\"},{\"src\":\"For a long time, the traditional method of identifying liars was to watch their body language, including facial expressions.\",\"dst\":\"长期以来，识别说谎者的传统方法是观察他们的肢体语言，包括面部表情。\"},{\"src\":\"What if the person appears to be nervous?\",\"dst\":\"如果这个人看起来很紧张怎么办？\"},{\"src\":\"Is the person unable to look me in the eye?\",\"dst\":\"那个人不能直视我的眼睛吗？\"},{\"src\":\"Is he or she looking around the room?\",\"dst\":\"他或她在房间里四处张望吗？\"},{\"src\":\"What about other nervous movements?\",\"dst\":\"其他的神经活动呢？\"},{\"src\":\"Many peoplefrom parents to police officers and airport security personnel  depend on this method.\",\"dst\":\"许多人从父母到警察和机场保安人员都依赖这种方法。\"},{\"src\":\"But does a person's body and face reveal the truth?\",\"dst\":\"但一个人的身体和面部是否揭示了真相？\"},{\"src\":\"Actually, using body language and facial expressions to catch someone in a lie is really hard.\",\"dst\":\"事实上，用肢体语言和面部表情来抓住说谎的人真的很难。\"},{\"src\":\"And it only works, seemingly, by chance.\",\"dst\":\"而且它只起作用，似乎是偶然的。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 6779,
    "timecreated": 1538289123,
    "timemodified": 1538289123,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Until recently, blind and vision impaired students in Kenya were still using Braille books for their studies. But Kenyan schools for the blind are now beginning to adapt technology that prevents material in an audible formand in the process extends their opportunities.  Lucas Mwanzia, 17, intensively searches the internet for information. Today's class is on biology. Mwanzia is visually impaired and for the last two years has been going computer classes at the Thika School for the Blind. Mwanzia is in eighth grade, having started school at a later age because of his vision. He says the technology has opened up new founders that were once inaccessible.",
    "question_answer": [
      {
        "index": 4,
        "question_word": "vision",
        "real_word": "visually"
      },
      {
        "index": 27,
        "question_word": "adapt",
        "real_word": "adopt"
      },
      {
        "index": 30,
        "question_word": "prevents",
        "real_word": "provides"
      },
      {
        "index": 39,
        "question_word": "extends",
        "real_word": "expands"
      },
      {
        "index": 46,
        "question_word": "intensively",
        "real_word": "intently"
      },
      {
        "index": 69,
        "question_word": "going",
        "real_word": "attending"
      },
      {
        "index": 103,
        "question_word": "founders",
        "real_word": "frontiers"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/a1397c947c7770c4af2d29f9ef6ab27a48135caf.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Until recently, blind and visually impaired students in Kenya were still using Braille books for their studies.\",\"dst\":\"直到最近，肯尼亚的盲人和视障学生仍在使用盲文书籍进行学习。\"},{\"src\":\"But Kenyan schools for the blind are now beginning to adopt technology that provides material in an audible formand in the process expands their opportunities.\",\"dst\":\"但是肯尼亚的盲人学校现在开始采用以听觉形式提供材料的技术，并在这个过程中扩大了他们的机会。\"},{\"src\":\"Lucas Mwanzia, 17, intently searches the internet for information.\",\"dst\":\"17岁的卢卡斯·姆万齐亚（Lucas Mwanzia）专注地在互联网上搜索信息。\"},{\"src\":\"Today's class is on biology.\",\"dst\":\"今天的课是生物课。\"},{\"src\":\"Mwanzia is visually impaired and for the last two years has been attending computer classes at the Thika School for the Blind.\",\"dst\":\"姆万齐亚有视力障碍，过去两年一直在蒂卡盲人学校上电脑课。\"},{\"src\":\"Mwanzia is in eighth grade, having started school at a later age because of his vision.\",\"dst\":\"姆万齐亚正在上八年级，因为他的视力，他在晚些时候就开始上学了。\"},{\"src\":\"He says the technology has opened up new frontiers that were once inaccessible.\",\"dst\":\"他说，这项技术开辟了以前无法进入的新领域。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 6778,
    "timecreated": 1538289123,
    "timemodified": 1538289123,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Bitcoins have become the currency of choice for people online buying drugs or other legal activities. For example, bitcoins are being used by ISIS terrorists to find operations, according to Ghost Security Group. It is a counter terrorists network that focuses on the Internet and social media.  Morgan Wright is a cyber security expert and senior follow at the Center for Digital Government, a national researcher and advisory institute on information technology policies.  Terrorists need anonymity,\" Wright told Fox News. \"Countries have gotten very good at detecting terror financing in the years since 9.11. Networks have looked for new ways to do it, and it appears they've found it in bitcoin.\"  Despite this dark side of the new currency, bitcoins have their supporters. More and more merchants are beginning to accept bitcoins.",
    "question_answer": [
      {
        "index": 14,
        "question_word": "legal",
        "real_word": "illegal"
      },
      {
        "index": 26,
        "question_word": "find",
        "real_word": "fund"
      },
      {
        "index": 37,
        "question_word": "terrorists",
        "real_word": "terrorism"
      },
      {
        "index": 57,
        "question_word": "follow",
        "real_word": "fellow"
      },
      {
        "index": 66,
        "question_word": "researcher",
        "real_word": "research"
      },
      {
        "index": 88,
        "question_word": "detecting",
        "real_word": "tracking"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/f6c99613c841aa91bf8de4e6df8237ec86ea235a.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Bitcoins have become the currency of choice for people online buying drugs or other illegal activities.\",\"dst\":\"比特币已经成为人们在网上购买毒品或其他非法活动的首选货币。\"},{\"src\":\"For example, bitcoins are being used by ISIS terrorists to fund operations, according to Ghost Security Group.\",\"dst\":\"例如，根据幽灵安全组织的说法，比特币正被伊斯兰国恐怖分子用来资助行动。\"},{\"src\":\"It is a counter terrorism network that focuses on the Internet and social media.\",\"dst\":\"这是一个以互联网和社交媒体为重点的反恐网络。\"},{\"src\":\"Morgan Wright is a cyber security expert and senior fellow at the Center for Digital Government, a national research and advisory institute on information technology policies.\",\"dst\":\"Morgan Wright是网络安全专家，也是国家信息技术政策研究和咨询机构数字政府中心的高级研究员。\"},{\"src\":\"Terrorists need anonymity,\\\" Wright told Fox News.\",\"dst\":\"恐怖分子需要匿名，”赖特告诉福克斯新闻。\"},{\"src\":\"\\\"Countries have gotten very good at tracking terror financing in the years since 9.11.\",\"dst\":\"“自9.11事件以来，各国在追踪恐怖融资方面做得非常好。\"},{\"src\":\"Networks have looked for new ways to do it, and it appears they've found it in bitcoin.\\\"  Despite this dark side of the new currency, bitcoins have their supporters.\",\"dst\":\"网络已经在寻找新的方法来实现这一点，而且似乎他们已经在比特币中找到了它。\"},{\"src\":\"More and more merchants are beginning to accept bitcoins.\",\"dst\":\"越来越多的商家开始接受比特币。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 6777,
    "timecreated": 1538289123,
    "timemodified": 1538289123,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Bitcoin does not use printed money. It is digitized only. The currency is created on computers by a community of people crossing the globe. Anyone can join that network, or group, according to Coindesk.com.  This network professes transactions made with the digital currency. Bitcoins are stored in a \"digital wallet\" over the Internet or on the user's computer.  There is not an unlimited accounts of bitcoins. Nakamoto set up rules to limit the currency to 21 million bitcoins.  With bitcoins, there are no banks or fees. Users do not register with their real names. Merchandise can be brought without the user showing her or his identity. Bitcoins are not taxed or regulated anywhere in the world.",
    "question_answer": [
      {
        "index": 8,
        "question_word": "digitized",
        "real_word": "digital"
      },
      {
        "index": 21,
        "question_word": "crossing",
        "real_word": "across"
      },
      {
        "index": 37,
        "question_word": "professes",
        "real_word": "processes"
      },
      {
        "index": 65,
        "question_word": "accounts",
        "real_word": "amount"
      },
      {
        "index": 100,
        "question_word": "brought",
        "real_word": "bought"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/6672241b2a3b87de2b533e20404dfbef3e6e60d2.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Bitcoin does not use printed money.\",\"dst\":\"比特币不使用印刷货币。\"},{\"src\":\"It is digital only.\",\"dst\":\"它只是数字的。\"},{\"src\":\"The currency is created on computers by a community of people across the globe.\",\"dst\":\"这种货币是由世界各地的人在电脑上创造的。\"},{\"src\":\"Anyone can join that network, or group, according to Coindesk.com.\",\"dst\":\"根据cointesk.com，任何人都可以加入这个网络或团体。\"},{\"src\":\"This network processes transactions made with the digital currency.\",\"dst\":\"这个网络处理用数字货币进行的交易。\"},{\"src\":\"Bitcoins are stored in a \\\"digital wallet\\\" over the Internet or on the user's computer.\",\"dst\":\"比特币通过互联网或用户电脑存储在“数字钱包”中。\"},{\"src\":\"There is not an unlimited amount of bitcoins.\",\"dst\":\"比特币的数量不是无限的。\"},{\"src\":\"Nakamoto set up rules to limit the currency to 21 million bitcoins.\",\"dst\":\"中本建立规则，将货币限制在2100万比特币。\"},{\"src\":\"With bitcoins, there are no banks or fees.\",\"dst\":\"有了比特币，就没有银行或收费了。\"},{\"src\":\"Users do not register with their real names.\",\"dst\":\"用户不实名注册。\"},{\"src\":\"Merchandise can be bought without the user showing her or his identity.\",\"dst\":\"用户可以在不显示其身份的情况下购买商品。\"},{\"src\":\"Bitcoins are not taxed or regulated anywhere in the world.\",\"dst\":\"比特币在世界任何地方都不征税，也不受监管。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 6776,
    "timecreated": 1538289123,
    "timemodified": 1626502507,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Low costs and its location in Asia helped to produce the education explosion in the Philippines. The capital, Manila, has cheap non-stop fly to Tokyo, Seoul, and other Asian cities. The increasing U.S. dollar has made American education more expensive than ever before.  There are hundreds of private and public schools in the Philippines that teach English or speak in English. More advanced students can take particular university academic courses in English. Others study at bayside resorts, where they mix language study with vacation. Some Korean families even move to the Philippines so their children can learn English in private schools.",
    "question_answer": [
      {
        "index": 1,
        "question_word": "costs",
        "real_word": "prices"
      },
      {
        "index": 22,
        "question_word": "fly",
        "real_word": "flights"
      },
      {
        "index": 29,
        "question_word": "cities",
        "real_word": "capitals."
      },
      {
        "index": 31,
        "question_word": "increasing",
        "real_word": "rising"
      },
      {
        "index": 59,
        "question_word": "speak",
        "real_word": "teach"
      },
      {
        "index": 67,
        "question_word": "particular",
        "real_word": "regular"
      },
      {
        "index": 76,
        "question_word": "bayside",
        "real_word": "beachside"
      },
      {
        "index": 100,
        "question_word": "private",
        "real_word": "public"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/909e1c26dc91d49456e5937262fe6c11088f78c1.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Low prices and its location in Asia helped to produce the education explosion in the Philippines.\",\"dst\":\"低廉的价格和它在亚洲的地理位置促成了菲律宾教育的爆炸式增长。\"},{\"src\":\"The capital, Manila, has cheap non-stop flights to Tokyo, Seoul, and other Asian capitals..The rising U.S.dollar has made American education more expensive than ever before.\",\"dst\":\"首都马尼拉有飞往东京、首尔和其他亚洲国家首都的廉价直飞航班。美元的不断升值使得美国的教育比以往任何时候都要昂贵。\"},{\"src\":\"There are hundreds of private and public schools in the Philippines that teach English or teach in English.\",\"dst\":\"菲律宾有数百所私立和公立学校教英语或用英语授课。\"},{\"src\":\"More advanced students can take regular university academic courses in English.\",\"dst\":\"更高级的学生可以定期上大学英语课程。\"},{\"src\":\"Others study at beachside resorts, where they mix language study with vacation.\",\"dst\":\"其他人在海滨度假胜地学习，在那里他们把语言学习和度假结合起来。\"},{\"src\":\"Some Korean families even move to the Philippines so their children can learn English in public schools.\",\"dst\":\"一些韩国家庭甚至搬到菲律宾，这样他们的孩子就可以在公立学校学习英语。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 6775,
    "timecreated": 1538289123,
    "timemodified": 1538289123,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "The Philippines is in a distinctive position to benefit from the global demand for English environment. American colonialism brought the English language here in the early twentieth century. Although it is not the native language of most Filipinos, English is an official language here. More than 60 years after colonialism, Filipinos still speak English with a strong American accent. Nowadays, the Philippines markets itself as the world's third-largest English-speaking country.",
    "question_answer": [
      {
        "index": 5,
        "question_word": "distinctive",
        "real_word": "unique"
      },
      {
        "index": 15,
        "question_word": "environment",
        "real_word": "education"
      },
      {
        "index": 49,
        "question_word": "colonialism",
        "real_word": "independence"
      },
      {
        "index": 59,
        "question_word": "Nowadays",
        "real_word": "Today"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/2266c41922466a9589ddbf99acfc4809d9e7c262.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"The Philippines is in a unique position to benefit from the global demand for English education.\",\"dst\":\"菲律宾处于一个独特的地位，可以从全球对英语教育的需求中获益。\"},{\"src\":\"American colonialism brought the English language here in the early twentieth century.\",\"dst\":\"二十世纪初，美国殖民主义把英语带到了这里。\"},{\"src\":\"Although it is not the native language of most Filipinos, English is an official language here.\",\"dst\":\"虽然英语不是大多数菲律宾人的母语，但它是这里的官方语言。\"},{\"src\":\"More than 60 years after independence, Filipinos still speak English with a strong American accent.\",\"dst\":\"独立60多年后，菲律宾人讲的英语仍然带有浓重的美国口音。\"},{\"src\":\"Today, the Philippines markets itself as the world's third-largest English-speaking country.\",\"dst\":\"如今，菲律宾将自己定位为世界第三大英语国家。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 6774,
    "timecreated": 1538289123,
    "timemodified": 1538289123,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "What really drew the public attention was some other details beyond the incident. According to the newspaper, Anderson was on a mission of love that fateful Christmas Eve in the process of distributing care packages to needy families in the area. That was a monthly tradition that he performed unbeknown to everyone. This he did because of his firm conviction that the best Christmas gifts came not from the gift received, but from those given, and that those acts of charity should remain unknown. As it turns out, Sandra Jenkins was also involved in same volunteer work throughout the community.",
    "question_answer": [
      {
        "index": 12,
        "question_word": "incident",
        "real_word": "accident."
      },
      {
        "index": 44,
        "question_word": "monthly",
        "real_word": "yearly"
      },
      {
        "index": 49,
        "question_word": "unbeknown",
        "real_word": "unbeknownst"
      },
      {
        "index": 83,
        "question_word": "unknown",
        "real_word": "anonymous."
      },
      {
        "index": 94,
        "question_word": "same",
        "real_word": "similar"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/c04218219a723f802476288efc9be904cbcabcd9.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"What really drew the public attention was some other details beyond the accident..According to the newspaper, Anderson was on a mission of love that fateful Christmas Eve in the process of distributing care packages to needy families in the area.\",\"dst\":\"真正引起公众关注的是事故之外的一些其他细节。。据该报报道，安德森在那个决定性的平安夜，正在执行一项爱心使命，向当地贫困家庭分发护理包。\"},{\"src\":\"That was a yearly tradition that he performed unbeknownst to everyone.\",\"dst\":\"这是他每年的传统表演，大家都不知道。\"},{\"src\":\"This he did because of his firm conviction that the best Christmas gifts came not from the gift received, but from those given, and that those acts of charity should remain anonymous..As it turns out, Sandra Jenkins was also involved in similar volunteer work throughout the community.\",\"dst\":\"他之所以这么做，是因为他坚信最好的圣诞礼物不是来自收到的礼物，而是来自送出的礼物，那些慈善行为应该匿名……事实证明，桑德拉·詹金斯也参与了整个社区类似的志愿者工作。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 6773,
    "timecreated": 1538289123,
    "timemodified": 1538289123,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "The Vietnamese version of Mid-Autumn Festival is rather different to that in China, through the Vietnamese also celebrating it by eating mooncakes. In Vietnam the Mid-Autumn Festival is the greatest day for children, during which parents buy their children various kinds of lanterns and snacks. Lion dances are the main attract with small dance groups performing on street corners or going from house to house collecting \"good luck\" money in exchange for a private show. In Taiwan, due in part to the westernization of Taiwan community, there is a modern trend of spending Mid-Autumn Festival with a barbecue and a few beers under the light of the full moon. It is usually a small family event but some towns and villages do organize large scale versions where the whole community gets together under beacon to eat fried meat and mooncakes.",
    "question_answer": [
      {
        "index": 13,
        "question_word": "through",
        "real_word": "though"
      },
      {
        "index": 17,
        "question_word": "celebrating",
        "real_word": "celebrate"
      },
      {
        "index": 29,
        "question_word": "greatest",
        "real_word": "happiest"
      },
      {
        "index": 50,
        "question_word": "attract",
        "real_word": "attraction"
      },
      {
        "index": 85,
        "question_word": "community",
        "real_word": "society"
      },
      {
        "index": 115,
        "question_word": "event",
        "real_word": "affair"
      },
      {
        "index": 133,
        "question_word": "beacon",
        "real_word": "lanterns"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/bc1a539fe3e382890be938514b4165e6e1dfe696.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"The Vietnamese version of Mid-Autumn Festival is rather different to that in China, though the Vietnamese also celebrate it by eating mooncakes.\",\"dst\":\"越南版的中秋节与中国的中秋节有很大的不同，不过越南人也通过吃月饼来庆祝中秋节。\"},{\"src\":\"In Vietnam the Mid-Autumn Festival is the happiest day for children, during which parents buy their children various kinds of lanterns and snacks.\",\"dst\":\"在越南，中秋节是孩子们最快乐的日子，在这期间，父母给孩子们买各种各样的灯笼和小吃。\"},{\"src\":\"Lion dances are the main attraction with small dance groups performing on street corners or going from house to house collecting \\\"good luck\\\" money in exchange for a private show.\",\"dst\":\"狮子舞是主要的吸引人的地方，有一些小的舞蹈团体在街角表演，或者挨家挨户地收集“好运”的钱来换取私人表演。\"},{\"src\":\"In Taiwan, due in part to the westernization of Taiwan society, there is a modern trend of spending Mid-Autumn Festival with a barbecue and a few beers under the light of the full moon.\",\"dst\":\"在台湾，在一定程度上由于台湾社会的西化，出现了一种现代的趋势，中秋节在满月的灯光下吃一顿烧烤，喝几杯啤酒。\"},{\"src\":\"It is usually a small family affair but some towns and villages do organize large scale versions where the whole community gets together under lanterns to eat fried meat and mooncakes.\",\"dst\":\"这通常是一个小型的家庭活动，但一些城镇和村庄确实组织了大型活动，整个社区在灯笼下聚在一起吃炸肉和月饼。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 6772,
    "timecreated": 1538289123,
    "timemodified": 1538289123,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "We know that we have to pay for what we get. If we buy food, we know there will be a bill to pay. These are private bills. But there are also public bills that should be paid. Public bills are paid for by the government. In turn, we get these services through taxation. What would happen if everyone in the city stopped paying taxes? The water supply would stop. Water might even become unclear and impure. The streets might not be cleaned. It would be no police force to protect people and property? Schools would be closed. People would become sick and diseases might spread. We should not want to live in such a city. We all want clean water and food, clean streets and good schools. We want police to protect us from crime. The chief responsibility for every government is to protect persons and property. More than three quarters of the money spent by our government is used for this purpose.",
    "question_answer": [
      {
        "index": 35,
        "question_word": "should",
        "real_word": "must"
      },
      {
        "index": 53,
        "question_word": "taxation",
        "real_word": "taxes."
      },
      {
        "index": 74,
        "question_word": "unclear",
        "real_word": "unclean"
      },
      {
        "index": 119,
        "question_word": "clean",
        "real_word": "pure"
      },
      {
        "index": 132,
        "question_word": "protect",
        "real_word": "prevent"
      },
      {
        "index": 138,
        "question_word": "responsibility",
        "real_word": "duty"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/7941375cb08af5d1146ca7cbe9954655cb6283aa.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"We know that we have to pay for what we get.\",\"dst\":\"我们知道我们必须为我们得到的付出代价。\"},{\"src\":\"If we buy food, we know there will be a bill to pay.\",\"dst\":\"如果我们买食物，我们就知道要付帐单。\"},{\"src\":\"These are private bills.\",\"dst\":\"这些是私人账单。\"},{\"src\":\"But there are also public bills that must be paid.\",\"dst\":\"但也有必须支付的公共账单。\"},{\"src\":\"Public bills are paid for by the government.\",\"dst\":\"公共账单由政府支付。\"},{\"src\":\"In turn, we get these services through taxes..What would happen if everyone in the city stopped paying taxes?\",\"dst\":\"反过来，我们通过税收获得这些服务……如果城市里的每个人都停止纳税会发生什么？\"},{\"src\":\"The water supply would stop.\",\"dst\":\"供水将会停止。\"},{\"src\":\"Water might even become unclean and impure.\",\"dst\":\"水甚至可能变得不洁和不纯。\"},{\"src\":\"The streets might not be cleaned.\",\"dst\":\"街道可能不干净。\"},{\"src\":\"It would be no police force to protect people and property?\",\"dst\":\"难道就没有警察来保护人民和财产吗？\"},{\"src\":\"Schools would be closed.\",\"dst\":\"学校将关闭。\"},{\"src\":\"People would become sick and diseases might spread.\",\"dst\":\"人们会生病，疾病可能会传播。\"},{\"src\":\"We should not want to live in such a city.\",\"dst\":\"我们不应该住在这样的城市里。\"},{\"src\":\"We all want pure water and food, clean streets and good schools.\",\"dst\":\"我们都想要纯净的水和食物，干净的街道和好的学校。\"},{\"src\":\"We want police to prevent us from crime.\",\"dst\":\"我们要警察阻止我们犯罪。\"},{\"src\":\"The chief duty for every government is to protect persons and property.\",\"dst\":\"每个政府的首要职责是保护人身和财产。\"},{\"src\":\"More than three quarters of the money spent by our government is used for this purpose.\",\"dst\":\"我国政府支出的四分之三以上用于这一目的。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3937,
    "timecreated": 1523154645,
    "timemodified": 1523154645,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Polar bears do their hunting in the winter, but because the winter is getting shorter and because the ice is disappearing faster, they have less time to restore their fat. In the summer, they're forced to remain on land for longer periods of time, and at that time, they live off the fat stored in their bodies. Thirty years ago, they stayed just over three months on land. Now it's almost four months! This reduces their strength and energy. With less ice, polar bears must swim far to reach it. This further reduces their strength and energy. These circumstances have stable decreased the bear population over the last 30 years.",
    "question_answer": [
      {
        "index": 21,
        "question_word": "faster",
        "real_word": "earlier"
      },
      {
        "index": 45,
        "question_word": "at",
        "real_word": "during"
      },
      {
        "index": 61,
        "question_word": "stayed",
        "real_word": "spent"
      },
      {
        "index": 86,
        "question_word": "far",
        "real_word": "further"
      },
      {
        "index": 100,
        "question_word": "stable",
        "real_word": "steadily"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/c2e3897fc9af3a3541b3945ce60b78de95fbe11b.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Polar bears do their hunting in the winter, but because the winter is getting shorter and because the ice is disappearing earlier, they have less time to restore their fat.\",\"dst\":\"北极熊在冬天打猎，但由于冬天越来越短，而且冰层消失得更早，它们恢复脂肪的时间越来越少。\"},{\"src\":\"In the summer, they're forced to remain on land for longer periods of time, and during that time, they live off the fat stored in their bodies.\",\"dst\":\"在夏天，它们被迫在陆地上停留更长的时间，在这段时间里，它们靠储存在体内的脂肪为生。\"},{\"src\":\"Thirty years ago, they spent just over three months on land.\",\"dst\":\"三十年前，他们在陆地上只呆了三个多月。\"},{\"src\":\"Now it's almost four months!\",\"dst\":\"现在快四个月了！\"},{\"src\":\"This reduces their strength and energy.\",\"dst\":\"这会降低他们的力量和精力。\"},{\"src\":\"With less ice, polar bears must swim further to reach it.\",\"dst\":\"由于冰少，北极熊必须游得更远才能到达。\"},{\"src\":\"This further reduces their strength and energy.\",\"dst\":\"这进一步降低了它们的力量和能量。\"},{\"src\":\"These circumstances have steadily decreased the bear population over the last 30 years.\",\"dst\":\"在过去的30年里，这些情况使熊的数量稳步下降。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3936,
    "timecreated": 1523154645,
    "timemodified": 1523154645,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "There is some resentment definitely. I think its more a case of like with youth people in their 20s. They do kind of look at some of my older friends and sort of saying well, its not really that fair. But I think they might change their tune when they are perhaps in their 30s and when they are thinking about kids. My colleague, when I was leaving some part-time, mouthed I hate you. And I think that was because I do manage to make a balance. I passed from 95 jobs, full-time to freelance. And so its not just women with children that want that flexibility? Jody Day, who founded the organization Gateway Women for women without children, said they had legitimate reasons to be grateful.",
    "question_answer": [
      {
        "index": 14,
        "question_word": "youth",
        "real_word": "younger"
      },
      {
        "index": 29,
        "question_word": "friends",
        "real_word": "colleagues"
      },
      {
        "index": 84,
        "question_word": "make",
        "real_word": "strike"
      },
      {
        "index": 126,
        "question_word": "grateful",
        "real_word": "resentful"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/f5d97534c5942680db2d81f06a07acfada6664be.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"There is some resentment definitely.\",\"dst\":\"肯定有些怨恨。\"},{\"src\":\"I think its more a case of like with younger people in their 20s.\",\"dst\":\"我认为这更像是一个20多岁的年轻人喜欢的例子。\"},{\"src\":\"They do kind of look at some of my older colleagues and sort of saying well, its not really that fair.\",\"dst\":\"他们看了看我的一些老同事，有点说，这真的不公平。\"},{\"src\":\"But I think they might change their tune when they are perhaps in their 30s and when they are thinking about kids.\",\"dst\":\"但我认为当他们30多岁的时候，当他们想到孩子的时候，他们可能会改变他们的想法。\"},{\"src\":\"My colleague, when I was leaving some part-time, mouthed I hate you.\",\"dst\":\"我的同事，当我离开一些兼职的时候，我恨你。\"},{\"src\":\"And I think that was because I do manage to strike a balance.\",\"dst\":\"我想那是因为我设法找到了一个平衡点。\"},{\"src\":\"I passed from 95 jobs, full-time to freelance.\",\"dst\":\"我从95份全职工作变成了自由职业者。\"},{\"src\":\"And so its not just women with children that want that flexibility?\",\"dst\":\"所以不仅仅是有孩子的女性需要这种灵活性？\"},{\"src\":\"Jody Day, who founded the organization Gateway Women for women without children, said they had legitimate reasons to be resentful.\",\"dst\":\"为没有孩子的妇女建立“妇女之门”组织的乔迪·戴说，她们有正当理由表示不满。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3935,
    "timecreated": 1523154645,
    "timemodified": 1523154645,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "With fears of a lost generation rising, EU leaders choose to discuss the details of an action plan to treat youth unemployment. They agreed to spend 6 billion euros on creating jobs and traineeships, The Guardian reported. But economists have announced that throwing money at the problem will not necessarily accelerate its resolution. Instead, they stress that the key is economic growth. Its not possible to create jobs in a possession environment  you need growth to pick up, Carsten Brzeski, from the international banking company ING, told Reuters. Europes young people, however, are not wishing to wait for a miracle to happen; they are finding other ways of dealing with their grim circumstances. Some choose to delay employment by travelling or volunteering, some look abroad for better opportunities, while others stay put and seek to change their fate.",
    "question_answer": [
      {
        "index": 9,
        "question_word": "choose",
        "real_word": "met"
      },
      {
        "index": 19,
        "question_word": "treat",
        "real_word": "tackle"
      },
      {
        "index": 40,
        "question_word": "announced",
        "real_word": "warned"
      },
      {
        "index": 70,
        "question_word": "possession",
        "real_word": "recessionary"
      },
      {
        "index": 95,
        "question_word": "wishing",
        "real_word": "willing"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/70b7f2ae98dade2aed82737af1f4693feebfe0b6.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"With fears of a lost generation rising, EU leaders met to discuss the details of an action plan to tackle youth unemployment.\",\"dst\":\"随着对失去的一代人的担忧上升，欧盟领导人开会讨论了解决青年失业问题行动计划的细节。\"},{\"src\":\"They agreed to spend 6 billion euros on creating jobs and traineeships, The Guardian reported.\",\"dst\":\"据英国《卫报》报道，他们同意斥资60亿欧元创造就业机会和见习机会。\"},{\"src\":\"But economists have warned that throwing money at the problem will not necessarily accelerate its resolution.\",\"dst\":\"但经济学家警告说，向这个问题投入资金并不一定会加速问题的解决。\"},{\"src\":\"Instead, they stress that the key is economic growth.\",\"dst\":\"相反，他们强调关键是经济增长。\"},{\"src\":\"Its not possible to create jobs in a recessionary environment  you need growth to pick up, Carsten Brzeski, from the international banking company ING, told Reuters.\",\"dst\":\"ING国际银行公司的Carsten Brzeski对路透表示，在经济衰退的环境下，要想创造就业机会是不可能的，经济增长需要复苏。\"},{\"src\":\"Europes young people, however, are not willing to wait for a miracle to happen; they are finding other ways of dealing with their grim circumstances.\",\"dst\":\"然而，欧洲的年轻人不愿意等待奇迹的发生；他们正在寻找其他方法来应对他们的严峻环境。\"},{\"src\":\"Some choose to delay employment by travelling or volunteering, some look abroad for better opportunities, while others stay put and seek to change their fate.\",\"dst\":\"一些人选择通过旅行或志愿服务来推迟就业，一些人到国外寻找更好的机会，而另一些人则留在原地，寻求改变自己的命运。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3934,
    "timecreated": 1523154645,
    "timemodified": 1523154645,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Online food shopping has really taken off, with most big supermarkets offering the service. The inconvenience of not being able to touch the food you are buying is outweighed by the time saved and convenience of having the goods delivered. Typical users of online supermarkets include the elderly, people who work long hours and whose without their own transport.",
    "question_answer": [
      {
        "index": 1,
        "question_word": "food",
        "real_word": "grocery"
      },
      {
        "index": 9,
        "question_word": "big",
        "real_word": "major"
      },
      {
        "index": 21,
        "question_word": "touch",
        "real_word": "see"
      },
      {
        "index": 54,
        "question_word": "whose",
        "real_word": "those"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/afc8987f8fa97c8a028de115dc5102d695552d2f.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Online grocery shopping has really taken off, with most major supermarkets offering the service.\",\"dst\":\"网上购物已经真正起飞，大多数大型超市都提供这项服务。\"},{\"src\":\"The inconvenience of not being able to see the food you are buying is outweighed by the time saved and convenience of having the goods delivered.\",\"dst\":\"看不到你要买的食物带来的不便，被送货所节省的时间和方便所抵消。\"},{\"src\":\"Typical users of online supermarkets include the elderly, people who work long hours and those without their own transport.\",\"dst\":\"网上超市的典型用户包括老年人、长时间工作的人和没有自己交通工具的人。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3933,
    "timecreated": 1523154644,
    "timemodified": 1523154644,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Its important for parents to see their childrens development, and if a parent is worried about a childs development, turn to the professionals. The earlier parents notice delays, the sooner they can begin doing sample things that may help improve their childs development. For example: talking to the child about what they are doing, telling when the child shows them something, and playing simple games to keep the childs attention. She says.",
    "question_answer": [
      {
        "index": 5,
        "question_word": "see",
        "real_word": "notice"
      },
      {
        "index": 14,
        "question_word": "worried",
        "real_word": "concerned"
      },
      {
        "index": 34,
        "question_word": "sample",
        "real_word": "simple"
      },
      {
        "index": 54,
        "question_word": "telling",
        "real_word": "commenting"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/ff7a15c6edf38fa0a775af2e86b2125445c3f7d6.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Its important for parents to notice their childrens development, and if a parent is concerned about a childs development, turn to the professionals.\",\"dst\":\"父母注意孩子的发展是很重要的，如果父母关心孩子的发展，就求助于专业人士。\"},{\"src\":\"The earlier parents notice delays, the sooner they can begin doing simple things that may help improve their childs development.\",\"dst\":\"父母越早注意到延迟，他们就越早开始做可能有助于改善孩子发展的简单事情。\"},{\"src\":\"For example: talking to the child about what they are doing, commenting when the child shows them something, and playing simple games to keep the childs attention.\",\"dst\":\"例如：和孩子谈论他们正在做的事情，当孩子给他们看东西时评论，玩简单的游戏来保持孩子的注意力。\"},{\"src\":\"She says.\",\"dst\":\"她说。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3932,
    "timecreated": 1523154644,
    "timemodified": 1523154644,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "The Amazon basin is thin with vegetation, including a highly dense forest of tall trees. By far the most beautiful thing in the basin is the treetop world. Many of the trees are 150 feet tall, with canopies exceeding 80 feet. Some scientists believe this canopy alone may consist half of the worlds species!",
    "question_answer": [
      {
        "index": 4,
        "question_word": "thin",
        "real_word": "thick"
      },
      {
        "index": 9,
        "question_word": "highly",
        "real_word": "very"
      },
      {
        "index": 19,
        "question_word": "beautiful",
        "real_word": "amazing"
      },
      {
        "index": 48,
        "question_word": "consist",
        "real_word": "contain"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/7201c1c7b7db439d6acc9a707d12f8894a54802f.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"The Amazon basin is thick with vegetation, including a very dense forest of tall trees.\",\"dst\":\"亚马逊河流域植被茂密，包括茂密的高大树木林。\"},{\"src\":\"By far the most amazing thing in the basin is the treetop world.\",\"dst\":\"到目前为止，盆地里最令人惊奇的是树梢世界。\"},{\"src\":\"Many of the trees are 150 feet tall, with canopies exceeding 80 feet.\",\"dst\":\"许多树有150英尺高，树冠超过80英尺。\"},{\"src\":\"Some scientists believe this canopy alone may contain half of the worlds species!\",\"dst\":\"一些科学家认为，光是这个树冠就可能包含世界上一半的物种！\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3931,
    "timecreated": 1523154644,
    "timemodified": 1523154644,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "The main reason why I think its so interesting is that the Amazon data is the largest tropical rain forest in the century. And where theres a rain forest, theres life. Plenty of it! The Nile flows mostly through dry desert, where theres little wildlife or plant life. Meanwhile, theres more life in the Amazon than in any other areas in the world. For example, there are 500 species of mammals, one third of the worlds bird population, thousands of reptiles, 175 different kinds of lizards, up to 300 million types of insects, and infinite vegetation. The trees are so dense that they form a canopy. The basin contains the Earths richest and most varied ecosystem. It will startle your senses, your sight, your hearing, and your sense of smell.",
    "question_answer": [
      {
        "index": 13,
        "question_word": "data",
        "real_word": "delta"
      },
      {
        "index": 22,
        "question_word": "century",
        "real_word": "world"
      },
      {
        "index": 59,
        "question_word": "areas",
        "real_word": "places"
      },
      {
        "index": 78,
        "question_word": "thousands",
        "real_word": "hundreds"
      },
      {
        "index": 94,
        "question_word": "infinite",
        "real_word": "immense"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/04d4616dee1cd77356bbade61a8b86b5f51d18ab.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"The main reason why I think its so interesting is that the Amazon delta is the largest tropical rain forest in the world.\",\"dst\":\"我认为它如此有趣的主要原因是亚马逊河三角洲是世界上最大的热带雨林。\"},{\"src\":\"And where theres a rain forest, theres life.\",\"dst\":\"哪里有雨林，哪里就有生命。\"},{\"src\":\"Plenty of it!\",\"dst\":\"够了！\"},{\"src\":\"The Nile flows mostly through dry desert, where theres little wildlife or plant life.\",\"dst\":\"尼罗河主要流经干旱的沙漠，那里几乎没有野生动物或植物。\"},{\"src\":\"Meanwhile, theres more life in the Amazon than in any other places in the world.\",\"dst\":\"与此同时，亚马逊的生命比世界上任何其他地方都要多。\"},{\"src\":\"For example, there are 500 species of mammals, one third of the worlds bird population, hundreds of reptiles, 175 different kinds of lizards, up to 300 million types of insects, and immense vegetation.\",\"dst\":\"例如，有500种哺乳动物，占世界鸟类总数的三分之一，数百种爬行动物，175种不同种类的蜥蜴，多达3亿种昆虫，以及巨大的植被。\"},{\"src\":\"The trees are so dense that they form a canopy.\",\"dst\":\"这些树很茂密，形成了一个树冠。\"},{\"src\":\"The basin contains the Earths richest and most varied ecosystem.\",\"dst\":\"这个盆地包含着地球上最丰富和最多样的生态系统。\"},{\"src\":\"It will startle your senses, your sight, your hearing, and your sense of smell.\",\"dst\":\"它会惊动你的感官、视觉、听觉和嗅觉。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3930,
    "timecreated": 1523154644,
    "timemodified": 1523154644,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Advertising really came and became an critical part of doing business during the industrial evaluation. Suddenly there was a much greater supply of things to sell. And as we said before, that is the driving force behind advertisement. Peoples attention had to be drawn to the new product. Lets take a look at parts of the advertisements from that time.",
    "question_answer": [
      {
        "index": 6,
        "question_word": "critical",
        "real_word": "essential"
      },
      {
        "index": 14,
        "question_word": "evaluation",
        "real_word": "revolution"
      },
      {
        "index": 30,
        "question_word": "before",
        "real_word": "earlier"
      },
      {
        "index": 37,
        "question_word": "advertisement",
        "real_word": "advertising"
      },
      {
        "index": 53,
        "question_word": "parts",
        "real_word": "some"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/fec1f5dbec93739fadaf6601a759fdcb169cf645.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Advertising really came and became an essential part of doing business during the industrial revolution.\",\"dst\":\"在工业革命期间，广告真的出现了，并成为商业活动中必不可少的一部分。\"},{\"src\":\"Suddenly there was a much greater supply of things to sell.\",\"dst\":\"突然有更多的东西要卖了。\"},{\"src\":\"And as we said earlier, that is the driving force behind advertising.\",\"dst\":\"正如我们前面所说，这是广告背后的驱动力。\"},{\"src\":\"Peoples attention had to be drawn to the new product.\",\"dst\":\"人们不得不把注意力吸引到新产品上。\"},{\"src\":\"Lets take a look at some of the advertisements from that time.\",\"dst\":\"我们来看看那个时候的一些广告。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3929,
    "timecreated": 1523154644,
    "timemodified": 1523154644,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Metal, valued by weight, preceded coins in many parts of the world. Iron, in lumps, bars or rings, is still used in many countries instead of money. It can either be changes for goods, or made into tools, weapons or ornaments. The early money of China, apart from shell, was of bronze, often in plain, round pieces with a hole in the middle, called \"cash\". The earliest of these are between 3,000 and 4,000 years old - older than the earliest coins of the western Mediterranean.  Nowadays, coins and notes have replaced nearly all the more picturesque forms of money, and although in one or two of the more remote countries people still hold it for future use on ceremonial events such as weddings and funerals, examples of primitive money will soon be found only in history.",
    "question_answer": [
      {
        "index": 31,
        "question_word": "changes",
        "real_word": "exchanged"
      },
      {
        "index": 54,
        "question_word": "plain",
        "real_word": "flat"
      },
      {
        "index": 84,
        "question_word": "western",
        "real_word": "eastern"
      },
      {
        "index": 121,
        "question_word": "events",
        "real_word": "occasions"
      },
      {
        "index": 137,
        "question_word": "history",
        "real_word": "museums"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/757fd3df30a4ff1cecdc5e66cef32e20af10c983.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Metal, valued by weight, preceded coins in many parts of the world.\",\"dst\":\"在世界许多地方，以重量计价的金属先于硬币。\"},{\"src\":\"Iron, in lumps, bars or rings, is still used in many countries instead of money.\",\"dst\":\"许多国家仍然使用块状、条状或环状的铁代替货币。\"},{\"src\":\"It can either be exchanged for goods, or made into tools, weapons or ornaments.\",\"dst\":\"它既可以交换货物，也可以制成工具、武器或装饰品。\"},{\"src\":\"The early money of China, apart from shell, was of bronze, often in flat, round pieces with a hole in the middle, called \\\"cash\\\".\",\"dst\":\"中国早期的货币，除了贝壳以外，都是青铜的，通常是平的，圆的，中间有个洞，叫做“现金”。\"},{\"src\":\"The earliest of these are between 3,000 and 4,000 years old - older than the earliest coins of the eastern Mediterranean.\",\"dst\":\"其中最早的是3000年至4000年的历史，比地中海东部最早的货币还要古老。\"},{\"src\":\"Nowadays, coins and notes have replaced nearly all the more picturesque forms of money, and although in one or two of the more remote countries people still hold it for future use on ceremonial occasions such as weddings and funerals, examples of primitive money will soon be found only in museums.\",\"dst\":\"如今，硬币和纸币已经取代了几乎所有更为独特的货币形式，尽管在一个或两个较偏远的国家，人们仍然持有这些货币以备将来在婚礼和葬礼等仪式场合使用，但原始货币的例子很快只会在博物馆中找到。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3928,
    "timecreated": 1523154644,
    "timemodified": 1523154644,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Mark Starkey, the longtime owner of the Heart of Gaming computer game outlet in London, said there is also the distinguish between older games and the new ones. \"The ability to make games a lot more bigger, a lot more finest, a lot more intricate is here now. It is going to hold their attention longer. It is going to hold it a lot longer, because there is always wanting to progress through the story line - Oh my god, I have to see what happens next, etc. Whereas, again, the old games challenge more your hand-eye correlation your speed, your timing, your reactions, rather than perhaps your imagination.\"   The games industry has long claimed there is no proved link between games and addiction. But the new study says additional research is needed to establish the effort of prolific computer game-playing on performance at school.",
    "question_answer": [
      {
        "index": 20,
        "question_word": "distinguish",
        "real_word": "difference"
      },
      {
        "index": 40,
        "question_word": "finest",
        "real_word": "detailed"
      },
      {
        "index": 97,
        "question_word": "correlation",
        "real_word": "coordination"
      },
      {
        "index": 120,
        "question_word": "proved",
        "real_word": "proven"
      },
      {
        "index": 138,
        "question_word": "effort",
        "real_word": "effect"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/924896d0f7c303f56b81c3d540de4ad393defd50.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Mark Starkey, the longtime owner of the Heart of Gaming computer game outlet in London, said there is also the difference between older games and the new ones.\",\"dst\":\"markstarkey是伦敦Heart of Gaming电脑游戏店的长期老板，他说旧游戏和新游戏之间也有区别。\"},{\"src\":\"\\\"The ability to make games a lot more bigger, a lot more detailed, a lot more intricate is here now.\",\"dst\":\"“让游戏变得更大、更详细、更复杂的能力现在就在这里。\"},{\"src\":\"It is going to hold their attention longer.\",\"dst\":\"这将使他们的注意力保持更长时间。\"},{\"src\":\"It is going to hold it a lot longer, because there is always wanting to progress through the story line - Oh my god, I have to see what happens next, etc.\",\"dst\":\"它会保持更长的时间，因为总有人想通过故事情节前进-哦，天哪，我必须看看接下来会发生什么，等等。\"},{\"src\":\"Whereas, again, the old games challenge more your hand-eye coordination your speed, your timing, your reactions, rather than perhaps your imagination.\\\"   The games industry has long claimed there is no proven link between games and addiction.\",\"dst\":\"然而，同样的，老游戏挑战更多的是你的手眼协调能力，你的速度，你的时间，你的反应，而不是你的想象力。”游戏行业一直声称，游戏和上瘾之间没有被证实的联系。\"},{\"src\":\"But the new study says additional research is needed to establish the effect of prolific computer game-playing on performance at school.\",\"dst\":\"但这项新的研究表明，还需要更多的研究来确定大量玩电脑游戏对学校表现的影响。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3927,
    "timecreated": 1523154643,
    "timemodified": 1523154643,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Now, farmers were no longer independent just on the weather and their own efforts. Their lives were increasingly dominated by banks, which had power to grant or deny loans for new machinery, and by the railroads, which set the rates for shipping their crops to market. As businessmen, farmers now had to care about national economic depreciation and the influence of world supply and demand on, for example, the price of wheat in Kansas. And so, by the end of the nineteenth century, the era of Jefferson's independent farmer had come to a close.",
    "question_answer": [
      {
        "index": 5,
        "question_word": "independent",
        "real_word": "dependent"
      },
      {
        "index": 18,
        "question_word": "dominated",
        "real_word": "controlled"
      },
      {
        "index": 52,
        "question_word": "care",
        "real_word": "worry"
      },
      {
        "index": 56,
        "question_word": "depreciation",
        "real_word": "depressions"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/ee7d98377d24aa2c0aa26bc161c8310e3258a571.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Now, farmers were no longer dependent just on the weather and their own efforts.\",\"dst\":\"现在，农民不再仅仅依靠天气和自己的努力。\"},{\"src\":\"Their lives were increasingly controlled by banks, which had power to grant or deny loans for new machinery, and by the railroads, which set the rates for shipping their crops to market.\",\"dst\":\"他们的生活越来越受到银行的控制，银行有权发放或拒绝新机器的贷款，铁路也有权制定将农作物运往市场的费率。\"},{\"src\":\"As businessmen, farmers now had to worry about national economic depressions and the influence of world supply and demand on, for example, the price of wheat in Kansas.\",\"dst\":\"作为商人，农民现在不得不担心国家经济萧条以及世界供求关系对堪萨斯州小麦价格的影响。\"},{\"src\":\"And so, by the end of the nineteenth century, the era of Jefferson's independent farmer had come to a close.\",\"dst\":\"因此，到19世纪末，杰斐逊的独立农民时代已经结束。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3926,
    "timecreated": 1523154643,
    "timemodified": 1523154643,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Dr. Nancy and other researchers designed a program to help smokers quit while they were in the hospital and stay smoke free after they were dismissed Patients were given a nicotine batch and advice in the hospital, with follow-up support after they left. \"We know that medication works and that advice works, but they both together work much better than either one alone,\" Nancy said. Seventy percent of smokers in that program were still smoke-free six months after left the hospital. The U.S. government and public organizations have been running anti-smoking campaigns since 1964. A study from the Yale School of Public Health found that those who quit during this time period had a 30-percent improvement in the expectancy of life.",
    "question_answer": [
      {
        "index": 25,
        "question_word": "dismissed",
        "real_word": "discharged"
      },
      {
        "index": 31,
        "question_word": "batch",
        "real_word": "patch"
      },
      {
        "index": 78,
        "question_word": "left",
        "real_word": "leaving"
      },
      {
        "index": 85,
        "question_word": "public",
        "real_word": "private"
      },
      {
        "index": 118,
        "question_word": "expectancy",
        "real_word": "expectation"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/3cbb996711d37398608915a8e162c75c17622963.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Dr.\",\"dst\":\"博士。\"},{\"src\":\"Nancy and other researchers designed a program to help smokers quit while they were in the hospital and stay smoke free after they were discharged Patients were given a nicotine patch and advice in the hospital, with follow-up support after they left.\",\"dst\":\"南希和其他研究人员设计了一个项目，帮助吸烟者在住院期间戒烟，并在出院后保持无烟状态。患者在医院得到尼古丁贴片和建议，出院后得到后续支持。\"},{\"src\":\"\\\"We know that medication works and that advice works, but they both together work much better than either one alone,\\\" Nancy said.\",\"dst\":\"南希说：“我们知道药物治疗是有效的，建议也是有效的，但两者结合起来比单独使用任何一种都有效。”。\"},{\"src\":\"Seventy percent of smokers in that program were still smoke-free six months after leaving the hospital.\",\"dst\":\"该项目中70%的吸烟者在出院六个月后仍然是无烟的。\"},{\"src\":\"The U.S.government and private organizations have been running anti-smoking campaigns since 1964.\",\"dst\":\"自1964年以来，美国政府和私人组织一直在开展禁烟运动。\"},{\"src\":\"A study from the Yale School of Public Health found that those who quit during this time period had a 30-percent improvement in the expectation of life.\",\"dst\":\"耶鲁大学公共卫生学院的一项研究发现，在这段时间内戒烟的人的预期寿命提高了30%。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3925,
    "timecreated": 1523154643,
    "timemodified": 1523154643,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "The number 13 is said to be unlucky for some, and when the 13th day of the month falls on a Monday, anyone wishing to avoid a bad event had better stay indoors. The worst misfortune that can happen to a man is caused by breaking a mirror, as it brings seven years of bad luck. The superstition is supposed to have originated in recent times, when mirrors were concerned to be tools of the gods. Black cats are generally considered lucky in Britain, even though they are associated with witchcraft. It is considerably lucky if a black cat crosses your path although in America the exact opposite belief prevails.",
    "question_answer": [
      {
        "index": 21,
        "question_word": "Monday",
        "real_word": "Friday"
      },
      {
        "index": 41,
        "question_word": "man",
        "real_word": "person"
      },
      {
        "index": 64,
        "question_word": "recent",
        "real_word": "ancient"
      },
      {
        "index": 69,
        "question_word": "concerned",
        "real_word": "considered"
      },
      {
        "index": 93,
        "question_word": "considerably",
        "real_word": "especially"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/37ea061bbd7953b0b1b689f0fc4e9969ff4d5069.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"The number 13 is said to be unlucky for some, and when the 13th day of the month falls on a Friday, anyone wishing to avoid a bad event had better stay indoors.\",\"dst\":\"据说数字13对某些人来说是不吉利的，当这个月的第13天是星期五的时候，任何想避免不幸事件的人最好呆在室内。\"},{\"src\":\"The worst misfortune that can happen to a person is caused by breaking a mirror, as it brings seven years of bad luck.\",\"dst\":\"一个人所能遭遇的最坏的不幸是打破镜子，因为它会带来七年的厄运。\"},{\"src\":\"The superstition is supposed to have originated in ancient times, when mirrors were considered to be tools of the gods.\",\"dst\":\"这种迷信据说起源于古代，那时镜子被认为是神的工具。\"},{\"src\":\"Black cats are generally considered lucky in Britain, even though they are associated with witchcraft.\",\"dst\":\"在英国，黑猫通常被认为是幸运的，尽管它们与巫术有关。\"},{\"src\":\"It is especially lucky if a black cat crosses your path although in America the exact opposite belief prevails.\",\"dst\":\"特别幸运的是，如果一只黑猫横穿你的道路，尽管在美国，完全相反的信念盛行。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3924,
    "timecreated": 1523154643,
    "timemodified": 1523154643,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "The development of the steam engine make a host of other changes technologically, socially, and environmentally within British culture. Steam engine technology led to the development of factories, where production were turned out in the hundreds or even thousands. The factory industry eventually gave rise to what we will known as the modem city. Manchester, for example, due to its cotton mills, became known as Cottonopolis because there were so many factories producing textiles.",
    "question_answer": [
      {
        "index": 6,
        "question_word": "make",
        "real_word": "caused"
      },
      {
        "index": 15,
        "question_word": "environmentally",
        "real_word": "economically"
      },
      {
        "index": 29,
        "question_word": "production",
        "real_word": "products"
      },
      {
        "index": 48,
        "question_word": "will",
        "real_word": "now"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/f949c7d3cc519965781d4e85ebfbddd4c750b294.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"The development of the steam engine caused a host of other changes technologically, socially, and economically within British culture.\",\"dst\":\"蒸汽机的发展在英国文化中引起了许多其他的技术、社会和经济上的变化。\"},{\"src\":\"Steam engine technology led to the development of factories, where products were turned out in the hundreds or even thousands.\",\"dst\":\"蒸汽机技术导致了工厂的发展，在那里生产出成百上千种产品。\"},{\"src\":\"The factory industry eventually gave rise to what we now known as the modem city.\",\"dst\":\"工厂工业最终产生了我们现在所称的现代城市。\"},{\"src\":\"Manchester, for example, due to its cotton mills, became known as Cottonopolis because there were so many factories producing textiles.\",\"dst\":\"例如，曼彻斯特因其棉纺厂而被称为Cottonopolis，因为那里有许多工厂生产纺织品。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3923,
    "timecreated": 1523154643,
    "timemodified": 1523154643,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Demand for meat, milk and eggs is growing around the world. To meet that demand, the way these goods are produced is changing. The change is from small farms to large industry operations. This has already happened in the United States. But not everyone is satisfied with the change. As a result, there is also a growing demand for products growing internationally on small farms.",
    "question_answer": [
      {
        "index": 18,
        "question_word": "goods",
        "real_word": "products"
      },
      {
        "index": 31,
        "question_word": "industry",
        "real_word": "industrial"
      },
      {
        "index": 45,
        "question_word": "satisfied",
        "real_word": "happy"
      },
      {
        "index": 61,
        "question_word": "internationally",
        "real_word": "locally"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/b8b6c32ec1dc1e596c00180196887b07a88e00b0.m4a",
      "mimetype": "audio/mp4"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Demand for meat, milk and eggs is growing around the world.\",\"dst\":\"全世界对肉、奶和蛋的需求都在增长。\"},{\"src\":\"To meet that demand, the way these products are produced is changing.\",\"dst\":\"为了满足这种需求，这些产品的生产方式正在改变。\"},{\"src\":\"The change is from small farms to large industrial operations.\",\"dst\":\"这种变化是从小型农场向大型工业经营转变。\"},{\"src\":\"This has already happened in the United States.\",\"dst\":\"这种情况在美国已经发生过。\"},{\"src\":\"But not everyone is happy with the change.\",\"dst\":\"但并不是每个人都对这种变化感到高兴。\"},{\"src\":\"As a result, there is also a growing demand for products growing locally on small farms.\",\"dst\":\"因此，对当地小农场种植的产品的需求也越来越大。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3334,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Teachers said the digital age has had a decent influence - and a not-so-good influence - on this generation of American teenagers. More than 2,000 middle and high school teachers took an online surgery. Researchers also spoke with teachers in focus groups. Three-quarters of the teachers said the Internet and digitize search tools have had a positive effect on their students' research habits and skills. But 87 percent agreed that these technologies are craving an \"easily distracted generation with short attention spans.\" And 64 percent said the technologies \"do more to attract students than to help them academically.\" Many students think \"doing research\" now means just doing a quick search on Google.",
    "question_answer": [
      {
        "index": 1,
        "question_word": "said",
        "real_word": "say"
      },
      {
        "index": 8,
        "question_word": "decent",
        "real_word": "good"
      },
      {
        "index": 33,
        "question_word": "surgery",
        "real_word": "survey"
      },
      {
        "index": 50,
        "question_word": "digitize",
        "real_word": "digital"
      },
      {
        "index": 73,
        "question_word": "craving",
        "real_word": "creating"
      },
      {
        "index": 91,
        "question_word": "attract",
        "real_word": "distract"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/24b4370af38b410a5d68894a37f363123e700c7a.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Teachers say the digital age has had a good influence - and a not-so-good influence - on this generation of American teenagers.\",\"dst\":\"老师们说，数字时代对这一代美国青少年产生了很好的影响，但不是很好的影响。\"},{\"src\":\"More than 2,000 middle and high school teachers took an online survey.\",\"dst\":\"2000多名中学教师参加了一项在线调查。\"},{\"src\":\"Researchers also spoke with teachers in focus groups.\",\"dst\":\"研究人员还与重点小组的教师进行了交谈。\"},{\"src\":\"Three-quarters of the teachers said the Internet and digital search tools have had a positive effect on their students' research habits and skills.\",\"dst\":\"四分之三的教师表示，互联网和数字搜索工具对学生的研究习惯和技能产生了积极影响。\"},{\"src\":\"But 87 percent agreed that these technologies are creating an \\\"easily distracted generation with short attention spans.\\\" And 64 percent said the technologies \\\"do more to distract students than to help them academically.\\\" Many students think \\\"doing research\\\" now means just doing a quick search on Google.\",\"dst\":\"但87%的人认为这些技术正在创造一个“注意力跨度短、容易分心的一代”。64%的人认为这些技术“更多的是分散学生的注意力，而不是帮助他们学习。”许多学生认为现在“做研究”意味着只需在谷歌上快速搜索。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3333,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "The 2010 Global Hunger Index report was released today by the International Food Policy Research Institute (IFPRI). It notice that, in recent years, experts have come to the conclusion that undernourishment between convection and a child's second birthday can have genuine and long-lasting impacts. Undernourishment during this approximately 1,000-day window can seriously change the growth and development of children and enable them more likely to get sick and die than well-fed children.",
    "question_answer": [
      {
        "index": 18,
        "question_word": "notice",
        "real_word": "notes"
      },
      {
        "index": 32,
        "question_word": "convection",
        "real_word": "conception"
      },
      {
        "index": 40,
        "question_word": "genuine",
        "real_word": "serious"
      },
      {
        "index": 52,
        "question_word": "change",
        "real_word": "check"
      },
      {
        "index": 60,
        "question_word": "enable",
        "real_word": "render"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/61d16c56d9ebbc757485887fbb8cc6d3c13f1f7c.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"The 2010 Global Hunger Index report was released today by the International Food Policy Research Institute (IFPRI).\",\"dst\":\"国际粮食政策研究所（IFPRI）今天发布了2010年全球饥饿指数报告。\"},{\"src\":\"It notes that, in recent years, experts have come to the conclusion that undernourishment between conception and a child's second birthday can have serious and long-lasting impacts.\",\"dst\":\"报告指出，近年来，专家们得出结论，从怀孕到孩子两岁生日之间的营养不良会产生严重和持久的影响。\"},{\"src\":\"Undernourishment during this approximately 1,000-day window can seriously check the growth and development of children and render them more likely to get sick and die than well-fed children.\",\"dst\":\"在这大约1000天的时间里，营养不良会严重阻碍儿童的生长发育，使他们比营养良好的儿童更容易生病和死亡。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3332,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Not every service or product met your satisfaction. When you are disappointed, you should voice your dissatisfaction. One reason for doing so is to help the vendor know there is a problem. The problem may have been created at a lower level in the vendor's company, and the vendor himself may know nothing about it at all. You help him when you bring weaknesses or fatigues to his attention. A second reason for writing a letter of complement to a vendor is to seek compensation. You may not wish to persuade the matter so far as to take legal action, but you may wish to give the vendor the opportunity of making good.",
    "question_answer": [
      {
        "index": 5,
        "question_word": "met",
        "real_word": "meets"
      },
      {
        "index": 11,
        "question_word": "disappointed",
        "real_word": "dissatisfied"
      },
      {
        "index": 65,
        "question_word": "fatigues",
        "real_word": "failures"
      },
      {
        "index": 77,
        "question_word": "complement",
        "real_word": "complaint"
      },
      {
        "index": 90,
        "question_word": "persuade",
        "real_word": "pursue"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/6c1fa1f73253b4a5eaf6e02239d4a3e2119d2b05.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Not every service or product meets your satisfaction.\",\"dst\":\"不是每一项服务或产品都能让你满意。\"},{\"src\":\"When you are dissatisfied, you should voice your dissatisfaction.\",\"dst\":\"当你不满意时，你应该表达你的不满。\"},{\"src\":\"One reason for doing so is to help the vendor know there is a problem.\",\"dst\":\"这样做的一个原因是帮助供应商知道存在问题。\"},{\"src\":\"The problem may have been created at a lower level in the vendor's company, and the vendor himself may know nothing about it at all.\",\"dst\":\"问题可能是在供应商所在公司的较低级别上产生的，供应商自己可能对此一无所知。\"},{\"src\":\"You help him when you bring weaknesses or failures to his attention.\",\"dst\":\"当你让他注意到你的弱点或失败时，你会帮助他。\"},{\"src\":\"A second reason for writing a letter of complaint to a vendor is to seek compensation.\",\"dst\":\"给供应商写投诉信的第二个原因是要求赔偿。\"},{\"src\":\"You may not wish to pursue the matter so far as to take legal action, but you may wish to give the vendor the opportunity of making good.\",\"dst\":\"您可能不希望追究此事而采取法律行动，但您可能希望给供应商一个弥补损失的机会。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3331,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Children with autism have difficulty with social skills and communication. They often behave in restricted and represented ways and have what seem to be like abnormally interests. Autism is much common in boys than girls. What causes it is not clear. Scientists are investigating genes and possible environmental implications. Doctors usually cannot affirm a diagnosis of autism until a child is about three years old.",
    "question_answer": [
      {
        "index": 16,
        "question_word": "represented",
        "real_word": "repetitive"
      },
      {
        "index": 29,
        "question_word": "much",
        "real_word": "more"
      },
      {
        "index": 43,
        "question_word": "investigating",
        "real_word": "studying"
      },
      {
        "index": 48,
        "question_word": "implications",
        "real_word": "influences"
      },
      {
        "index": 52,
        "question_word": "affirm",
        "real_word": "confirm"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/819a34769a859c93340d0b0785087df4f91a042e.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Children with autism have difficulty with social skills and communication.\",\"dst\":\"自闭症儿童在社交技能和交流方面有困难。\"},{\"src\":\"They often behave in restricted and repetitive ways and have what seem to be like abnormally interests.\",\"dst\":\"他们的行为常常受到限制和重复，而且似乎有着不正常的兴趣。\"},{\"src\":\"Autism is more common in boys than girls.\",\"dst\":\"自闭症男孩比女孩更常见。\"},{\"src\":\"What causes it is not clear.\",\"dst\":\"究竟是什么原因造成的尚不清楚。\"},{\"src\":\"Scientists are studying genes and possible environmental influences.\",\"dst\":\"科学家们正在研究基因和可能的环境影响。\"},{\"src\":\"Doctors usually cannot confirm a diagnosis of autism until a child is about three years old.\",\"dst\":\"医生通常要等到孩子三岁左右才能确诊自闭症。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3330,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "The \"standard of living\" of any country meant the average person's share of the goods and services which the country produces. A country's, standard of living, therefore, depending first and foremost on its capacity to produce wealth. \"Wealth\" in this sense is not money, for we do not live on money but on things that money can buy: \"goods\" such as food and clothing, and \"services\" such as transport and entertainment. A country's ability to produce wealth depends upon many factories, most of which have an effect on one another. Wealth depends to a great extension upon a country's natural resources, such as coal, gold, and other minerals, water supply and so on.",
    "question_answer": [
      {
        "index": 7,
        "question_word": "meant",
        "real_word": "means"
      },
      {
        "index": 27,
        "question_word": "depending",
        "real_word": "depends"
      },
      {
        "index": 73,
        "question_word": "ability",
        "real_word": "capacity"
      },
      {
        "index": 80,
        "question_word": "factories",
        "real_word": "factors"
      },
      {
        "index": 95,
        "question_word": "extension",
        "real_word": "extent"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/7693be7379137b2a94036c966f32932ab0f0f7f9.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"The \\\"standard of living\\\" of any country means the average person's share of the goods and services which the country produces.\",\"dst\":\"任何一个国家的“生活水平”是指该国生产的商品和服务的人均份额。\"},{\"src\":\"A country's, standard of living, therefore, depends first and foremost on its capacity to produce wealth.\",\"dst\":\"因此，一个国家的生活水平首先取决于其创造财富的能力。\"},{\"src\":\"\\\"Wealth\\\" in this sense is not money, for we do not live on money but on things that money can buy: \\\"goods\\\" such as food and clothing, and \\\"services\\\" such as transport and entertainment.\",\"dst\":\"从这个意义上说，“财富”不是钱，因为我们不是靠钱生活，而是靠钱能买到的东西生活：“货物”如食物和衣服，“服务”如交通和娱乐。\"},{\"src\":\"A country's capacity to produce wealth depends upon many factors, most of which have an effect on one another.\",\"dst\":\"一个国家创造财富的能力取决于许多因素，其中大多数因素相互影响。\"},{\"src\":\"Wealth depends to a great extent upon a country's natural resources, such as coal, gold, and other minerals, water supply and so on.\",\"dst\":\"财富在很大程度上取决于一个国家的自然资源，如煤炭、黄金和其他矿物、水供应等。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3329,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Self-image is the picture you have of yourself, the sort of person you believe you are. Included in your self-image are the categories in which you place yourself, the roles you play and other similar description you use to identify yourself. If you tell an acquaintance you are a grandfather who currently lost his wife and who does volunteering work on weekends, server elements of your self-image are bought to light  the role of grandparent, widow and conscientious citizen.",
    "question_answer": [
      {
        "index": 35,
        "question_word": "description",
        "real_word": "descriptors"
      },
      {
        "index": 51,
        "question_word": "currently",
        "real_word": "recently"
      },
      {
        "index": 58,
        "question_word": "volunteering",
        "real_word": "volunteer"
      },
      {
        "index": 62,
        "question_word": "server",
        "real_word": "several"
      },
      {
        "index": 68,
        "question_word": "bought",
        "real_word": "brought"
      },
      {
        "index": 76,
        "question_word": "widow",
        "real_word": "widower"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/e7b4f5665916897e04facd3a0ede2c2c0cc63da0.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Self-image is the picture you have of yourself, the sort of person you believe you are.\",\"dst\":\"自我形象是你对自己的想象，是那种你认为自己是的人。\"},{\"src\":\"Included in your self-image are the categories in which you place yourself, the roles you play and other similar descriptors you use to identify yourself.\",\"dst\":\"在你的自我形象中包括你所处的类别、你所扮演的角色以及你用来识别自己的其他类似描述。\"},{\"src\":\"If you tell an acquaintance you are a grandfather who recently lost his wife and who does volunteer work on weekends, several elements of your self-image are brought to light  the role of grandparent, widower and conscientious citizen.\",\"dst\":\"如果你告诉一个熟人你是一个最近失去妻子的祖父，他在周末做义工，你自我形象的几个要素就会暴露在外祖父母、鳏夫和有责任心的公民的角色上。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3328,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Demand for meat, drain and eggs is growing around the world. To meet that demand, the way these goods are produced is evolving. The change is from small farms to large industrious operations. This has already happened in the United States. But not everyone is happy with the change.  As a result, there is also a growing interest for products growing locally on small homesteads.",
    "question_answer": [
      {
        "index": 3,
        "question_word": "drain",
        "real_word": "milk"
      },
      {
        "index": 18,
        "question_word": "goods",
        "real_word": "products"
      },
      {
        "index": 22,
        "question_word": "evolving",
        "real_word": "changing"
      },
      {
        "index": 31,
        "question_word": "industrious",
        "real_word": "industrial"
      },
      {
        "index": 58,
        "question_word": "interest",
        "real_word": "demand"
      },
      {
        "index": 65,
        "question_word": "homesteads",
        "real_word": "farms"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/f7b7db163721770a97c72c509fac1f4385f2a831.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Demand for meat, milk and eggs is growing around the world.\",\"dst\":\"全世界对肉、奶和蛋的需求都在增长。\"},{\"src\":\"To meet that demand, the way these products are produced is changing.\",\"dst\":\"为了满足这种需求，这些产品的生产方式正在改变。\"},{\"src\":\"The change is from small farms to large industrial operations.\",\"dst\":\"这种变化是从小型农场向大型工业经营转变。\"},{\"src\":\"This has already happened in the United States.\",\"dst\":\"这种情况在美国已经发生过。\"},{\"src\":\"But not everyone is happy with the change.\",\"dst\":\"但并不是每个人都对这种变化感到高兴。\"},{\"src\":\"As a result, there is also a growing demand for products growing locally on small farms.\",\"dst\":\"因此，对当地小农场种植的产品的需求也越来越大。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3327,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Predicting the future is constantly risky. But it's probably safe to say that at least a few historians will one day speak of the 20th century as America's \"Disney era\". Today, it's certainly different to think of any other single thing that represents modern America as powerfully as the company that created Mickey Mouse. Internationally, brands like Coca-Cola and McDonalds may be more broadly known, but neither represents 20th-century America in quite the same way as Disney. The reasons for Disney's success are varied and numerous, but eventually the credit brings to one person the man who created the cartoon and built the company from nothing, Walt Disney.",
    "question_answer": [
      {
        "index": 4,
        "question_word": "constantly",
        "real_word": "always"
      },
      {
        "index": 33,
        "question_word": "different",
        "real_word": "difficult"
      },
      {
        "index": 54,
        "question_word": "Internationally",
        "real_word": "Globally"
      },
      {
        "index": 63,
        "question_word": "broadly",
        "real_word": "widely"
      },
      {
        "index": 87,
        "question_word": "eventually",
        "real_word": "ultimately"
      },
      {
        "index": 90,
        "question_word": "brings",
        "real_word": "belongs"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/660e275be7295c3f6a5a18f1d9dd3da4cc60c261.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Predicting the future is always risky.\",\"dst\":\"预测未来总是有风险的。\"},{\"src\":\"But it's probably safe to say that at least a few historians will one day speak of the 20th century as America's \\\"Disney era\\\".\",\"dst\":\"但可以肯定的是，至少有一部分历史学家会说20世纪是美国的“迪斯尼时代”。\"},{\"src\":\"Today, it's certainly difficult to think of any other single thing that represents modern America as powerfully as the company that created Mickey Mouse.\",\"dst\":\"今天，很难想象还有什么东西能像创造米老鼠的公司一样有力地代表现代美国。\"},{\"src\":\"Globally, brands like Coca-Cola and McDonalds may be more widely known, but neither represents 20th-century America in quite the same way as Disney.\",\"dst\":\"在全球范围内，像可口可乐和麦当劳这样的品牌可能更为广为人知，但它们都不像迪斯尼那样代表20世纪的美国。\"},{\"src\":\"The reasons for Disney's success are varied and numerous, but ultimately the credit belongs to one person the man who created the cartoon and built the company from nothing, Walt Disney.\",\"dst\":\"迪士尼成功的原因是多方面的，但归根结底，功劳属于一个人——创造这部动画片并白手起家创建公司的人——沃尔特·迪士尼。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3326,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Vitamin D is an essential element required by the body for the absorption of calcium, bone development, immune functioning and mitigation of inflammation. Vitamin D comes from the sun and from some foods like nuts, lentils and greasy fish. Researchers have found that low levels of vitamin D could be relevant to dementia and Alzheimer's disease, one of the most common forms of dementia. Alzheimer's disease can be debilitating for caregivers and frightening to those who have it. People with Alzheimer's disease said \"The worst thing that I found was I was getting lost in the car, not just forgetting where I was going, I wouldn't know where I was.",
    "question_answer": [
      {
        "index": 5,
        "question_word": "element",
        "real_word": "vitamin"
      },
      {
        "index": 20,
        "question_word": "mitigation",
        "real_word": "alleviation"
      },
      {
        "index": 37,
        "question_word": "greasy",
        "real_word": "fatty"
      },
      {
        "index": 50,
        "question_word": "relevant",
        "real_word": "related"
      },
      {
        "index": 68,
        "question_word": "debilitating",
        "real_word": "exhausting"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/3cda1391378c0e8d32dbd4579b4695a32835c080.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Vitamin D is an essential vitamin required by the body for the absorption of calcium, bone development, immune functioning and alleviation of inflammation.\",\"dst\":\"维生素D是人体吸收钙、骨骼发育、免疫功能和减轻炎症所必需的维生素。\"},{\"src\":\"Vitamin D comes from the sun and from some foods like nuts, lentils and fatty fish.\",\"dst\":\"维生素D来自太阳和一些食物，如坚果、小扁豆和脂肪鱼。\"},{\"src\":\"Researchers have found that low levels of vitamin D could be related to dementia and Alzheimer's disease, one of the most common forms of dementia.\",\"dst\":\"研究人员发现，维生素D含量低可能与痴呆症和老年痴呆症有关，老年痴呆症是最常见的痴呆症之一。\"},{\"src\":\"Alzheimer's disease can be exhausting for caregivers and frightening to those who have it.\",\"dst\":\"阿尔茨海默氏症对看护者来说是累人的，对那些患有此病的人来说是可怕的。\"},{\"src\":\"People with Alzheimer's disease said \\\"The worst thing that I found was I was getting lost in the car, not just forgetting where I was going, I wouldn't know where I was.\",\"dst\":\"患有老年痴呆症的人说：“我发现的最糟糕的事情是我在车里迷路了，不仅忘记了我要去哪里，我也不知道我在哪里。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 1,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3325,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "One of the most popular myths about the United States in the nineteenth century was that of the free and basic life of the farmer. It was said that farmers worked hard on their own land to produce whenever their families needed. They might sometimes exchange with neighbours; but in general they could get along just fine by relying on themselves, not on commercial ties with others. This is how Thomas Jefferson identified the farmer at the beginning of the nineteenth century, and, at that time, this may have been close to the reality - especially on the frontier.",
    "question_answer": [
      {
        "index": 20,
        "question_word": "basic",
        "real_word": "simple"
      },
      {
        "index": 38,
        "question_word": "whenever",
        "real_word": "whatever"
      },
      {
        "index": 45,
        "question_word": "exchange",
        "real_word": "trade"
      },
      {
        "index": 72,
        "question_word": "identified",
        "real_word": "idealized"
      },
      {
        "index": 93,
        "question_word": "reality",
        "real_word": "truth"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/b9164a8b11689cbb37ed5fe858c3d15bd7668818.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"One of the most popular myths about the United States in the nineteenth century was that of the free and simple life of the farmer.\",\"dst\":\"十九世纪关于美国最流行的神话之一是关于农民自由简朴的生活。\"},{\"src\":\"It was said that farmers worked hard on their own land to produce whatever their families needed.\",\"dst\":\"据说农民在自己的土地上辛勤劳作，以生产他们家庭所需要的任何东西。\"},{\"src\":\"They might sometimes trade with neighbours; but in general they could get along just fine by relying on themselves, not on commercial ties with others.\",\"dst\":\"他们有时会和邻居做生意；但总的来说，他们可以依靠自己而不是依靠与他人的商业关系相处得很好。\"},{\"src\":\"This is how Thomas Jefferson idealized the farmer at the beginning of the nineteenth century, and, at that time, this may have been close to the truth - especially on the frontier.\",\"dst\":\"这就是托马斯·杰斐逊在十九世纪初理想化农民的方式，在那个时候，这可能已经接近事实了——尤其是在边疆地区。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3324,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Many economists say U.S. growth will exceed a bit soon, which will likely make it easier for other nationals to sell their products in the world's biggest economy. Surging energy production is cutting costs and impelling U.S. economic growth, but increasing interest rates are acting as brakes on expansion. Some shops are busier, because the United States and other wealthy nations are shrinking off the recession and making more economic contribution.",
    "question_answer": [
      {
        "index": 6,
        "question_word": "exceed",
        "real_word": "accelerate"
      },
      {
        "index": 18,
        "question_word": "nationals",
        "real_word": "nations"
      },
      {
        "index": 35,
        "question_word": "impelling",
        "real_word": "spurring"
      },
      {
        "index": 40,
        "question_word": "increasing",
        "real_word": "rising"
      },
      {
        "index": 62,
        "question_word": "shrinking",
        "real_word": "shaking"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/6864437c184e84c1d7ac4008d761448d0bf4277b.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Many economists say U.S.growth will accelerate a bit soon, which will likely make it easier for other nations to sell their products in the world's biggest economy.\",\"dst\":\"许多经济学家表示，美国经济增长将很快加快一点，这可能会使其他国家更容易在这个世界上最大的经济体销售产品。\"},{\"src\":\"Surging energy production is cutting costs and spurring U.S.economic growth, but rising interest rates are acting as brakes on expansion.\",\"dst\":\"激增的能源生产正在削减成本，刺激美国经济增长，但不断上升的利率却在阻碍经济扩张。\"},{\"src\":\"Some shops are busier, because the United States and other wealthy nations are shaking off the recession and making more economic contribution.\",\"dst\":\"一些商店更为繁忙，因为美国和其他富裕国家正在摆脱经济衰退，做出更多的经济贡献。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3323,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "There are three main elements that combine to create either a positive or negative experience for listeners. They can result in a voice that is pleasing to listen to and can be used efficiently. Or they can create a voice that doesn't hold attractions, or even worse, causes an advance reaction. The three elements are volume, pitch, and pace. When  examining volume, keep in mind that a good speaker will adjust to the size of both the room and the audience. Of course, with an magnifying device like a microphone, the speaker can use a natural tone.",
    "question_answer": [
      {
        "index": 33,
        "question_word": "efficiently",
        "real_word": "effectively"
      },
      {
        "index": 43,
        "question_word": "attractions",
        "real_word": "attention"
      },
      {
        "index": 49,
        "question_word": "advance",
        "real_word": "adverse"
      },
      {
        "index": 61,
        "question_word": "examining",
        "real_word": "evaluating"
      },
      {
        "index": 86,
        "question_word": "magnifying",
        "real_word": "amplifying"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/52af4f86e2ff8fc821dc679ea5c948feba0e3088.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"There are three main elements that combine to create either a positive or negative experience for listeners.\",\"dst\":\"有三个主要因素结合起来，为听众创造积极或消极的体验。\"},{\"src\":\"They can result in a voice that is pleasing to listen to and can be used effectively.\",\"dst\":\"它们可以产生一种悦耳的声音，并且可以有效地使用。\"},{\"src\":\"Or they can create a voice that doesn't hold attention, or even worse, causes an adverse reaction.\",\"dst\":\"或者他们会制造一种无法引起注意的声音，甚至更糟，会引起不良反应。\"},{\"src\":\"The three elements are volume, pitch, and pace.\",\"dst\":\"这三个要素是音量、音高和节奏。\"},{\"src\":\"When  evaluating volume, keep in mind that a good speaker will adjust to the size of both the room and the audience.\",\"dst\":\"在评估音量时，请记住，一个好的演讲者会根据房间和观众的大小进行调整。\"},{\"src\":\"Of course, with an amplifying device like a microphone, the speaker can use a natural tone.\",\"dst\":\"当然，有了像麦克风这样的放大装置，说话者可以使用自然的音调。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3322,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "There are many superstitions in Britain, but one of the most widely held is that it is unlucky to stroll under a ladder even if it means strapping off the pavement into a busy street. If you must pass under a ladder you can avoid bad luck by across your fingers and keeping them crossed until you have seen a dog. Alternatively, you may lick your finger and make a cross on the toe of your shoe, and not look again at the shoe until the stamp has dried. Another common supervision is that it is unlucky to open an umbrella in the house. It will either convey misfortune to the person who opened it or to the whole household.",
    "question_answer": [
      {
        "index": 19,
        "question_word": "stroll",
        "real_word": "walk"
      },
      {
        "index": 27,
        "question_word": "strapping",
        "real_word": "stepping"
      },
      {
        "index": 48,
        "question_word": "across",
        "real_word": "crossing"
      },
      {
        "index": 86,
        "question_word": "stamp",
        "real_word": "mark"
      },
      {
        "index": 91,
        "question_word": "supervision",
        "real_word": "superstition"
      },
      {
        "index": 107,
        "question_word": "convey",
        "real_word": "bring"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/8dfa4a22e012feb3f670b5e6f7b30647068aa330.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"There are many superstitions in Britain, but one of the most widely held is that it is unlucky to walk under a ladder even if it means stepping off the pavement into a busy street.\",\"dst\":\"在英国有许多迷信，但其中一个最普遍的说法是，走在梯子下是不吉利的，即使这意味着从人行道上走到一条繁忙的街道上。\"},{\"src\":\"If you must pass under a ladder you can avoid bad luck by crossing your fingers and keeping them crossed until you have seen a dog.\",\"dst\":\"如果你必须从梯子下面经过，你可以交叉手指，直到你看到一条狗为止。\"},{\"src\":\"Alternatively, you may lick your finger and make a cross on the toe of your shoe, and not look again at the shoe until the mark has dried.\",\"dst\":\"或者，你可以舔你的手指，并在脚趾上做一个十字，不要再看鞋，直到标志干了。\"},{\"src\":\"Another common superstition is that it is unlucky to open an umbrella in the house.\",\"dst\":\"另一个常见的迷信是在家里开伞是不吉利的。\"},{\"src\":\"It will either bring misfortune to the person who opened it or to the whole household.\",\"dst\":\"它要么会给打开它的人带来不幸，要么会给全家带来不幸。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3321,
    "timecreated": 1515324102,
    "timemodified": 1515324102,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Patients with HIV often develop deficiencies of vitamins in the body. Researchers examining whether giving these patients a multivitamin with a mineral supplement helps to improve the body's natural defectives in fighting disease. For 30 years, AIDS has been a major health problem in some African countries south of the Sahara Dessert. In Botswana, one of every four adults is infected with HIV. Yet the country also has aggregate AIDS prevention campaigns.",
    "question_answer": [
      {
        "index": 5,
        "question_word": "deficiencies",
        "real_word": "shortages"
      },
      {
        "index": 12,
        "question_word": "examining",
        "real_word": "examined"
      },
      {
        "index": 29,
        "question_word": "defectives",
        "real_word": "defenses"
      },
      {
        "index": 51,
        "question_word": "Dessert",
        "real_word": "Desert"
      },
      {
        "index": 68,
        "question_word": "aggregate",
        "real_word": "aggressive"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/e04daad879d4b4ea38affc534962a5d7811fb46a.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Patients with HIV often develop shortages of vitamins in the body.\",\"dst\":\"艾滋病患者体内经常出现维生素短缺。\"},{\"src\":\"Researchers examined whether giving these patients a multivitamin with a mineral supplement helps to improve the body's natural defenses in fighting disease.\",\"dst\":\"研究人员研究了给这些病人补充多种维生素和矿物质是否有助于提高身体抵抗疾病的自然防御能力。\"},{\"src\":\"For 30 years, AIDS has been a major health problem in some African countries south of the Sahara Desert.\",\"dst\":\"30年来，艾滋病一直是撒哈拉沙漠以南一些非洲国家的主要健康问题。\"},{\"src\":\"In Botswana, one of every four adults is infected with HIV.\",\"dst\":\"在博茨瓦纳，每四个成年人中就有一个感染了艾滋病毒。\"},{\"src\":\"Yet the country also has aggressive AIDS prevention campaigns.\",\"dst\":\"然而，该国也开展了积极的艾滋病预防运动。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 3320,
    "timecreated": 1515324102,
    "timemodified": 1608606461,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Associations like the World Bank and the International Monetary Fund anticipate the international economy to perform better this year than in 2013. They also expect economy conditions to improve the next year. Yet one United States agency worries that economic progress is not creating enough jobs for the millions of people seeking employment. The U.N.'s International Labor Organization (ILO) is saying current economic development has not helped the world's unemployed. The ILO released a report on employment this week. Guy Ryder of Britain is the Director General of the agency. He says the joblessness numbers for 2013 represent an increase from the year before.",
    "question_answer": [
      {
        "index": 0,
        "question_word": "Associations",
        "real_word": "Organizations"
      },
      {
        "index": 10,
        "question_word": "anticipate",
        "real_word": "expect"
      },
      {
        "index": 25,
        "question_word": "economy",
        "real_word": "economic"
      },
      {
        "index": 63,
        "question_word": "development",
        "real_word": "growth"
      },
      {
        "index": 93,
        "question_word": "joblessness",
        "real_word": "unemployment"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/8fce7c3ff36b3b54841fe8d7d1534b1006491a6c.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Organizations like the World Bank and the International Monetary Fund expect the international economy to perform better this year than in 2013.\",\"dst\":\"世界银行（worldbank）和国际货币基金组织（imf）等组织预计，今年的国际经济表现将好于2013年。\"},{\"src\":\"They also expect economic conditions to improve the next year.\",\"dst\":\"他们还预计明年经济状况将有所改善。\"},{\"src\":\"Yet one United States agency worries that economic progress is not creating enough jobs for the millions of people seeking employment.\",\"dst\":\"然而，一家美国机构担心，经济发展并没有为数百万求职者创造足够的就业机会。\"},{\"src\":\"The U.N.'s International Labor Organization (ILO) is saying current economic growth has not helped the world's unemployed.\",\"dst\":\"联合国国际劳工组织（ILO）表示，目前的经济增长并没有帮助世界上的失业者。\"},{\"src\":\"The ILO released a report on employment this week.\",\"dst\":\"国际劳工组织本周发布了一份就业报告。\"},{\"src\":\"Guy Ryder of Britain is the Director General of the agency.\",\"dst\":\"英国的盖伊·莱德是该机构的总干事。\"},{\"src\":\"He says the unemployment numbers for 2013 represent an increase from the year before.\",\"dst\":\"他说，2013年的失业率比前一年有所上升。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 1951,
    "timecreated": 1510658251,
    "timemodified": 1510658251,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "The influence of climate change is so great that it could undermine the last 50 years of gains in global stability, according to the Lancet Commission report. Weather extremes made worse by climate change are potentially destructive and unpredictable, says Commission's project manager Nicolas Watts. \"In terms of drought, we often see associated decreases in agricultural yield, which then in turn has a profound impact on malnutrition, particularly for children\".",
    "question_answer": [
      {
        "index": 1,
        "question_word": "influence",
        "real_word": "impact"
      },
      {
        "index": 20,
        "question_word": "stability",
        "real_word": "health"
      },
      {
        "index": 38,
        "question_word": "unpredictable",
        "real_word": "unacceptable"
      },
      {
        "index": 42,
        "question_word": "manager",
        "real_word": "leader"
      },
      {
        "index": 52,
        "question_word": "associated",
        "real_word": "corresponding"
      },
      {
        "index": 56,
        "question_word": "yield",
        "real_word": "productivity"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/78f5378d624be05b840008fee9fa9ee6c3b74c24.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"The impact of climate change is so great that it could undermine the last 50 years of gains in global health, according to the Lancet Commission report.\",\"dst\":\"根据柳叶刀委员会的报告，气候变化的影响如此之大，它可能会破坏过去50年在全球卫生领域取得的成就。\"},{\"src\":\"Weather extremes made worse by climate change are potentially destructive and unacceptable, says Commission's project leader Nicolas Watts.\",\"dst\":\"委员会项目负责人尼古拉斯·瓦茨说，气候变化造成的极端天气具有潜在的破坏性，是不可接受的。\"},{\"src\":\"\\\"In terms of drought, we often see corresponding decreases in agricultural productivity, which then in turn has a profound impact on malnutrition, particularly for children\\\".\",\"dst\":\"“就干旱而言，我们经常看到农业生产力相应下降，这反过来又对营养不良，特别是对儿童的营养不良产生深远影响。”。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 1950,
    "timecreated": 1510658251,
    "timemodified": 1510658251,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "When the world mourned Nelson Mandela at his funeral on December 10, 2013, few would remember that early on, the leader of the modern South African nation was terrified and condemned by many nationals for advocating violence. As young, Nelson Mandela had a uncontrollable streak. He was a founding member of the Youth League of the African National Congress, against apartheid at a young age. In 1961, he founded and became co-chairman of the ANC's military wing.",
    "question_answer": [
      {
        "index": 20,
        "question_word": "leader",
        "real_word": "father"
      },
      {
        "index": 28,
        "question_word": "terrified",
        "real_word": "feared"
      },
      {
        "index": 33,
        "question_word": "nationals",
        "real_word": "nations"
      },
      {
        "index": 43,
        "question_word": "uncontrollable",
        "real_word": "rebellious"
      },
      {
        "index": 59,
        "question_word": "against",
        "real_word": "combating"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/decc82738b673b93a1ae1bf5cd5d05e70d33833d.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"When the world mourned Nelson Mandela at his funeral on December 10, 2013, few would remember that early on, the father of the modern South African nation was feared and condemned by many nations for advocating violence.\",\"dst\":\"2013年12月10日，当全世界在纳尔逊·曼德拉的葬礼上哀悼他时，很少有人会记得，早期，现代南非国父因鼓吹暴力而受到许多国家的恐惧和谴责。\"},{\"src\":\"As young, Nelson Mandela had a rebellious streak.\",\"dst\":\"纳尔逊·曼德拉年轻时就有叛逆的倾向。\"},{\"src\":\"He was a founding member of the Youth League of the African National Congress, combating apartheid at a young age.\",\"dst\":\"他是非洲国民大会青年团的创始成员，从小就反对种族隔离。\"},{\"src\":\"In 1961, he founded and became co-chairman of the ANC's military wing.\",\"dst\":\"1961年，他成立并成为非国大军事部门的联合主席。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 1949,
    "timecreated": 1510658251,
    "timemodified": 1510658251,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "It appears that when it comes to meeting our friends, much of our choice relies on genes. We are more genetically similar to our friends than we are to strangers. The theme song to Friends, a 1990s American situation show about a bunch of best friends. Two of the characters were related, but if they've been real life friends, the rest of them could have been as biologically close as relatives. Researchers from the University of California have analyzed gene variation in around 2,000 people, comparing pairs of unrelated friends with pairs of unrelated strangers. They proved that the friends had about 0.1% more DNA in common on average than strangers did. It's a small fraction that makes a huge difference.",
    "question_answer": [
      {
        "index": 7,
        "question_word": "meeting",
        "real_word": "choosing"
      },
      {
        "index": 14,
        "question_word": "relies",
        "real_word": "depends"
      },
      {
        "index": 39,
        "question_word": "show",
        "real_word": "mates"
      },
      {
        "index": 45,
        "question_word": "friends",
        "real_word": "cousins"
      },
      {
        "index": 70,
        "question_word": "relatives",
        "real_word": "found"
      },
      {
        "index": 96,
        "question_word": "proved",
        "real_word": "big"
      },
      {
        "index": 119,
        "question_word": "huge",
        "real_word": ""
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/a7d7349166f386d971cf328cb4bebdd6cbc0e479.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"It appears that when it comes to choosing our friends, much of our choice depends on genes.\",\"dst\":\"似乎在选择朋友时，我们的选择很大程度上取决于基因。\"},{\"src\":\"We are more genetically similar to our friends than we are to strangers.\",\"dst\":\"与陌生人相比，我们在基因上更像朋友。\"},{\"src\":\"The theme song to Friends, a 1990s American situation mates about a bunch of best cousins.\",\"dst\":\"《致朋友》的主题曲，是一首关于一群最好的堂兄弟姐妹的90年代美国情歌。\"},{\"src\":\"Two of the characters were related, but if they've been real life friends, the rest of them could have been as biologically close as found.\",\"dst\":\"其中两个角色是有血缘关系的，但如果他们是现实生活中的朋友，其余的人在生物学上可能和我们发现的一样亲密。\"},{\"src\":\"Researchers from the University of California have analyzed gene variation in around 2,000 people, comparing pairs of unrelated friends with pairs of unrelated strangers.\",\"dst\":\"加利福尼亚大学的研究人员分析了大约2000人的基因变异，比较了两对不相关的朋友和不相关的陌生人。\"},{\"src\":\"They big that the friends had about 0.1% more DNA in common on average than strangers did.\",\"dst\":\"他们发现，这些朋友的共同DNA平均比陌生人多0.1%。\"},{\"src\":\"It's a small fraction that makes a  difference.\",\"dst\":\"这是一个小的部分，使不同。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 1948,
    "timecreated": 1510658251,
    "timemodified": 1510658251,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Well, my recent research is really about consumer behavior. So lately, I've looked at young people's drinking and it's obviously a major problem to Government at the moment. I've also looked at how older people are represented in the media; again, it's of major current interest with older people becoming a much larger proportion of UK and indeed, world society. I'm also studied in how consumers operate online, and how that online behavior might be differed from how they operate offline when they go to the stores. Well, I think that the important thing here is to actually know what's happening from the consumer's perspective.",
    "question_answer": [
      {
        "index": 2,
        "question_word": "recent",
        "real_word": "current"
      },
      {
        "index": 10,
        "question_word": "lately",
        "real_word": "recently"
      },
      {
        "index": 22,
        "question_word": "problem",
        "real_word": "concern"
      },
      {
        "index": 62,
        "question_word": "studied",
        "real_word": "interested"
      },
      {
        "index": 75,
        "question_word": "differed",
        "real_word": "different"
      },
      {
        "index": 86,
        "question_word": "stores",
        "real_word": "shops"
      },
      {
        "index": 98,
        "question_word": "know",
        "real_word": "understand"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/ada9164ec06bb7aaa95430899d1a6f6521124b4e.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Well, my current research is really about consumer behavior.\",\"dst\":\"我现在的研究是关于消费者行为的。\"},{\"src\":\"So recently, I've looked at young people's drinking and it's obviously a major concern to Government at the moment.\",\"dst\":\"所以最近，我观察了年轻人的饮酒情况，这显然是目前政府关注的一个主要问题。\"},{\"src\":\"I've also looked at how older people are represented in the media; again, it's of major current interest with older people becoming a much larger proportion of UK and indeed, world society.\",\"dst\":\"我还研究了老年人在媒体中的代表性；同样，随着老年人在英国乃至世界社会中所占的比例越来越大，这也是当前人们的主要兴趣所在。\"},{\"src\":\"I'm also interested in how consumers operate online, and how that online behavior might be different from how they operate offline when they go to the shops.\",\"dst\":\"我还感兴趣的是消费者如何在网上经营，以及这种网上行为与他们去商店时的线下经营方式有何不同。\"},{\"src\":\"Well, I think that the important thing here is to actually understand what's happening from the consumer's perspective.\",\"dst\":\"好吧，我认为这里最重要的是从消费者的角度去理解正在发生的事情。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 1947,
    "timecreated": 1510658251,
    "timemodified": 1510658251,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Hi! I am Elizabeth Hoffler, Master of Social Work. I am a community worker, a lobbyist, and a special associate to the executive director at the National Association of Social Workers. Today we are going to be talking about becoming a social worker. Social work is the helping profession. Its key mission is to enhance human well-being and help meet the fundamental needs of all people, with a particular focus on those who are vulnerable, oppressed, and living in poverty. We often deal with complex human needs. Social work is differed from other professions, because we focus on the person and family. We deal with the external factors that affect a person's situation and outlook.",
    "question_answer": [
      {
        "index": 12,
        "question_word": "community",
        "real_word": "social"
      },
      {
        "index": 19,
        "question_word": "associate",
        "real_word": "assistant"
      },
      {
        "index": 50,
        "question_word": "key",
        "real_word": "primary"
      },
      {
        "index": 61,
        "question_word": "fundamental",
        "real_word": "basic"
      },
      {
        "index": 90,
        "question_word": "differed",
        "real_word": "different"
      },
      {
        "index": 101,
        "question_word": "family",
        "real_word": "environment"
      },
      {
        "index": 109,
        "question_word": "affect",
        "real_word": "impact"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/178bc575547b70dafefbd3f2bdbde6edf1e9dec5.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Hi!\",\"dst\":\"你好！\"},{\"src\":\"I am Elizabeth Hoffler, Master of Social Work.\",\"dst\":\"我是伊丽莎白·霍夫勒，社会工作硕士。\"},{\"src\":\"I am a social worker, a lobbyist, and a special assistant to the executive director at the National Association of Social Workers.\",\"dst\":\"我是一名社会工作者、说客，也是全国社会工作者协会执行主任的特别助理。\"},{\"src\":\"Today we are going to be talking about becoming a social worker.\",\"dst\":\"今天我们要讨论的是成为一名社会工作者。\"},{\"src\":\"Social work is the helping profession.\",\"dst\":\"社会工作是帮助人的职业。\"},{\"src\":\"Its primary mission is to enhance human well-being and help meet the basic needs of all people, with a particular focus on those who are vulnerable, oppressed, and living in poverty.\",\"dst\":\"它的首要任务是增进人类福祉，帮助满足所有人的基本需要，特别关注那些易受伤害、受压迫和生活贫困的人。\"},{\"src\":\"We often deal with complex human needs.\",\"dst\":\"我们经常处理复杂的人类需求。\"},{\"src\":\"Social work is different from other professions, because we focus on the person and environment.\",\"dst\":\"社会工作不同于其他职业，因为我们关注的是人和环境。\"},{\"src\":\"We deal with the external factors that impact a person's situation and outlook.\",\"dst\":\"我们处理影响一个人处境和前景的外部因素。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 1946,
    "timecreated": 1510658251,
    "timemodified": 1510658251,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Okay. So let's get started. And to start things off I think what we need to do is define a function. I'm going to define what love is but then most of the experiments I'm going to talk about are really focused more on presentation than love. And I'm going to pick a definition from a former classmate, Robert Sternberg, who is now the professor at Tufts University but was here on our faculty at Yale for nearly thirty years. And he has a theory of love that thinks that it's made up of three components: intimacy, passion, and commitment, or what is sometimes called decision commitment.",
    "question_answer": [
      {
        "index": 18,
        "question_word": "define",
        "real_word": "consider"
      },
      {
        "index": 20,
        "question_word": "function",
        "real_word": "definition"
      },
      {
        "index": 44,
        "question_word": "presentation",
        "real_word": "attraction"
      },
      {
        "index": 57,
        "question_word": "classmate",
        "real_word": "colleague"
      },
      {
        "index": 64,
        "question_word": "professor",
        "real_word": "dean"
      },
      {
        "index": 88,
        "question_word": "thinks",
        "real_word": "argues"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/6aca76367bd1d8083eb2e20894d66fbbf5dddc0a.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Okay.\",\"dst\":\"可以。\"},{\"src\":\"So let's get started.\",\"dst\":\"我们开始吧。\"},{\"src\":\"And to start things off I think what we need to do is consider a definition.\",\"dst\":\"首先，我认为我们需要做的是考虑一个定义。\"},{\"src\":\"I'm going to define what love is but then most of the experiments I'm going to talk about are really focused more on attraction than love.\",\"dst\":\"我将要定义什么是爱，但是我将要谈论的大多数实验实际上更多地关注吸引力而不是爱。\"},{\"src\":\"And I'm going to pick a definition from a former colleague, Robert Sternberg, who is now the dean at Tufts University but was here on our faculty at Yale for nearly thirty years.\",\"dst\":\"我要从以前的同事Robert Sternberg那里挑选一个定义，他现在是塔夫斯大学的院长，但在耶鲁大学教了将近三十年。\"},{\"src\":\"And he has a theory of love that argues that it's made up of three components: intimacy, passion, and commitment, or what is sometimes called decision commitment.\",\"dst\":\"他有一个关于爱的理论，认为爱由三部分组成：亲密、激情和承诺，或者有时被称为决定承诺。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 1945,
    "timecreated": 1510658251,
    "timemodified": 1510658251,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Most Americans don't eat enough fruits, vegetables or whole grains. Research now says adding vitamin to the teen diet may help reducing the risk of breast cancer. Discussions about the benefits of fiber are probably more usual in nursing homes than middle schools. But along comes a new study that could change that. Kristi King, a diet specialist at Texas Children's Hospital, finds it hard to get teenage patients' focus about healthy diet.",
    "question_answer": [
      {
        "index": 14,
        "question_word": "vitamin",
        "real_word": "fiber"
      },
      {
        "index": 21,
        "question_word": "reducing",
        "real_word": "lower"
      },
      {
        "index": 27,
        "question_word": "Discussions",
        "real_word": "Conversations"
      },
      {
        "index": 36,
        "question_word": "usual",
        "real_word": "common"
      },
      {
        "index": 41,
        "question_word": "middle",
        "real_word": "high"
      },
      {
        "index": 69,
        "question_word": "focus",
        "real_word": "attention"
      },
      {
        "index": 72,
        "question_word": "diet",
        "real_word": "eating"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/bd6087e8720b0b3fe23f9d675d64c7db067c1e73.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Most Americans don't eat enough fruits, vegetables or whole grains.\",\"dst\":\"大多数美国人没有吃足够的水果、蔬菜或全谷物。\"},{\"src\":\"Research now says adding fiber to the teen diet may help lower the risk of breast cancer.\",\"dst\":\"现在的研究表明，在青少年饮食中添加纤维可能有助于降低患乳腺癌的风险。\"},{\"src\":\"Conversations about the benefits of fiber are probably more common in nursing homes than high schools.\",\"dst\":\"关于纤维好处的谈话在疗养院可能比在高中更常见。\"},{\"src\":\"But along comes a new study that could change that.\",\"dst\":\"但随之而来的一项新的研究可能会改变这种状况。\"},{\"src\":\"Kristi King, a diet specialist at Texas Children's Hospital, finds it hard to get teenage patients' attention about healthy eating.\",\"dst\":\"得克萨斯州儿童医院的饮食专家克里斯蒂·金发现很难引起青少年患者对健康饮食的关注。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 1944,
    "timecreated": 1510658251,
    "timemodified": 1510658251,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "When facing a new situation, some people intend to rehearse their defeat by allowing too much time anticipating the worst. I remember dealing with a young lawyer who was about to begin her first jury trial. She was very nervous. I asked what expression she wanted to make on the jury. She replied: \"I don't want to look too inexperienced, I don't want them to realize this is my first trial.\" This lawyer had fallen victims to the \"don'ts\" syndrome  a form of negative goal setting. The \"don'ts\" can be self-fulfilling because your mind relates to pictures.",
    "question_answer": [
      {
        "index": 7,
        "question_word": "intend",
        "real_word": "tend"
      },
      {
        "index": 13,
        "question_word": "allowing",
        "real_word": "spending"
      },
      {
        "index": 22,
        "question_word": "dealing",
        "real_word": "talking"
      },
      {
        "index": 43,
        "question_word": "expression",
        "real_word": "impression"
      },
      {
        "index": 65,
        "question_word": "realize",
        "real_word": "suspect"
      },
      {
        "index": 95,
        "question_word": "relates",
        "real_word": "response"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/3b8a7bbe3bb6c59bda6647ecebc8616f9a758ce7.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"When facing a new situation, some people tend to rehearse their defeat by spending too much time anticipating the worst.\",\"dst\":\"当面对新情况时，有些人往往会花太多的时间去预测最坏的情况，以此来预演自己的失败。\"},{\"src\":\"I remember talking with a young lawyer who was about to begin her first jury trial.\",\"dst\":\"我记得和一位年轻的律师谈过，她即将开始她的第一次陪审团审判。\"},{\"src\":\"She was very nervous.\",\"dst\":\"她非常紧张。\"},{\"src\":\"I asked what impression she wanted to make on the jury.\",\"dst\":\"我问她想给陪审团留下什么印象。\"},{\"src\":\"She replied: \\\"I don't want to look too inexperienced, I don't want them to suspect this is my first trial.\\\" This lawyer had fallen victims to the \\\"don'ts\\\" syndrome  a form of negative goal setting.\",\"dst\":\"她回答说：“我不想显得太没经验，我不想让他们怀疑这是我的第一次审判。”这位律师成了“不做”综合症的受害者，这是一种消极的目标设定。\"},{\"src\":\"The \\\"don'ts\\\" can be self-fulfilling because your mind response to pictures.\",\"dst\":\"“不要”可以自我实现，因为你的大脑会对图片做出反应。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 1943,
    "timecreated": 1510658251,
    "timemodified": 1510658251,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Robert Frost was one of America's best-known and most honored famous writers. But his fame came late in his life. He was forty years old before Americans began to read his articles and praise them. Once his figure was established, however, it grew stronger and stronger during the rest of his own life. Someone once asked another American writer, Ernest Hemingway, how to become a writer. The best thing, he said, was to have an unhappy childhood. If this is real, Robert Frost's childhood was unhappy enough to turn him a very good writer.",
    "question_answer": [
      {
        "index": 10,
        "question_word": "famous",
        "real_word": "serious"
      },
      {
        "index": 31,
        "question_word": "articles",
        "real_word": "poems"
      },
      {
        "index": 37,
        "question_word": "figure",
        "real_word": "fame"
      },
      {
        "index": 51,
        "question_word": "own",
        "real_word": "long"
      },
      {
        "index": 80,
        "question_word": "real",
        "real_word": "true"
      },
      {
        "index": 88,
        "question_word": "turn",
        "real_word": "make"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/62e23ad3c51dfe68e90974ac83e21d886dd2964e.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Robert Frost was one of America's best-known and most honored serious writers.\",\"dst\":\"罗伯特·弗罗斯特是美国最著名、最受尊敬的严肃作家之一。\"},{\"src\":\"But his fame came late in his life.\",\"dst\":\"但他的名声在他晚年才出现。\"},{\"src\":\"He was forty years old before Americans began to read his poems and praise them.\",\"dst\":\"在美国人开始读他的诗并赞美他的诗之前，他已经四十岁了。\"},{\"src\":\"Once his fame was established, however, it grew stronger and stronger during the rest of his long life.\",\"dst\":\"然而，他的名声一经确立，在他漫长的余生中就越来越强大。\"},{\"src\":\"Someone once asked another American writer, Ernest Hemingway, how to become a writer.\",\"dst\":\"有人曾经问另一位美国作家，海明威，如何成为一名作家。\"},{\"src\":\"The best thing, he said, was to have an unhappy childhood.\",\"dst\":\"他说，最好的事情是有一个不快乐的童年。\"},{\"src\":\"If this is true, Robert Frost's childhood was unhappy enough to make him a very good writer.\",\"dst\":\"如果这是真的，罗伯特弗罗斯特的童年是不幸的，足以使他成为一个非常好的作家。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 1942,
    "timecreated": 1510658251,
    "timemodified": 1510658251,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "America's holiday shopping period starts on Black Friday, the day after Thanksgiving. It is the happiest shopping day of the year. Companies make the most money this time of year, about 20 to 30 percent of seasonal revenue. About 136 million consumers will shop during the Thanksgiving holiday weekend. More and more will shop online. In an era of instant information, shoppers can use their mobile phones to find products. About 183.8 million people will shop on Cyber Monday, the first Monday before Thanksgiving.",
    "question_answer": [
      {
        "index": 3,
        "question_word": "period",
        "real_word": "season"
      },
      {
        "index": 15,
        "question_word": "happiest",
        "real_word": "busiest"
      },
      {
        "index": 21,
        "question_word": "Companies",
        "real_word": "Retailers"
      },
      {
        "index": 36,
        "question_word": "seasonal",
        "real_word": "annual"
      },
      {
        "index": 41,
        "question_word": "consumers",
        "real_word": "people"
      },
      {
        "index": 69,
        "question_word": "products",
        "real_word": "deals"
      },
      {
        "index": 82,
        "question_word": "before",
        "real_word": "after"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/f61a175c02bd2cd2bda2d7b458a632fcdbb8fa1f.mov",
      "mimetype": "video/quicktime"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"America's holiday shopping season starts on Black Friday, the day after Thanksgiving.\",\"dst\":\"美国的假日购物季从感恩节后的黑色星期五开始。\"},{\"src\":\"It is the busiest shopping day of the year.\",\"dst\":\"这是一年中最繁忙的购物日。\"},{\"src\":\"Retailers make the most money this time of year, about 20 to 30 percent of annual revenue.\",\"dst\":\"每年这个时候，零售商赚的钱最多，约占年收入的20%到30%。\"},{\"src\":\"About 136 million people will shop during the Thanksgiving holiday weekend.\",\"dst\":\"大约1.36亿人将在感恩节周末购物。\"},{\"src\":\"More and more will shop online.\",\"dst\":\"越来越多的人会在网上购物。\"},{\"src\":\"In an era of instant information, shoppers can use their mobile phones to find deals.\",\"dst\":\"在即时信息时代，购物者可以用手机寻找交易。\"},{\"src\":\"About 183.8 million people will shop on Cyber Monday, the first Monday after Thanksgiving.\",\"dst\":\"大约1.838亿人将在感恩节后的第一个星期一“网络星期一”购物。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 510,
    "timecreated": 1508236871,
    "timemodified": 1531620189,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "China has invented a new approach to overseas investment, with planners saying they will now focus less on attracting large amounts of cash and more on selecting investments that will bring skills and technology into the country. The improvement in tactics, detailed in an official document released by the National Development and Reform Commission, comes after more than a year of heated debate over the role foreign investors should play in China's economy. China has long been one of the world's top places for foreign investment, and global companies poured in more than $70 billion last year, drawn by the country's low costs, manufacturing prowess and huge domestic market. But the inroads have caused some unease among both ordinary people and officials, who also want to see local companies do well.",
    "question_answer": [
      {
        "index": 2,
        "question_word": "invented",
        "real_word": "outlined"
      },
      {
        "index": 7,
        "question_word": "overseas",
        "real_word": "foreign"
      },
      {
        "index": 26,
        "question_word": "selecting",
        "real_word": "selective"
      },
      {
        "index": 38,
        "question_word": "improvement",
        "real_word": "change"
      },
      {
        "index": 46,
        "question_word": "released",
        "real_word": "published"
      },
      {
        "index": 82,
        "question_word": "places",
        "real_word": "destinations"
      },
      {
        "index": 87,
        "question_word": "global",
        "real_word": "international"
      },
      {
        "index": 127,
        "question_word": "local",
        "real_word": "domestic"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/498882618c7f050f9447de5ee59477280a45282f.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"China has outlined a new approach to foreign investment, with planners saying they will now focus less on attracting large amounts of cash and more on selective investments that will bring skills and technology into the country.\",\"dst\":\"中国提出了一种新的外商投资方式，规划者们表示，他们现在将不再把重点放在吸引大量现金上，而是更多地放在将技能和技术引入中国的选择性投资上。\"},{\"src\":\"The change in tactics, detailed in an official document published by the National Development and Reform Commission, comes after more than a year of heated debate over the role foreign investors should play in China's economy.\",\"dst\":\"中国国家发改委公布的一份官方文件中详细说明了这一策略的转变，此前一年多，有关外国投资者在中国经济中应扮演的角色的争论一直很激烈。\"},{\"src\":\"China has long been one of the world's top destinations for foreign investment, and international companies poured in more than $70 billion last year, drawn by the country's low costs, manufacturing prowess and huge domestic market.\",\"dst\":\"长期以来，中国一直是世界上最大的外国投资目的地之一，受中国低成本、制造业实力和巨大国内市场的拉动，国际企业去年涌入了700多亿美元。\"},{\"src\":\"But the inroads have caused some unease among both ordinary people and officials, who also want to see domestic companies do well.\",\"dst\":\"但是，这些进展在普通民众和官员中都引起了一些不安，他们也希望看到国内企业做得好。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 509,
    "timecreated": 1508236871,
    "timemodified": 1508236871,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Have you ever wanted to travel back through time and see what life was like at the dawn of man? Well, museums can make history come alive. And one museum in specific can take you on a exciting journey from the beginning of human culture to the recent day.  It is the British Museum. Being one of the largest museums in the world, it is home to over 7 million antiques from all the world's continents. While most of us may not have the chance to visit London, we can catch a glimpse of the treasures it holds in Beijing. From March 10 to June 10, more than 100 international relics will be on display in the Palace Museum.",
    "question_answer": [
      {
        "index": 31,
        "question_word": "specific",
        "real_word": "particular"
      },
      {
        "index": 37,
        "question_word": "exciting",
        "real_word": "thrilling"
      },
      {
        "index": 47,
        "question_word": "recent",
        "real_word": "present"
      },
      {
        "index": 71,
        "question_word": "antiques",
        "real_word": "objects"
      },
      {
        "index": 85,
        "question_word": "chance",
        "real_word": "opportunity"
      },
      {
        "index": 110,
        "question_word": "international",
        "real_word": "cultural"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/1d1a2f844df13ce6da0298d1f0f8cc52e487b654.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Have you ever wanted to travel back through time and see what life was like at the dawn of man?\",\"dst\":\"你有没有想过穿越时空，看看人类黎明时的生活是什么样的？\"},{\"src\":\"Well, museums can make history come alive.\",\"dst\":\"博物馆可以让历史活起来。\"},{\"src\":\"And one museum in particular can take you on a thrilling journey from the beginning of human culture to the present day.\",\"dst\":\"特别是一个博物馆可以带你踏上从人类文化开始到今天的惊险旅程。\"},{\"src\":\"It is the British Museum.\",\"dst\":\"它是大英博物馆。\"},{\"src\":\"Being one of the largest museums in the world, it is home to over 7 million objects from all the world's continents.\",\"dst\":\"作为世界上最大的博物馆之一，这里收藏着来自世界各大洲的700多万件文物。\"},{\"src\":\"While most of us may not have the opportunity to visit London, we can catch a glimpse of the treasures it holds in Beijing.\",\"dst\":\"虽然我们大多数人可能没有机会参观伦敦，但我们可以一睹它在北京的珍宝。\"},{\"src\":\"From March 10 to June 10, more than 100 cultural relics will be on display in the Palace Museum.\",\"dst\":\"从3月10日到6月10日，100多件文物将在故宫博物院展出。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 508,
    "timecreated": 1508236871,
    "timemodified": 1508236871,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Most volcanoes are safe. They rest peacefully for thousands of years. No one pays much attention to them. Mount St. Helens was one of these volcanoes. Until 1980, it was a magnificent recreation area. Its last eruption had been 123 years ago. No one was concerned about another one. In March 1980, Mount St. Helens began to make attentions. At first, there were some shaking movements. Then, small eruptions started. Some residents left immediately. Others felt there was no danger. But on the afternoon of May 18, 1980, the mountain blew its top. With the power of twenty-five atomic bombs, Mount St. Helens exploded.",
    "question_answer": [
      {
        "index": 3,
        "question_word": "safe",
        "real_word": "quiet"
      },
      {
        "index": 8,
        "question_word": "thousands",
        "real_word": "hundreds"
      },
      {
        "index": 31,
        "question_word": "magnificent",
        "real_word": "beautiful"
      },
      {
        "index": 45,
        "question_word": "concerned",
        "real_word": "worried"
      },
      {
        "index": 58,
        "question_word": "attentions",
        "real_word": "noises"
      },
      {
        "index": 69,
        "question_word": "started",
        "real_word": "occurred"
      },
      {
        "index": 83,
        "question_word": "afternoon",
        "real_word": "morning"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/b40ede40e37f32f10e57dc1585cf601de4ede3d7.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Most volcanoes are quiet.\",\"dst\":\"大多数火山都很安静。\"},{\"src\":\"They rest peacefully for hundreds of years.\",\"dst\":\"几百年来，他们一直在和平地休息。\"},{\"src\":\"No one pays much attention to them.\",\"dst\":\"没人注意他们。\"},{\"src\":\"Mount St.\",\"dst\":\"圣山。\"},{\"src\":\"Helens was one of these volcanoes.\",\"dst\":\"海伦斯火山就是其中之一。\"},{\"src\":\"Until 1980, it was a beautiful recreation area.\",\"dst\":\"直到1980年，它还是一个美丽的娱乐区。\"},{\"src\":\"Its last eruption had been 123 years ago.\",\"dst\":\"它最后一次喷发是在123年前。\"},{\"src\":\"No one was worried about another one.\",\"dst\":\"没有人担心另一个。\"},{\"src\":\"In March 1980, Mount St.\",\"dst\":\"1980年3月，圣。\"},{\"src\":\"Helens began to make noises.\",\"dst\":\"海伦开始发出声音。\"},{\"src\":\"At first, there were some shaking movements.\",\"dst\":\"起初，有一些摇晃的动作。\"},{\"src\":\"Then, small eruptions occurred.\",\"dst\":\"然后，小喷发发生了。\"},{\"src\":\"Some residents left immediately.\",\"dst\":\"一些居民立即离开。\"},{\"src\":\"Others felt there was no danger.\",\"dst\":\"其他人认为没有危险。\"},{\"src\":\"But on the morning of May 18, 1980, the mountain blew its top.\",\"dst\":\"但在1980年5月18日早上，这座山的山顶被风吹走了。\"},{\"src\":\"With the power of twenty-five atomic bombs, Mount St.\",\"dst\":\"拥有25颗原子弹的威力，圣。\"},{\"src\":\"Helens exploded.\",\"dst\":\"海伦爆炸了。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 507,
    "timecreated": 1508236871,
    "timemodified": 1508236871,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "More than a quarter of the world adult population are still unable to read and write. They are called illiterates. A worldwide activity to change this situation has been started by the United Nations, and the year 1990 has been designated as International Literacy Year.The idea from the United Nations is that literacy must be ended for both the individual and Third World development. Illiteracy is not only a concern of the developing countries. Adults in western nations are often too ashamed to admit they can't read and write. Therefore, they are unwilling to go to classes to change the situation.",
    "question_answer": [
      {
        "index": 22,
        "question_word": "activity",
        "real_word": "campaign"
      },
      {
        "index": 29,
        "question_word": "started",
        "real_word": ")"
      },
      {
        "index": 45,
        "question_word": "idea",
        "real_word": "launched"
      },
      {
        "index": 69,
        "question_word": "concern",
        "real_word": "message"
      },
      {
        "index": 92,
        "question_word": "unwilling",
        "real_word": "problem"
      },
      {
        "real_word": "unable"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/a3acd49374f0fc5e199ef7722137bcc7fdb9ddd5.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": null,
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 506,
    "timecreated": 1508236871,
    "timemodified": 1508236871,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Computers are considerably important in health care. But can they also help poor people escape poverty? Vikram Sheel Kumar thinks so. Mister Kumar is a doctor, an engineer and the founder of a small business in Boston, Massachusetts. And, in September, this 28-year-old received an prize for Technology in Service to Humanity, which came from Technology Review magazine. His goal is to improve health care in poor countries with the use of computers small enough to hold in one hand. These devices are known as personal digital assistants or P.D.A.'s.",
    "question_answer": [
      {
        "index": 2,
        "question_word": "considerably",
        "real_word": "increasingly"
      },
      {
        "index": 30,
        "question_word": "founder",
        "real_word": "owner"
      },
      {
        "index": 45,
        "question_word": "prize",
        "real_word": "award"
      },
      {
        "index": 67,
        "question_word": "countries",
        "real_word": "nations"
      },
      {
        "index": 70,
        "question_word": "use",
        "real_word": "help"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/67dc74df1c38b0124e41d81f5d09e7f29929c7fb.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Computers are increasingly important in health care.\",\"dst\":\"电脑在医疗保健中越来越重要。\"},{\"src\":\"But can they also help poor people escape poverty?\",\"dst\":\"但他们也能帮助穷人摆脱贫困吗？\"},{\"src\":\"Vikram Sheel Kumar thinks so.\",\"dst\":\"维克拉姆·谢尔·库马尔这样认为。\"},{\"src\":\"Mister Kumar is a doctor, an engineer and the owner of a small business in Boston, Massachusetts.\",\"dst\":\"库马尔先生是一名医生，一名工程师，在马萨诸塞州波士顿开了一家小企业。\"},{\"src\":\"And, in September, this 28-year-old received an award for Technology in Service to Humanity, which came from Technology Review magazine.\",\"dst\":\"今年9月，这位28岁的年轻人获得了《科技评论》杂志颁发的“为人类服务的科技奖”。\"},{\"src\":\"His goal is to improve health care in poor nations with the help of computers small enough to hold in one hand.\",\"dst\":\"他的目标是借助于一只手就能握住的小电脑来改善穷国的医疗保健。\"},{\"src\":\"These devices are known as personal digital assistants or P.D.A.'s.\",\"dst\":\"这些设备被称为个人数字助理或P.D.A。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 505,
    "timecreated": 1508236871,
    "timemodified": 1508236871,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Most of the colleges of education in the United States are doing an inappropriate job of preparing elementary teachers for educating children to read, a recent report by the US National Council on Teacher Quality (NCTQ) concludes.Teacher-education programmes across the US are failing to teach the five components of effective reading instruction that research has proved are necessary - phonemic awareness, confidence, vocabulary, fluency, and comprehension, according to \"What Education Schools Aren't Teaching About Reading and What Elementary Teachers Aren't Learning,\" published by NCTQ.",
    "question_answer": [
      {
        "index": 13,
        "question_word": "inappropriate",
        "real_word": "inadequate"
      },
      {
        "index": 20,
        "question_word": "educating",
        "real_word": "teaching"
      },
      {
        "index": 47,
        "question_word": "components",
        "real_word": "elements"
      },
      {
        "index": 57,
        "question_word": "necessary",
        "real_word": "essential"
      },
      {
        "index": 61,
        "question_word": "confidence",
        "real_word": "phonics"
      },
      {
        "index": 81,
        "question_word": "published",
        "real_word": ")"
      },
      {
        "real_word": "released"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/82b20301d089ebcfe3be827f1f61c2535e4000f1.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": null,
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 504,
    "timecreated": 1508236871,
    "timemodified": 1508236871,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "The Library of Congress is America's national library. It has thousands of books and other products. It has newspapers, popular publications as well as letters of ancient interest. It also has maps, photographs, art prints, videos, sound recordings and musical instruments. All together, it has more than 100 million objects. The Library of Congress is open to the public Monday through Sunday, except for public holidays. Anyone may go there and read anything in the collection. But no one is allowed to take books out of the building.",
    "question_answer": [
      {
        "index": 10,
        "question_word": "thousands",
        "real_word": "millions"
      },
      {
        "index": 15,
        "question_word": "products",
        "real_word": "objects"
      },
      {
        "index": 26,
        "question_word": "ancient",
        "real_word": "historical"
      },
      {
        "index": 35,
        "question_word": "videos",
        "real_word": "movies"
      },
      {
        "index": 61,
        "question_word": "Sunday",
        "real_word": "Saturday"
      },
      {
        "index": 80,
        "question_word": "allowed",
        "real_word": "permitted"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/b9df06a2773da2dc2336ff57d8c0a27655a7322b.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"The Library of Congress is America's national library.\",\"dst\":\"国会图书馆是美国的国家图书馆。\"},{\"src\":\"It has millions of books and other objects.\",\"dst\":\"它有数以百万计的书籍和其他物品。\"},{\"src\":\"It has newspapers, popular publications as well as letters of historical interest.\",\"dst\":\"它有报纸、通俗出版物和历史书信。\"},{\"src\":\"It also has maps, photographs, art prints, movies, sound recordings and musical instruments.\",\"dst\":\"它也有地图，照片，艺术印刷品，电影，录音和乐器。\"},{\"src\":\"All together, it has more than 100 million objects.\",\"dst\":\"加起来，它有超过1亿个物体。\"},{\"src\":\"The Library of Congress is open to the public Monday through Saturday, except for public holidays.\",\"dst\":\"国会图书馆星期一至星期六对公众开放，公共假日除外。\"},{\"src\":\"Anyone may go there and read anything in the collection.\",\"dst\":\"任何人都可以去那里阅读收藏中的任何东西。\"},{\"src\":\"But no one is permitted to take books out of the building.\",\"dst\":\"但任何人都不准把书带出大楼。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 503,
    "timecreated": 1508236871,
    "timemodified": 1625044513,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "Department stores are large retail stores selling many different kinds of product arranged in different departments. Such stores are found in nearly every important city in the world, and the large department stores often contain more than 100 separate departments. The two major selections of merchandise sold in department stores generally are clothes and home decorations .",
    "question_answer": [
      {
        "index": 11,
        "question_word": "product",
        "real_word": "merchandise"
      },
      {
        "index": 14,
        "question_word": "different",
        "real_word": "separate"
      },
      {
        "index": 43,
        "question_word": "selections",
        "real_word": "categories"
      },
      {
        "index": 55,
        "question_word": "decorations",
        "real_word": "furnishings"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/44ef5238831ef70c8568653043686829f1f6754a.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"Department stores are large retail stores selling many different kinds of merchandise separate.\",\"dst\":\"百货公司是大型零售商店，销售许多不同种类的商品。\"},{\"src\":\"Such stores are found in nearly every important city in the world, and the large department stores often contain more than 100 separate departments.\",\"dst\":\"几乎世界上每个重要城市都有这样的商店，大型百货公司通常有100多个独立的部门。\"},{\"src\":\"The two categories merchandise sold in department stores generally are clothes and furnishings.\",\"dst\":\"百货公司销售的两类商品一般是服装和家具。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 502,
    "timecreated": 1508236871,
    "timemodified": 1508236871,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "How men first learnt to invent words is unsure; in other words, the source of language is a mystery. All we really know is that men, unlike animals, somehow invented particular sounds to communicate thought and feelings, actions and things, so that they could communicate with each other; and that later they agreed upon certain signs, called letters, which could be joined to represent those sounds, and which could be written down. Those sounds, whether spoken, or written in letters we call words.",
    "question_answer": [
      {
        "index": 8,
        "question_word": "unsure",
        "real_word": "unknown"
      },
      {
        "index": 13,
        "question_word": "source",
        "real_word": "origin"
      },
      {
        "index": 30,
        "question_word": "particular",
        "real_word": "certain"
      },
      {
        "index": 33,
        "question_word": "communicate",
        "real_word": "express"
      },
      {
        "index": 61,
        "question_word": "joined",
        "real_word": "combined"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/cd636ce3d5bebc143f7397079ca11d13b56f050c.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"How men first learnt to invent words is unknown; in other words, the origin of language is a mystery.\",\"dst\":\"人们最初是如何学会发明文字的还不得而知；换句话说，语言的起源是个谜。\"},{\"src\":\"All we really know is that men, unlike animals, somehow invented certain sounds to express thought and feelings, actions and things, so that they could communicate with each other; and that later they agreed upon certain signs, called letters, which could be combined to represent those sounds, and which could be written down.\",\"dst\":\"我们真正知道的是，人类不同于动物，不知何故发明了某些声音来表达思想、感情、行为和事物，以便彼此交流；后来他们商定了一些符号，叫做字母，可以组合起来表示这些声音，也可以写下来。\"},{\"src\":\"Those sounds, whether spoken, or written in letters we call words.\",\"dst\":\"这些声音，无论是口头的，还是用我们称之为文字的字母书写的。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  },
  {
    "question_id": 501,
    "timecreated": 1508236871,
    "timemodified": 1508236871,
    "sub_type": "No Subtype",
    "type_id": 100007,
    "question_title": "",
    "question_text": "It's difficult to imagine the sea ever running out of fish. It's so vast, so deep, so mystical. Unfortunately, it's not bottomless. Over-fishing, coupled with negative fishing practices, is killing off the fish and ruining their environment.Destroy the fish, and you destroy the fishermen's means of living. At least 60 percent of the world's environmentally important fish species are already over-fished, or fished to the maximum. As a result, governments have had to close down some areas of sea to commercial fishing.",
    "question_answer": [
      {
        "index": 17,
        "question_word": "mystical",
        "real_word": "mysterious"
      },
      {
        "index": 25,
        "question_word": "negative",
        "real_word": "destructive"
      },
      {
        "index": 54,
        "question_word": "environmentally",
        "real_word": "commercially"
      },
      {
        "index": 65,
        "question_word": "maximum",
        "real_word": "limit"
      }
    ],
    "question_content": "",
    "question_explain": "",
    "highfreq": 0,
    "highfreq_order": 0,
    "weekly_repeat": 0,
    "course_type_id": 0,
    "question_type": "hiw",
    "course_type_name_en": null,
    "course_type_name_zh": null,
    "course_type_name_th": null,
    "video_id": null,
    "question_audio": {
      "filename": "https://pteplus.com.cn/api/v3/moodle_file/f076bf20984fe43326ff97e33b194706ce2877a7.mp3",
      "mimetype": "audio/mp3"
    },
    "question_image": {},
    "section": "listening",
    "tags": [],
    "highfreq_month": "",
    "il_count": 0,
    "practised_count": 0,
    "is_like": 0,
    "writing_time": 600,
    "is_keyking": 0,
    "read_only": 0,
    "is_autoplay": false,
    "waiting_time": 10,
    "question_translate": {
      "text_translate": "[{\"src\":\"It's difficult to imagine the sea ever running out of fish.\",\"dst\":\"很难想象大海会没有鱼了。\"},{\"src\":\"It's so vast, so deep, so mysterious.\",\"dst\":\"它是如此的广阔，如此的深邃，如此的神秘。\"},{\"src\":\"Unfortunately, it's not bottomless.\",\"dst\":\"不幸的是，它不是无底洞。\"},{\"src\":\"Over-fishing, coupled with destructive fishing practices, is killing off the fish and ruining their environment.Destroy the fish, and you destroy the fishermen's means of living.\",\"dst\":\"过度捕捞，再加上破坏性的捕捞行为，正在杀死鱼类并破坏它们的环境。破坏鱼类，你就破坏了渔民的生活方式。\"},{\"src\":\"At least 60 percent of the world's commercially important fish species are already over-fished, or fished to the limit.\",\"dst\":\"世界上至少有60%的重要商业鱼类已经过度捕捞，或捕捞到极限。\"},{\"src\":\"As a result, governments have had to close down some areas of sea to commercial fishing.\",\"dst\":\"因此，各国政府不得不关闭一些海域，禁止商业捕鱼。\"}]",
      "content_translate": null,
      "answer_translate": null
    },
    "meeted_status": 0,
    "meeted_count": 0,
    "timeuploaded": 0,
    "grade_remain": -1,
    "max_grade": 30,
    "today_practice_count": 0
  }
]